{
  "title": "NVIDIA (NASDAQ:NVDA) CEO Sells $13,482,000.00 in Stock",
  "url": "https://www.marketbeat.com/instant-alerts/jen-hsun-huang-sells-75000-shares-of-nvidia-corporation-nasdaqnvda-stock-2025-08-18/",
  "content": "NVIDIA Corporation (NASDAQ:NVDA - Get Free Report) CEO Jen Hsun Huang sold 75,000 shares of the business's stock in a transaction dated Friday, August 15th. The shares were sold at an average price of $179.76, for a total value of $13,482,000.00. Following the completion of the transaction, the chief executive officer directly owned 72,848,225 shares of the company's stock, valued at approximately $13,095,196,926. This trade represents a 0.10% decrease in their position. The transaction was disclosed in a filing with the Securities & Exchange Commission, which is available through the SEC website.\nJen Hsun Huang also recently made the following trade(s):\n- On Wednesday, August 13th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The shares were sold at an average price of $181.38, for a total value of $13,603,500.00.\n- On Monday, August 11th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The shares were sold at an average price of $182.74, for a total value of $13,705,500.00.\n- On Friday, August 8th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The shares were sold at an average price of $182.38, for a total value of $13,678,500.00.\n- On Wednesday, August 6th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $178.42, for a total value of $13,381,500.00.\n- On Monday, August 4th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $178.16, for a total value of $13,362,000.00.\n- On Friday, August 1st, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $174.00, for a total value of $13,050,000.00.\n- On Wednesday, July 30th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $178.74, for a total value of $13,405,500.00.\n- On Monday, July 28th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $175.22, for a total value of $13,141,500.00.\n- On Friday, July 25th, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $173.88, for a total value of $13,041,000.00.\n- On Wednesday, July 23rd, Jen Hsun Huang sold 75,000 shares of NVIDIA stock. The stock was sold at an average price of $169.54, for a total value of $12,715,500.00.\nNVIDIA Trading Up 1.7%\nNVDA stock traded up $3.01 during trading on Friday, hitting $177.99. The company had a trading volume of 172,179,840 shares, compared to its average volume of 157,824,752. The business has a 50-day moving average of $166.63 and a 200-day moving average of $136.90. NVIDIA Corporation has a one year low of $86.62 and a one year high of $184.48. The stock has a market cap of $4.34 trillion, a PE ratio of 57.42, a PEG ratio of 1.54 and a beta of 2.14. The company has a current ratio of 3.39, a quick ratio of 2.96 and a debt-to-equity ratio of 0.10.\nNVIDIA (NASDAQ:NVDA - Get Free Report) last posted its quarterly earnings results on Wednesday, May 28th. The computer hardware maker reported $0.81 earnings per share (EPS) for the quarter, missing analysts' consensus estimates of $0.87 by ($0.06). The business had revenue of $44.06 billion for the quarter, compared to the consensus estimate of $43.09 billion. NVIDIA had a return on equity of 105.09% and a net margin of 51.69%.NVIDIA's quarterly revenue was up 69.2% on a year-over-year basis. During the same quarter in the previous year, the company posted $0.61 earnings per share. NVIDIA has set its Q2 2026 guidance at EPS. Research analysts predict that NVIDIA Corporation will post 2.77 earnings per share for the current fiscal year.\nNVIDIA Dividend Announcement\nThe firm also recently announced a quarterly dividend, which was paid on Thursday, July 3rd. Stockholders of record on Wednesday, June 11th were given a dividend of $0.01 per share. The ex-dividend date of this dividend was Wednesday, June 11th. This represents a $0.04 annualized dividend and a dividend yield of 0.0%. NVIDIA's dividend payout ratio (DPR) is currently 1.29%.\nWall Street Analysts Forecast Growth\nSeveral research analysts have recently weighed in on the company. BNP Paribas upgraded NVIDIA to a \"hold\" rating in a research note on Friday, August 1st. Barclays increased their price target on NVIDIA from $170.00 to $200.00 and gave the stock an \"overweight\" rating in a research note on Tuesday, June 17th. The Goldman Sachs Group initiated coverage on NVIDIA in a research note on Thursday, July 10th. They issued a \"buy\" rating and a $185.00 target price for the company. Citigroup restated an \"overweight\" rating on shares of NVIDIA in a research note on Monday. Finally, UBS Group raised their target price on NVIDIA from $175.00 to $205.00 and gave the stock a \"buy\" rating in a research note on Thursday. Four investment analysts have rated the stock with a Strong Buy rating, thirty-two have assigned a Buy rating, five have given a Hold rating and one has given a Sell rating to the company. According to data from MarketBeat, NVIDIA currently has a consensus rating of \"Moderate Buy\" and an average target price of $192.44.\nRead Our Latest Analysis on NVDA\nInstitutional Trading of NVIDIA\nLarge investors have recently modified their holdings of the business. Harbor Asset Planning Inc. purchased a new position in shares of NVIDIA during the 2nd quarter valued at about $28,000. Winnow Wealth LLC purchased a new position in shares of NVIDIA during the 2nd quarter valued at about $32,000. Longfellow Investment Management Co. LLC raised its holdings in shares of NVIDIA by 47.9% during the 2nd quarter. Longfellow Investment Management Co. LLC now owns 207 shares of the computer hardware maker's stock valued at $33,000 after buying an additional 67 shares in the last quarter. Spurstone Advisory Services LLC purchased a new position in shares of NVIDIA during the 2nd quarter valued at about $40,000. Finally, Kathleen S. Wright Associates Inc. raised its holdings in shares of NVIDIA by 169.3% during the 1st quarter. Kathleen S. Wright Associates Inc. now owns 404 shares of the computer hardware maker's stock valued at $44,000 after buying an additional 254 shares in the last quarter. Institutional investors own 65.27% of the company's stock.\nAbout NVIDIA\n(\nGet Free Report)\nNVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications.\nSee Also\nBefore you consider NVIDIA, you'll want to hear this.\nMarketBeat keeps track of Wall Street's top-rated and best performing research analysts and the stocks they recommend to their clients on a daily basis. MarketBeat has identified the five stocks that top analysts are quietly whispering to their clients to buy now before the broader market catches on... and NVIDIA wasn't on the list.\nWhile NVIDIA currently has a Moderate Buy rating among analysts, top-rated analysts believe these five stocks are better buys.\nView The Five Stocks Here\nEnter your email address and we'll send you MarketBeat's list of seven stocks and why their long-term outlooks are very promising.\nGet This Free Report\nLike this article? Share it with a colleague.\nLink copied to clipboard.",
  "source": "MarketBeat",
  "published_at": null
}