{
  "title": "The 4 Best Business Laptops of 2025 | Reviews by Wirecutter",
  "url": "https://www.nytimes.com/wirecutter/reviews/best-business-laptops/",
  "content": "The Best Business Laptops\nA good business laptop works quickly, offers lengthy battery life, and has a few extra ports in case you need to plug into a meeting-room TV, or if a client hands you an older, USB-A thumb drive.\nThese laptops should also be easier and cheaper than traditional Windows laptops to repair, so you won’t lose access to your files and communication for long when something breaks.\nThe Asus ExpertBook P5 packs all of those features into a portable laptop with a high-resolution screen and enough processing power for you to work on a few projects at the same time. It also has impressive battery life, consistently lasting 16 hours in our tests.\nIf you want to spend a bit more for the lightest laptop possible and a superior screen, the Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition weighs just over 2 pounds and adds an OLED display.\nThe ExpertBook and the X1 Carbon are designed so that their screens, keyboards, speakers, and other parts can be repaired, but the Lenovo ThinkPad T14 Gen 6 (AMD) lets you swap out a few additional internal components, which makes it the best repairable business laptop.\nWe also recommend the Apple M4 MacBook Air as a budget pick. You need to take it to Apple if something breaks or goes wrong, but it has stores around the globe capable of quick repair or replacement.\nKey specs\nThe Asus ExpertBook P5 offers the same specs and performance as the more expensive business laptops we tested but for a lower price, plus it adds improvements such as a higher-resolution screen and a lightweight design. The ExpertBook P5 also includes USB-C, USB-A, and HDMI ports, a comfortable keyboard, and a huge trackpad, as well as a webcam cover and biometric logins through Windows facial recognition or a fingerprint reader.\nKey specs\nThe Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition provides a few significant upgrades over our top pick, but the most noticeable is that it’s dramatically lighter. We’ve recommended versions of the X1 Carbon for years, but this model weighs a half-pound less while adding a high-resolution OLED display. It still has USB-A, USB-C, and HDMI ports, as well as Lenovo’s classic keyboard, trackpad, and red pointer nib. However, its lightweight design and upgraded screen have some disadvantages, particularly much shorter battery life than our top pick offers.\nKey specs\nIf you prioritize having a laptop for a long time rather than a good time, the Lenovo ThinkPad T14 Gen 6 (AMD) is the laptop for you. It provides snappy performance, offers a variety of ports (including Ethernet), and, crucially, has slotted RAM that you can replace and upgrade. It also has a nice 1200p display and Lenovo’s signature trackpad, keyboard, and pointer nib. Our top pick, which is about the same price as this model, has a few upgrades that make it more comfortable to use and carry around, and that’s why it’s the better choice for most people. But if you want the ability to repair your laptop, the ThinkPad T14 Gen 6 is the one to get.\nKey specs\nThe Apple MacBook Air (13-inch, M4, 2025) doesn’t have many of the features that are important for a business laptop, such as a variety of ports or a user-repairable design. However, its processing power, battery life, and display are better than what you can find in any similarly priced Windows option, and Apple’s worldwide network of retail stores makes it easy to get your laptop repaired or replaced.\nThe research\n- Why you should trust us\n- Who this is for\n- How we picked\n- How we tested\n- Top pick: Asus ExpertBook P5\n- Upgrade pick: Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition\n- Best for repairability: Lenovo ThinkPad T14 Gen 6 (AMD)\n- Budget pick: Apple MacBook Air (13-inch, M4, 2025)\n- Other business laptops worth considering\n- The competition\n- Sources\nWhy you should trust us\nI’m a writer at Wirecutter covering monitors, laptops, tablets, and 3D printers. I specialize in devices designed for professionals, such as the best laptops for photo and video editors. I’ve also been building and repairing my own computers for nearly 20 years.\nFor this guide:\n- I researched more than 20 business laptops for potential inclusion in my tests, eventually testing 13 models over two weeks.\n- I attended CES 2025, one of the biggest tech trade shows of the year, to preview upcoming business laptops.\n- In addition to past reporting for this guide, I spoke with Ryan Fillon, a technical repair manager at ComputerCare, a company authorized by manufacturers such as Apple, Asus, Dell, HP, and Lenovo to repair their laptops.\n- Like all Wirecutter journalists, I review and test products with complete editorial independence. I’m never made aware of any business implications of my editorial recommendations. Read more about our editorial standards.\n- In accordance with Wirecutter standards, I return or donate all products I’ve tested once my assessment of them is complete. I never hang on to “freebies” once testing is done.\nWho this is for\nWhether you run a small business and need a new computer for it or simply want a longer-lasting laptop compatible with USB-A accessories, business laptops are a good choice because they have more ports and are typically more repairable than consumer-grade laptops.\nAs a rule, business laptops typically have HDMI, USB-A, and USB-C ports, though some also have Ethernet ports, microSD card readers, and SIM slots. If you still use a bunch of USB-A peripherals or often plug in an HDMI cable, a business laptop eliminates the need for most dongles.\nBusiness laptops have the same processing power and can run all the same applications as consumer laptops, but their repairable design and extra ports typically result in heavier and thicker models. However, our picks are still notably light and thin, with the exception of our repairable pick, which is a bit thicker and accommodates slots for replaceable RAM sticks.\nBecause consumer-grade laptops aren’t built with repairability in mind, components are typically soldered to the motherboard, or parts might not be readily or cheaply available for your specific model. Business laptops, in contrast, have publicly accessible repair manuals and parts that are easy to find and available for purchase online, and more of their components are located on separate circuit boards that are attached with screws.\nHowever, a repairable design isn’t a remedy for everything that can go wrong with a laptop, and repairing a business laptop isn’t necessarily a do-it-yourself process. Unless you feel comfortable troubleshooting, ordering parts online, and opening up the back of a laptop to swap out parts, confirm that you have access to at least one dependable computer-repair shop. (Online repair services are an option, but you would be without a laptop for longer.) Some repairs might still be expensive, especially if you need a new motherboard, which houses the CPU, the RAM, and typically a few of the ports. But paying for these parts and the associated labor is still cheaper than buying a new laptop.\nYou might also find that after years of use, the laptop isn’t worth repairing due to wear and tear, or that it has fallen behind in performance. But if you spill a drink on your keyboard or crack your screen, a business laptop will undoubtedly be easier to repair than a typical consumer model.\nHow we picked\nIt’s unlikely that you’re an enterprise IT manager deciding which laptop to buy for hundreds or thousands of employees, so for this guide we primarily sought business laptops that a person would buy for their own use or to run their small business. We tested a wide variety of business laptops that have the latest processors and other components, include a variety of ports, and can be repaired with a publicly provided repair manual and available parts. But when competitors’ performance and ports were equivalent, we prioritized size and weight over replaceable RAM slots.\nBusiness laptops can be split into two camps depending on how their RAM is installed, and each approach has its own benefits and drawbacks. Some laptops have RAM sticks pressed into RAM slots, which is helpful if you need to upgrade later or your RAM fails. However, laptops with this design are thicker and weigh up to a pound more. More commonly, RAM is soldered to the laptop’s motherboard. Laptops with soldered RAM tend to be thinner and lighter, but if that RAM fails, you can’t repair or replace it specifically; you have to replace the whole motherboard, which includes the processor and other costly components.\nBut how likely is your RAM to fail? We spoke with Ryan Fillon, a technical repair manager at ComputerCare, to try to figure that out. Fillon recommends laptops with replaceable storage and RAM to family and friends, as he has seen RAM failure over his years of repair experience. But Fillon told us that he more often sees business laptops that need repairs due to battery issues or problems with their display hinges, keycaps, or other accidental damage sustained from a spill or drop.\nMost manufacturers have switched to soldered RAM in recent years, and we haven’t seen reports of soldered RAM failing at high rates, nor have we encountered other reporting indicating that soldered RAM has other, unseen trade-offs or a shorter lifespan in comparison with other components.\nOur top pick in this guide provides a reasonable blend of performance, portability, and repairability, but if repairability is your top priority, we also recommend a laptop that includes slots for its RAM.\nHere are the ranked criteria that we use when choosing what models to test and when making picks for this guide:\n- Performance: A business laptop should be able to run any modern office software, so we consider Windows laptops with the latest processors, those in the Intel Core Ultra line. Although Apple laptops don’t meet most of our criteria for this guide, the M4 MacBook Air competes favorably against Windows options for hundreds of dollars less, so in the latest round we considered it as a budget pick. If you need a faster processor or a dedicated GPU for gaming, photo and video editing, or other work, check out our gaming laptop and pro laptop guides.\n- 14-inch IPS screen: We prefer 14-inch business laptops because they have more screen real estate for editing large documents or spreadsheets than 13-inch laptops do, yet they’re still smaller and lighter than 15-inch laptops. Most business laptops have 1080p screens and use IPS panels (rather than TN panels) to improve color accuracy and viewing angles. A handful have screens with a 1920×1200 resolution; these are taller and have more vertical pixels. That taller screen size, referred to as a 16:10 aspect ratio, makes it a little easier for you to multitask, especially when you’re reading documents or other columns of text. The scaling, or the size of text and other elements of the Windows operating system, can seem slightly large or cramped on a 1080p display. Higher resolutions, such as 1440p displays (or 1600p with a 16:10 aspect ratio), allow you to scale Windows to be smaller, which helps you fit more on screen without losing sharpness or readability.\n- Wide range of ports: We prefer systems with a mix of old and new ports for maximum flexibility. Every laptop we consider for this guide offers at least two USB-C ports (which you can use to link external monitors, charge the laptop, and connect USB-C accessories), at least one USB-A port, and an HDMI port. We also prefer laptops that provide an Ethernet jack and an SD or microSD card reader.\n- Good battery life: Our picks have lasted at least 12 hours in our battery tests, which simulate web browsing. We previously required a minimum battery life of eight hours, but laptops are generally getting more energy-efficient.\n- Reasonable size and weight: Business laptops are usually larger and heavier than consumer laptops, partly because they’re built to be sturdier and partly because components such as removable memory take up more space than non-upgradable parts. But every laptop we’ve tested for this guide has weighed less than 4 pounds, and most models weigh less than 3 pounds.\n- Upgradable and repairable: The models we look at for this guide are designed to be opened and serviced easily. The laptop should allow you to get at the SSD bay or slot, as well as the battery, with minimal effort; access to at least one RAM slot and the Wi-Fi card is a plus. And the laptop should let you replace the keyboard and other parts without forcing you to take the entire thing apart or to replace a bunch of other, unrelated components.\n- Competitive (if not low) price: Business laptops are typically more expensive than budget Windows laptops. Their prices fluctuate widely depending on discounts and coupon codes, but in general you should expect to spend between $1,100 and $1,500 for a good business laptop and between $1,600 and $2,000 for an outstanding one. Because most are designed to be upgraded, you can sometimes save money on memory and storage upgrades if you’re willing to do them yourself. And by being easier to upgrade and repair, a business laptop can give you better long-term value despite costing more up front.\n- Great keyboard and trackpad: Business laptops are the quintessential document and spreadsheet devices, so their keys and keyboard layouts should be comfortable to use over long periods. We also strongly prefer backlit keyboards, as well as Microsoft Precision Touchpads, as they’re accurate and compatible with Windows 11’s multitouch trackpad gestures.\n- Fingerprint reader or IR camera for speedier logins: With most business laptops, you use Windows 11’s Windows Hello feature to log in with your finger or face. This function requires an infrared camera to scan your face, alongside the laptop’s webcam.\nHow we tested\nWe tested each laptop for at least a day of ordinary work — namely, loading up and switching among a couple dozen browser tabs, using Google Docs, Google Sheets, and Slack constantly, and playing music and video. This process gave us a feel for each laptop’s keyboard, trackpad, screen, and general performance on common work tasks.\nTo test the batteries, we used a Calibrite Colorchecker Display Plus colorimeter to set each laptop’s screen backlight to 150 nits (or candelas per square meter, cd/m2) and ran a web-browsing battery test that cycled through web pages, email, Google Docs, and video. We ran the test three times on each laptop and averaged the results.\nWe also removed the bottom panel from each laptop and noted how many screws (and other things, if applicable) we would need to remove to access the memory, storage, and internal battery for repair or replacement. Replacing major components in a business laptop should be easier than it is for a consumer laptop, but replacing a screen, motherboard, or keyboard yourself can still void the warranty, so we didn’t test that firsthand.\nTop pick: Asus ExpertBook P5\nKey specs\nDuring our testing, we found ourselves coming back to the Asus ExpertBook P5 again and again. While its processing power is on a par with that of more expensive laptops, it’s lighter, and it has a longer-lasting battery, a bigger trackpad, and a higher-resolution screen. Those are all aspects that business laptops have traditionally traded away for cost reasons or easier repairability, but the ExpertBook P5 seems to have it all — except for slotted RAM.\nIt’s powerful enough for working on multiple projects at once. We recommend the version of the ExpertBook P5 with Intel’s Core Ultra 7 258V processor, which also powers three other laptops we tested for this round. We opened 50 Chrome tabs and ran a few work applications without experiencing any freezing or stuttering.\nIts screen is better than those of competitors for reading small text. The ExpertBook P5’s 2560×1600-pixel display is higher resolution than the screens of other laptops in the same price range. Thanks to that additional resolution, you can use Windows’s scaling feature to make menus and text on screen smaller while still being able to see and read them; doing so helps with multitasking, and in addition, text generally looks sharper when you have more pixels.\nIt has a long-lasting battery. The ExpertBook P5 lasted 16 hours 27 minutes on average during our battery test, which continually simulates web browsing until the computer’s battery dies. Those results surpassed what we got from nine of the 13 laptops we tested, which typically lasted 11 to 14 hours.\nIts trackpad and keyboard are comfortable to use. The laptop has a standard chiclet-style keyboard that includes a nifty feature to toggle the function row between the Fn layer and the F1 through F12 keys. It also has a fingerprint scanner on the power button. The right Ctrl key has been replaced with a Copilot key, which quickly pulls up a window to chat with Microsoft’s AI assistant, but it’s just as easy to ignore as the right Ctrl button if you don’t want to chat with your computer. The ExpertBook P5 also has a large trackpad — about the same size as the MacBook Air’s — that gives you a lot of room to swipe and use trackpad gestures. Many other business laptops, especially those from Lenovo, have smaller trackpads.\nIt can connect multiple USB-A accessories at once. The ExpertBook P5 has two USB-C Thunderbolt 4 ports, two USB-A ports capable of 10 Gbps, an HDMI 2.1 port, and a headphone jack. Thanks to the HDMI 2.1 port, you can connect an 8K or 10K display (if that’s something you do on a regular basis) or output 4K at 120 frames per second. The two USB-A ports allow you to plug in both a mouse and a keyboard or their respective wireless dongles.\nIt’s light and thin. The ExpertBook P5 weighs 2.8 pounds and measures less than three-quarters of an inch thick, so it’s slim enough to slip into a backpack or large purse. It also has a durable aluminum casing, which doesn’t add much weight.\nMost of its components can be repaired or replaced. Asus has a publicly available repair manual and sells parts for direct purchase and through third-party retailers.\nAsus provides a one-year accidental-damage warranty. The company’s Accidental Damage Protection program covers damage from dropping your laptop or spilling liquid on it, as well as electrical surges. Asus also includes a three-year warranty that covers the display and internal components such as RAM, if the laptop breaks during normal use.\nFlaws but not dealbreakers\nIt has annoying webcam software. When you use the ExpertBook P5’s webcam for the first time, you’ll see a digital watermark on your screen with placeholder introductory information. This feature puts your name and title on your video during a presentation, and for some reason Asus decided to turn it on by default with no directions for how to change it. To turn it off, click the Asus AI ExpertMeet icon in the Windows System Tray and disable Webcam Watermark.\nIt doesn’t have slots for replaceable RAM. Many laptop manufacturers, including Asus, have decided to solder RAM to the motherboard, because such a design decreases the thickness of the laptop. Only a handful of laptops still have RAM slots. Though RAM can fail, we don’t think that potential completely negates all the other aspects of the laptop that could also break but are repairable.\nUpgrade pick: Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition\nKey specs\nThe Lenovo ThinkPad X1 Carbon Gen 13 Aura Edition is the thinnest and lightest business laptop we’ve tested, but it still delivers great performance and even includes an 1800p OLED display.\nIt offers performance similar to that of our top pick in a slimmer package. The Lenovo ThinkPad X1 Carbon Gen 13 passed all the same tests as the Asus ExpertBook P5 did, keeping up with lots of Chrome tabs, Microsoft Office windows, and media streaming. However, it weighs about a pound less than our top pick, and it’s slightly slimmer, as it tapers the farther you get from the hinge.\nIt has a matte OLED display that handles reflections well. Most business laptops have tragically bad screens, but the X1 Carbon Gen 13 has a cutting-edge OLED display with a higher resolution and refresh rate in comparison with the competition. OLED displays are known for three big issues: They’re power-hungry, they’re not as bright as other display types, and they often have glossy coatings that cause distracting reflections.\nThe X1 Carbon Gen 13 solves two of those problems. Its screen is brighter than most of the other laptop displays we’ve encountered in our tests, reaching a maximum brightness of 415 nits, whereas many consumer OLED displays max out at 250 nits. That brighter screen is coupled with a matte coating that does a much better job of diffusing reflections in comparison with other OLEDs, so you won’t get distracted as easily by, say, the reflection of the sun shining through the glass window behind you at a coffee shop. The X1 Carbon Gen 13’s display also has a 120 Hz refresh rate, which means the screen’s pixels update 120 times per second rather than the traditional 60 Hz. Much like the 120 Hz screens found on flagship phones from Apple, Google, and Samsung, which make it more comfortable to scroll through text, the X1 Carbon Gen 13’s screen might make the motion of text and objects look more legible and fluid than on your older laptop’s display.\nIt has business-friendly ports and a decent webcam. The X1 Carbon Gen 13 has two USB-C Thunderbolt 4 ports, two USB-A ports, an HDMI port, and a headphone jack. The power button is located on the right side of the laptop next to the headphone jack.\nLenovo’s classic red pointer buttons eat up some trackpad space. The X1 Carbon Gen 13 has the smallest trackpad of our picks, mainly because of the three large buttons that occupy the top portion of the trackpad. Although you can use those buttons in conjunction with the trackpad, they are intended for use with the red pointer nub in the middle of the keyboard. This design could be a feature or a flaw, depending on whether you like Lenovo’s pointer.\nFlaws but not dealbreakers\nIts battery doesn’t last as long as that of our top pick. There are disadvantages to a supremely lightweight laptop with a power-hungry OLED display, and for the X1 Carbon Gen 13, the trade-off is in the battery life, which lasted about 12.6 hours on average in our tests. That result is about three hours less than what we got from our current top pick, but it’s still pretty good, as it beat our previous top pick’s battery life of 12 hours.\nIts webcam could use an upgrade. The X1 Carbon Gen 13’s webcam is only 1080p, lower resolution than the 5-megapixel camera of the Asus ExpertBook P5. It looks fine, but many competitors surpass it in quality.\nIts RAM isn’t upgradable. The X1 Carbon Gen 13’s RAM is soldered to the motherboard, so you can’t repair or upgrade it in the future. However, other internal components, such as its storage, battery, speakers, keyboard, and trackpad, can be repaired.\nBest for repairability: Lenovo ThinkPad T14 Gen 6 (AMD)\nKey specs\nThe Lenovo ThinkPad T14 Gen 6 (AMD) is a durable, repairable business laptop with a modern processor that can easily keep up with your browser tabs, spreadsheets, and accounting software. It’s in the T line of ThinkPads, which was originally designed for business users by IBM in 1992 and then purchased by Lenovo in the early aughts. The lineup is now a staple of enterprise IT departments. While the design has gotten less boxy in the past 30 years, it really hasn’t changed much, and as a result, it’s the heaviest and thickest laptop we’re recommending. We think that most people are willing to trade the ability to fully repair their laptops for the better experience that our top pick offers, but if you want to be able to upgrade your machine yourself, this is the laptop for you.\nIt’s as fast as our top pick. Lenovo offers a lot of different models of the ThinkPad T14 Gen 6 so that businesses can buy the version that meets their needs, but the model we recommend has a modern and fast AMD processor with performance similar to that of our top and upgrade picks. We opened up dozens of browser tabs packed with images and streaming media, alongside a few common productivity apps, and the ThinkPad T14 Gen 6 was able to efficiently manage the workload without slowing down.\nIts tall display is excellent for working with documents. The ThinkPad T14 Gen 6 has an IPS display with a resolution of 1200p, which is similar to the more standard 1080p but a bit taller, which gives you more vertical room; this makes it easier for you to compare documents side by side, for example, or to fit more rows of Excel data on the screen. (The other laptops we recommend also have a 16:10 aspect ratio.) The ThinkPad T14 Gen 6’s screen is also bright enough for use outside (except in direct sunlight), as it reached 415 nits in our tests.\nIt has the same Lenovo keyboard as our upgrade pick. Lenovo’s business laptops have similar keyboards, which is generally a good thing, as the keys offer deep travel and feel satisfying to press. The ThinkPad T14 Gen 6’s keyboard also has a red pointer nib in its middle, which you use in conjunction with three physical buttons that line the top of the trackpad. This trackpad is a bit smaller than that of our top pick because of those buttons, but if you like the Lenovo design, the functionality is typically worth the trade-off.\nIts webcam is high-resolution and has a privacy cover. Oddly enough, the ThinkPad T14 Gen 6 has a nicer, 5-megapixel webcam than our upgrade pick, which records only lower-resolution, 1080p video. This laptop also has a privacy cover that slides over the webcam when you aren’t using it, an appealing feature that’s also available on our other picks.\nIt’s the most repairable option we found. The ThinkPad T14 Gen 6 is built to be repaired. Finding its hardware maintenance manual and ordering parts online from Lenovo are easy, and its internal components are typically mounted with screws and other hardware that makes them easier to remove and replace. It has slots for its RAM, which is rare on laptops these days, as most manufacturers solder RAM to the motherboard for practical reasons such as the laptop’s size and weight.\nFlaws but not dealbreakers\nIt’s heavier than our other picks. Weighing 3.15 pounds, the ThinkPad T14 Gen 6 is one of the heaviest laptops we tested for this guide. It still isn’t as heavy as gaming or creative laptops bearing powerful GPUs, but we found its weight quite noticeable when comparing it against our top pick, which is about half a pound lighter and also slimmer. And when we compared the ThinkPad T14 Gen 6 with the ThinkPad X1 Carbon Gen 13, the difference was night and day — our upgrade pick weighs about a full pound less.\nBudget pick: Apple MacBook Air (13-inch, M4, 2025)\nKey specs\nThe Apple MacBook Air (13-inch, M4, 2025) might not be the obvious first choice for a business laptop, since it has only USB-C ports and is infamously impossible to repair yourself. But its price and Apple’s nationwide repair network make it a competitive option.\nIts performance is great for multitasking and doing light media work. The Air’s M4 processor is powerful enough for web browsing and office work spanning dozens of tabs and a few open applications. If you’re a Microsoft Office power user, we recommend a Windows laptop instead, as those applications work a bit more seamlessly on that platform. However, the M4 chip is more than enough for working in Word documents and Excel spreadsheets, and the MacBook Air held up to all the same tests as our top pick and upgrade pick did.\nIt beats many Windows laptops in battery life. The MacBook Air’s M4 chip is energy-efficient, and in our tests it delivered a 14.3-hour battery life, a notable result for a thin-and-light laptop. With a battery life of 14 hours, you can get through a day’s work, forget to charge your laptop overnight, and still eke out a few hours the next day without needing to plug it in. Our top pick, the Asus ExpertBook P5, has longer battery life but is also nearly a quarter-inch thicker.\nCompared with our top pick, it has a similarly nice screen. The M4 MacBook Air has a high-quality display with a 2560×1600 resolution, similar to the display of our top pick. In our tests, images looked sharp and vibrant, and text appeared crisp. Typically MacBook Air displays are also far more color-accurate than those of their business laptop or consumer Windows laptop counterparts.\nIt trades repairability for replaceability. Apple’s advantage for business users is its global network of physical stores, which can repair or replace computers on short notice. So although you can’t repair this laptop yourself, Apple’s repair support is superior to what you can get from many competitors. Available support also includes AppleCare+, an insurance program that subsidizes repairs for an annual subscription fee.\nFlaws but not dealbreakers\nIt isn’t the best business laptop. The M4 MacBook Air is a good fit if you do most of your work in a web browser, or if you don’t need the myriad of ports found on other business laptops in this guide. The M4 MacBook Air has only two USB-C ports and a headphone jack, and you have to use one USB-C port to charge the laptop. The easiest way to get around that limitation is to carry a USB-C hub, but a large portion of our advice in this guide is predicated on choosing a laptop with enough ports that you don’t need to worry about USB hubs or dongles. And the MacBook’s design is far less repairable than Windows options; even the storage is attached to the motherboard. Business laptops, in contrast, have removable storage drives that make data easier to recover by third-party repair services. Using cloud storage mitigates that risk, as it does with a Windows laptop, but that requires a monthly subscription fee. In the end, the M4 MacBook Air’s price, performance, screen, and availability make it a strong option for a budget business laptop if you don’t mind those compromises.\nOther business laptops worth considering\nIf you’re willing to pay more for great battery life and like the Lenovo trackpad: The Lenovo ThinkPad T14s Gen 6 had the best battery life we encountered, lasting more than 24 hours in one of our battery tests. It also provided performance similar to that of our top pick and upgrade pick, and it has a nice webcam and a reasonably good 1200p display. But it’s much more expensive than our other picks — you pay a $500 premium for the battery life.\nIf you’re willing to pay more for great battery life and hate the Lenovo trackpad: The Acer TravelMate P6 14 AI is as light and thin as our upgrade pick, with similar performance and a longer, 21.5-hour battery life. (This laptop, our picks, and the Lenovo ThinkPad T14s Gen 6 all use the same processor, which is why they perform similarly.) The TravelMate P6 14 AI also has an 1800p IPS touchscreen, as well as a pleasant-to-use keyboard without Lenovo’s pointing nib or trackpad with built-in buttons. This laptop’s webcam and speakers fared worse in testing than those of our picks, though. And this laptop isn’t as easy for individuals to repair as those from some other manufacturers: We couldn’t find any replacement parts available online when we entered our unit’s serial number, and its repair guide includes only a select handful of components, leaving out the speakers and other smaller parts.\nThe competition\nThe HP Elitebook X G1i is a premium business laptop that is similar in size, weight, and performance to our top pick but has a slightly lower-resolution display and costs about $900 more. However, the Elitebook X G1i does have longer battery life, at around 22 hours, and even though its display is lower-resolution, it gets brighter than those of our picks, which is useful for working outside. Its casing has rounded edges that make it especially comfortable to use, and it’s a nice laptop, but its cost and its lack of specific upgraded features over our picks kept it from taking a top spot this round.\nWith a silver-gray plastic exterior, a 1200p display, and a comfortable keyboard and trackpad, the Dell Pro 14 Plus looks like a standard-issue business laptop that you might get on your first day at an office. It has a middling 11.5-hour battery life, its 1080p webcam looks dated, and it’s far too expensive for what it offers in comparison with our picks.\nThe Dell Pro 14 Premium is a great business laptop that simply costs far too much for us to recommend. In our tests, its 1800p OLED display looked fantastic, and text was sharp and well defined with great contrast. It’s about the same weight and size as our top pick at 2.7 pounds and a smidgen under three-quarters of an inch thick, and its battery lasted 13.5 hours on average. Its flat keyboard, similar to those of the XPS line in previous years, might be as divisive as the Lenovo pointer nib, but we didn’t find it a hindrance. The Pro 14 Premium has a 8-megapixel webcam, but in our experience its image looked overprocessed and orange.\nThe Lenovo ThinkPad P14s Gen 6 (AMD) did not perform as admirably as its T-series siblings and failed to finish one of our graphics-based benchmarks. It was also heavier than other models, and its webcam looked a bit washed out.\nThe Lenovo ThinkPad T14 Gen 6 (Intel) we tested provided a less powerful processor than its AMD counterpart for about the same price, and its battery didn’t last as long in our tests. We’d stick with AMD for this midrange T14 line, as the AMD processor kept up with more expensive chips in our tests. Otherwise, this laptop is identical to the AMD version.\nThe Dynabook Tecra A40-M is a new business laptop from the company formerly known as Toshiba. Though it has the same Intel processor as the Lenovo ThinkPad T14 Gen 6 mentioned above, it performed slightly worse in our tests. The Tecra A40-M is also heavier than most of the other laptops we tested, and it lacks Windows Hello facial recognition. It’s a fine low-end to midrange business laptop, but our top pick is a better value.\nThe Asus Vivobook S 14 is basically a consumer version of our top pick, but it’s thinner and has an OLED display. The OLED screen is reflective and a little too glossy for a business display, and the screen consumes more power than its IPS counterpart in the ExpertBook P5, resulting in shorter battery life. The Vivobook S 14 is also thinner than the ExpertBook P5, and in our tests it felt flimsy for a business laptop, which prompted concerns about its long-term durability.\nApple’s 14-inch MacBook Pro and 16-inch MacBook Pro are both intended for professionals — “pro” is right in the name, after all. They’re light, their screens are fantastic, their keyboards and trackpads are good, and Apple’s support is usually responsive and helpful. We have a guide to MacBooks if you prefer macOS to Windows. But these laptops currently don’t meet most of our upgradability and repairability criteria for a good business laptop: They’re difficult to repair and usually impossible to upgrade, and they include just a handful of identical ports, necessitating a pile of dongles.\nThis article was edited by Arthur Gies and Caitlin McGarry.\nSources\nJohn Eaton, vice president, Park Place Storage Condominiums, phone interview, April 19, 2024\nAaron Holder, partner, Sound Microsystems, email interview, November 2, 2023\nRyan Fillon, technical repair manager, ComputerCare, video interview, July 23, 2025\nAdvertisement\nSKIP ADVERTISEMENT",
  "source": "The New York Times",
  "published_at": null
}