{
  "title": "Tesla faces an uphill battle as 6 major European electric vehicle markets report double-digit drops in sales",
  "url": "https://www.businessinsider.com/tesla-double-digit-sales-drops-in-6-european-countries-2025-5",
  "content": "- Tesla sales fell by up to 81% in some key European EV markets in April, signaling a major downturn.\n- Growing competition from rivals like China's BYD have affected Tesla sales.\n- Demand may have also been hurt by a backlash over Elon Musk's politics.\nTesla has seen a sharp decline in sales in key European markets, with electric vehicle registrations dropping by up to 81% in six major markets in April, compared to the same month last year.\nCar registration figures for France, Sweden, the Netherlands, Switzerland, Portugal, and Denmark, revealed double-digit declines for Tesla sales, Reuters reported.\nMany of these are high-income countries with robust charging infrastructure — typically fertile ground for Tesla.\nSales fell by 59% year-on-year in France, 81% in Sweden, 74% in the Netherlands, 50% in Switzerland, 33% in Portugal, and 67% in Denmark.\nThe main exceptions were Norway and Italy, which respectively saw a 12% and 29% increase in Tesla sales compared to April 2024, registration data from the Norwegian Road Federation and Italian Transport Ministry showed.\nHowever, Italian sales were still down an overall 4% in the first four months of 2025, per the Transport Ministry.\nWhy the two countries didn't follow a similar pattern of decline was unclear, and the overall trend suggests a significant drop-off in crucial markets.\nThis could partly be attributed to political tensions tied to Elon Musk's divisive role in the Trump administration and advocacy for right-wing European parties.\nThe \"Tesla Takedown\" movement arose earlier this year after Musk voiced support for parties including Germany's far-right Alternative for Germany.\nSo far this year, two Tesla sites, including the vehicles there, were defaced with orange paint in the Swedish cities of Stockholm and Malmö, as well as the Tesla branch in Lausanne, Switzerland.\nDemonstrations against Musk and Tesla were held across cities in the Netherlands, and protestors also gathered outside Tesla showrooms in Portugal and Denmark. A further 12 Teslas were set on fire in Toulouse, France.\nAlongside resistance to Musk and his politics, the Tesla drop-off in Europe could linked to growing competition in the EV market, notably from Chinese firms.\nTesla's aging model lineup has struggled to match newer EVs from rivals like China's BYD, whose models feature cutting-edge charging speeds and lower prices.\nProfessor Peter Wells, director of Cardiff University's Centre for Automotive Industry Research, told the BBC News in March: \"We've not seen the level of innovation in terms of the product range that perhaps Elon Musk should have been looking for. I think that is a big part of their problem.\"\nIn a 2011 interview with Bloomberg, Musk rejected the possibility of BYD becoming a viable competitor.\nBut last year, BYD reported $107 billion in revenue, compared to Tesla's $98 billion. It also reported its first-quarter earnings increased 100% compared to the same period last year.\nBYD has rolled out 1,000 kW chargers that are four times more powerful than Tesla's current chargers. These chargers, it says, can add 200 miles of range in just 15 minutes of charging.\nThe Tesla rival has also aggressively expanded outside China in recent years.\nTesla's dominance in Europe is waning — and reversing the trend may be Musk's toughest challenge yet.\nTesla did not immediately respond to a request for comment from Business Insider.",
  "source": "Business Insider",
  "published_at": null
}