{
  "title": "Nvidia is latest investor to back AV startup Nuro in $203M funding round",
  "url": "https://techcrunch.com/2025/08/21/nvidia-is-latest-investor-to-back-av-startup-nuro-in-203m-funding-round/",
  "content": "Nvidia is among a group of new investors to back Nuro — which develops self-driving software for delivery and ride-hailing services — in a funding round that has reached $203 million.\nThe Silicon Valley startup announced Thursday that several investors, including existing backer Baillie Gifford, added another $97 million to its Series E round. New investors include Icehouse Ventures, Kindred Ventures, Nvidia, and Pledge Ventures. Uber, which last month said it would make a “multi-hundred-million dollar” investment in Nuro as part of a broader deal with the electric car maker Lucid, also participated.\nNvidia’s investment follows years of technical collaboration with Nuro. The startup uses Nvidia GPUs for its large-scale data processing and model training, and its latest compute model is built on the Nvidia Drive AGX Thor platform.\nThe first $106 million tranche of Series E funding was announced in April. Investment accounts advised by T. Rowe Price Associates, Fidelity Management & Research Company, Tiger Global Management, Greylock Partners, and XN participated in that first block.\nNuro has raised $2.3 billion to date. Its Series E post-money valuation is $6 billion. That’s a 30% drop from its $8.6 billion valuation in 2021 when Nuro raised $600 million in a Series D round.\nMuch has changed in the past four years for Nuro and the broader autonomous vehicle industry. Like most startups in the nascent autonomous vehicle technology sector, Nuro was forced to examine its business model after economic conditions shut off the once-free-flowing tap of capital and ushered in a period of consolidation.\nNuro went through several rounds of layoffs in 2022 and 2023 before overhauling its business strategy. In 2024, Nuro scrapped plans to own and operate a fleet of low-speed, on-road delivery bots, and instead focused its efforts on licensing its technology to automakers and mobility providers, like ride-hail and delivery companies.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nThe pivot has appeared to gain some traction — notably in July when Uber announced plans to launch a robotaxi service using all-electric Lucid Gravity SUVs equipped with Nuro’s self-driving tech. Under the deal, Uber invested $300 million in Lucid and agreed to buy “at least” 20,000 of the EV maker’s Gravity SUVs over the next six years.\nUber also said it would invest an undisclosed “multi-hundred-million dollar” amount into Nuro. One source familiar with the agreement told TechCrunch the amount is more than Uber’s investment in Lucid.\nA portion of Uber’s investment has gone toward the Series E round. The remaining investment will be parceled out to Nuro as the company hits certain milestones.\nNuro co-founder and president Dave Ferguson said in a statement that the company is well-positioned to continue its next phase of growth with the new capital. He added that the company, which employs about 700 people, will focus on delivering new commercial partnerships to realize autonomy at global scale.\nWe’re always looking to evolve, and by providing some insight into your perspective and feedback into TechCrunch and our coverage and events, you can help us! Fill out this survey to let us know how we’re doing and get the chance to win a prize in return!",
  "source": "TechCrunch",
  "published_at": null
}