{
  "title": "Stock market today: Nasdaq secures record close as investors shake off tariff threats, eye key inflation data",
  "url": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-secures-record-close-as-investors-shake-off-tariff-threats-eye-key-inflation-data-200046379.html",
  "content": "Stock market today: Nasdaq secures record close as investors shake off tariff threats, eye key inflation data\nUS stocks rose on Monday with the Nasdaq (^IXIC) closing at a fresh record as Wall Street ultimately shrugged off renewed trade tensions and looked ahead to a key inflation report and the first wave of second quarter earnings.\nThe S&P 500 (^GSPC) and Dow Jones Industrial Average (^DJI) finished the mostly muted trading day up around 0.1% and 0.2%, respectively. The tech-heavy Nasdaq Composite (^IXIC) added around 0.3% to secure yet another all-time closing high.\nMeanwhile, bitcoin (BTC-USD) spiked above $123,000 for the first time as investors greeted the open of Congress's \"Crypto Week,\" but the asset dropped back below $120,000 later in the day. Stocks with crypto ties also rallied as the House of Representatives weighs three key pieces of crypto-related legislation.\nEarlier in the day, investors showed a diminished appetite for risk after President Trump said Saturday that the US will impose 30% tariffs on goods from the EU and Mexico from Aug. 1. The increased pressure on key US trading partners is testing the market's previous resilience in the face of escalating tariff tensions. Faith in the idea that Trump will back off from threatened hikes helped lift stocks to all-time highs last week.\nOfficials from the EU and Mexico are pushing to continue negotiations with the US in hopes of securing a lower rate via a new deal. The hiked tariffs as they stand are seen as likely to remake global trade relations and add to existing inflationary pressures.\nRead more: The latest on Trump's tariffs\nThat adds uncertainty ahead of consumer inflation data scheduled for release this week. Investors are looking to the June CPI report on Tuesday for signs of how earlier rounds of tariffs are impacting prices across the US economy. The reading will feed into expectations for the Fed's decision on interest rates due in just over two weeks.\nMeanwhile, Trump ratcheted up tensions with Russia over the war in Ukraine on Monday, threatening to impose \"secondary\" tariffs of up to 100% on the country. He also said the US would provide weapons to Ukraine.\nEarnings season kicks into swing this week, with all the major US banks due to report results starting on Tuesday. Investors are showing interest in IPO and M&A markets, while Wells Fargo (WFC) reports after being freed from a decade of stringent regulatory restrictions.\nLIVE COVERAGE IS OVER 21 updates",
  "source": "Yahoo Finance",
  "published_at": null
}