{
  "title": "Gravity may be finally catching up to Elon Musk as Tesla stock tumbles",
  "url": "https://www.cnn.com/2025/03/19/business/elon-musk-tesla-stock-nightcap",
  "content": "A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here.\nElon Musk’s DC power grab hasn’t been the Tesla-stock jet fuel investors were expecting.\nTesla shares have fallen more than 40% since January — erasing all of the “Trump bump” that briefly saw the stock gain more than 90% after Election Day. Musk, whose wealth is overwhelmingly linked to his Tesla holdings, has personally lost $121 billion from his net worth over the past three months.\nSo what happened? Why hasn’t Musk’s rapid ascent into oligarch territory helped rescue his “baby” (as President Trump called Tesla during the pair’s bizarre ad-like press conference last week on the South Lawn)?\nThere are two main reasons:\n- Tesla sales are cratering around the world, and…\n- Its CEO isn’t doing anything to stop it.\nWhile Musk is holed up in the EEOB looking for ways to break the federal government, Tesla’s core business is in crisis.\nThe company reported its first-ever drop in global sales last year, and this year isn’t looking much better. Wall Street analysts from RBC, UBS, Goldman Sachs, Mizuho and JPMorgan have all lowered their delivery forecasts for the company.\nIn China, in particular, Tesla is struggling to compete against domestic carmakers. Last month Tesla shipments in the country fell 49% year-over-year. Europe sales are also slumping, particularly in Germany, where consumers have been outraged over Musk’s support of a far-right nationalist party with links to Nazis. Sales tumbled 76% in Germany last month from a year earlier.\nThe news isn’t getting better for Tesla. Its stock got a double-shot of bad news out of China on Monday.\nIts No. 1 Chinese rival, BYD, unveiled a new charging system that can give its latest model cars 250 miles of range after just five minutes — twice as fast as Tesla’s charging rate.\nOn the same day, Tesla also launched a free monthlong trial of its “Full Self-Driving” software in China — a sign the company is desperately trying to reverse is declining market share.\nIts shares fell 5% in the US on Monday and another 5% on Tuesday after RBC lowered its price target in response to growing domestic competition.\nAll those headaches would amount to a dire problem for Tesla even if it had a normal CEO. But Tesla is run by the MAGA-pilled Musk, whose personal brand has gone from “OK, he’s a bit weird” a few years ago to “OK, he’s posting racist and antisemitic conspiracy theories” in 2025.\nTesla didn’t respond to a request for comment.\nA CNN poll last week found that 53% of Americans have a negative view of Musk, while roughly 60% say he has neither the right experience nor the right judgment to make the kinds of sweeping cuts his “department” is carrying out.\nWhile Tesla is still the best-selling electric vehicle brand in the US, competition is heating up, and Musk’s right-wing authoritarian turn appears to be doing real damage.\nPrices on pre-owned Teslas are falling at more than double the rate of the average car, according to research by CarGurus. Used cars overall have fallen 2.7% year over year, while used Teslas have declined 7.3%. A used Cybertruck, Tesla’s head-scratching experiment in car design that looks like it was based on a dare, is worth a whopping 58% less on the resale market.\nAnother report from Cars.com found that while searches for non-Tesla EVs were up 12% year-over-year last month, searches for Teslas have fallen 7%.\n“We struggle to think of anything analogous in the history of the automotive industry, in which a brand has lost so much value so quickly,” wrote JPMorgan analysts in a note to clients last week.\nAdding fuel to the backlash is a “Tesla Takedown” movement started by activists and spread on social media, advocating that people sell Tesla vehicles, dump the stock and protest at showrooms.\n“I’m getting rid of this car because I’m embarrassed to drive it,” Joe Romer, a Tesla owner in California, told CNN’s Julia Vargas Jones. “I’m tired of Elon Musk and all this garbage that’s going on.”\nEven Dan Ives, a tech analyst for Wedbush and historically one of Tesla’s biggest cheerleaders, appears to be losing patience with Musk.\nLast week, Ives wrote in a note to clients that while he is maintaining his “outperform” rating on the stock, investor patience is “wearing very thin.”\nBottom line: Wall Street has long been able to tolerate Musk because Tesla was a cutting-edge company with a product lots of people wanted to buy. Investors can look past all kinds of shenanigans if they’re getting a good return on investment.\nBut what happens when Tesla stops being the dominant player in electric vehicles? And what happens when Musk is too busy trying to fire federal workers to fix it? These are the kinds of questions rattling investors at a time when they already have plenty of nightmare fuel in the form of Trump’s economic agenda.\nMusk has made his name synonymous with Tesla — a fact that served them both well when Tesla seemed unstoppable and Musk became the world’s richest person.\nBut Tesla no longer seems unstoppable, and Musk no longer seems stable. That could prove a toxic pairing.",
  "source": "CNN",
  "published_at": null
}