{
  "title": "Market Penetration: What It Is and Strategies to Increase It",
  "url": "https://www.investopedia.com/terms/m/market-penetration.asp",
  "content": "Market penetration measures how many customers buy or use a product or service out of the total market.\nWhat Is Market Penetration?\nMarket penetration is a measure of how much a product or service is being used by consumers compared to its total estimated target market. Put simply, it refers to how well a product or service sells in the market. Generally expressed as a percentage, market penetration can be used to develop strategies employed to increase the market share of a particular product or service. Focusing on marketing penetration can increase sales but also runs the risk of backfiring if strategies aren't properly executed.\nKey Takeaways\n- Market penetration measures the use of a product or service by target customers compared to its total estimated market.\n- Market penetration relates to the number of potential customers who purchase a company’s product over a competitor's.\n- Market development is the strategy or action steps needed to increase market share or penetration.\n- Common market penetration strategies include lowering prices, acquiring competitors, targeting new markets, or introducing new products.\n- Companies must be mindful of how market penetration into new areas can jeopardize current relationships with customers, dilute equity branding, and confuse consumers.\nUnderstanding Market Penetration\nMarket penetration can determine the size of the potential market for a product or service. New entrants to the industry believe they can gain market share or a percentage of the total number of potential customers in the industry in a large market.\nFor example, if there are 300 million people in a country and 65 million of them own cell phones, the market penetration of cell phones would be approximately 22%. In theory, there are 235 million customers (78% of the population) without cell phones. The penetration numbers might indicate the potential for growth for cell phone makers.\nMarket penetration can assess an industry to determine the potential for companies to gain market share or grow their revenue through sales. For instance, the global cell phone market penetration is often used to estimate whether cell phone producers can meet their earnings and revenue estimates. If the market is saturated, the existing companies have the vast majority of the market share—leaving little room for new sales growth.\nA key component of market penetration is quantifying a company's market penetration. You can do this by calculating a firm's market penetration rate (discussed below). The rate is a ratio that compares a company's performance against the total market. This rate allows companies to compare where they are currently, where they have been, where they want to be, and how their competitors are performing.\nFast Fact\nThe market penetration rate allows a company to set a SMART goal that can be calculated and tracked over time.\nHow to Calculate Market Penetration\nMarket penetration describes what proportion of the market is saturated by a company. To calculate market penetration, you must know the number of customers a company secures in addition to the total market size.\nMarket Penetration Rate=TTMSCustomers Number×100where:TTMS=Total Target Market Size\nThe number of customers is a unique customer that the company secures. Some may choose to only use repeat customers to analyze the stronger consumer base. Others may choose any customer that transacts in a given period (e.g. over the past five years).\nThe total market size may be difficult to define, especially if the company has a broad geographical area or sells goods online. The total market size is not necessarily the population of the area. Rather, it is the total potential customers the company could have.\nAn alternative but similar way to calculate market penetration is to focus on dollars as opposed to people. Sometimes, industries may be quoted as having a certain value or sales potential, which means companies can compare what they've sold and compare it to this market potential.\nMarket Penetration Rate=TTMSPTotal Sales Dollars×100where:TTMSP=Total Target Market Sales Potential\nIn the latter formula, a company may care less about the number of customers it secures. This may be important for companies that want to secure the largest customers or biggest market participants. Though they may receive a small penetration rate, companies that transact with the largest customers may be in better shape when using the second formula.\nMarket Penetration for Companies\nMarket penetration can also be used by companies to assess their product's market share. As a metric, it relates to the number of potential customers who purchased a specific company’s product instead of a competitor’s product—or no product at all.\nMarket penetration is typically expressed as a percentage, meaning the company's product represents a certain percentage of the total market for those products. To calculate market penetration, the current sales volume for the product or service is divided by the total sales volume of all similar products, including those sold by competitors. The result is multiplied by 100.\nImportant\nMarket penetration is often cited as a percentage representing the total share of target customers attracted.\nIf a company has a high market penetration for its products, they're considered a market leader in that industry. Market leaders have a marketing advantage because they can reach more potential customers due to their well-established products and brands.\nFor example, a market leader and manufacturer of cereal will have far more shelf space and better positioning than competitor brands because their products are so popular.\nMarket leaders can also negotiate better terms with their suppliers because of their significant sales volume. As a result, market leaders can often produce a product cheaper than their competitors, given the scale of their operation.\nMarket Penetration Strategies\nThere are often four ways of implementing growth strategies: developing new markets, diversifying product lines, penetrating existing markets, or developing new products. These four strategies are often depicted in an Ansoff Matrix.\nBecause the strategies that require new markets or products are considered riskier, market penetration is often the lower-risk option for growth. This is because the market has already been created and can be studied. The company may already offer a product or a variation. Using some of the techniques below, a company may experience growth through market penetration.\nChange Product Pricing\nA company won't be able to increase market share by increasing its price. However, Veblen goods contradict the law of supply and demand, and a company can increase market penetration by increasing its prices for such goods. For other goods, it would need to lower prices.\nThis requires the company to sufficiently understand its input costs and profit margins. It also requires an understanding of its consumer base and whether a lower price will attract the audience the company intends to have for the long term.\nCreate New Product\nThough market penetration often occurs with existing products, a company may be able to solve a customer's problem with a new product innovation.\nThough this riskier option does not guarantee market adoption, a company may invest in research and development (R&D) to study existing products, analyze gaps in value, detect where existing products fall short of consumer expectations, and manufacture a new product.\nTarget New Geographies\nBusinesses may already have access to wider markets thanks to online sales. But, service companies that may be restricted to one geographic region may employ the market penetration strategy of moving, developing, and expanding to a new area.\nWithout having to leave their original location, they may be able to fund operations in a new site by leveraging success at an existing site.\nSeek Partnerships\nInstead of seeking new places to operate, companies may penetrate new markets by seeking new people to work with. Consider the Barnes & Noble and Starbucks partnership. By agreeing to share in the success of internally operated cafes within bookstores, Starbucks entered a different market it otherwise couldn't have accessed.\nFast Fact\nIn the example above, it would have been critical for Starbucks to consider how its brand image integrated with Barnes & Noble. Without careful consideration, customers may have been confused to see it within other types of stores (i.e. consider a Starbucks inside of a Home Depot).\nInnovate Existing Product(s)\nCompanies may simply need to revamp an existing product. This is evident with the frequent releases of updated smartwatches, cellphones, gaming consoles, and other technological devices.\nWith each iteration, a company can simply improve on the previous one and offer new benefits. Existing customers who experience the old devices may be further inclined to upgrade after a positive experience.\nAcquire Other Companies\nThough partnerships entail two separate entities temporarily coming together to share in the success, acquisitions result in two separate entities legally joining together. By acquiring a company, the acquirer may instantly have access to new products, markets, labor skill sets, intangible assets like goodwill, or research & development.\nCreate Promotional Opportunities\nCompanies that do not want to permanently discount their prices can penetrate markets by offering temporary promotional opportunities. This strategy lures consumers in by attracting them to low prices.\nBe advised that though this may result in short-term success, it is more likely to lead to the incorrect audience having been attracted, especially if a company strives to be a higher-quality (and therefore higher price) company.\nInvest (More) in Sales Representatives\nCompanies may have everything they need to successfully bring a product to market. But, their product may fail if they don't have enough staff. No matter how strong a manufactured product is, a company must be able to bring it to market, communicate its value, and close sales. This may require an increase in the headcount of sales reps or investing in stronger talent.\nAdvantages and Disadvantages of Market Penetration\nAdvantages\n- Increases sales: Companies can leverage successful market penetration by being more strategic with what they offer customers. Instead of being a price taker, companies with a deeper presence in a market can set their own price and sale terms or enhance their products. In many ways, market penetration can only occur through product differentiation and being able to convey unique benefits to consumers.\n- Increases customer base: Market penetration strategies often entail increasing the number of customers served or becoming more deeply engrained in the larger customers they serve.\n- Improves product visibility: Market penetration leads to higher visibility of products or services, and markets may begin to better recognize the benefits a company may be able to offer.\n- Improves brand equity: allows a company's brand equity to increase, as public perception of a company is most often improved as the company penetrates new markets.\nDisadvantages\n- Risk of backfiring: When companies seek out new markets or offer new products, they always run the risk of diminishing their existing image. This can create the wrong public perceptions or attract a client base that does not align with their strategic plan. Companies may be forced to liquidate products by selling them at a discount if they no longer resonate with consumers in markets they penetrated.\n- May attract the wrong customers: Market penetration may increase the risk of the wrong customers being served. This can hurt a marketing plan that caters to customers willing to pay certain prices for a certain quality of goods. Should Apple accidentally attract consumers who want to pay the lowest prices in the market, it will face a dilemma in trying to retain those customers or shifting its marketing plan.\n- Requires alignment of all departments: Market penetration requires everyone to be on the same page. Consider how the manufacturing, warehousing, procurement, or selling departments may not be aligned. This puts undue pressure on some departments that may need to play catch-up as markets are penetrated.\nIncreases sales\nIncreases customer base\nImproves product visibility\nImproves brand equity\nRisk of backfiring\nMay attract the wrong customers\nRequires alignment of all departments\nExample of Market Penetration\nAs of the fourth quarter of 2024, Apple (AAPL) had a 23% market share of the smartphone market, second to Samsung, which has a 16% market share.\nApple consistently introduces new versions of its iPhone every year, with added enhancements and upgrades, making the phone a compelling product to buy for consumers. As a result of its market penetration, Apple has maintained a large market share when compared to some other competitors, such as Xiaomi and Vivo.\nHowever, the company still has opportunities to add to its customer base by targeting its competitors' clients, primarily Samsung, to woo them over to the iPhone and grab further market share.\nWhy Use Market Penetration Strategies?\nMarket penetration strategies are used to ultimately increase the number of customers and sales dollars of a company. Market penetration is the act of gaining a deeper presence in a market; by employing strategies to increase how deep a company is engrained in a market, that company often has greater short-term and long-term financial health, is better in tune with what its customers want, and is often better positioned compared to its competition.\nWhat Is the Difference Between Market Penetration and Market Share?\nThough both terms are used interchangeably, market penetration and market share are different. Market penetration is often used to describe just the percentage of target audience a company sells to, while market share takes a more holistic approach and looks at the percentage of the total addressable market a company sells to.\nDoes Market Penetration Increase Market Share?\nBecause market penetration is a more specific measurement of how much of a given market a company sells to, increasing market penetration often increases market share potential. For example, consider Apple moving into the smartwatch industry. Not only does this increase its market penetration potential, but it is now part of an entirely new market and could potentially land parts of this new market share.\nThe Bottom Line\nMarket penetration is a measurement of how much of a product is used compared to a company's target audience. There are many strategies a company can use to increase its market penetration including changing its pricing, marketing, manufacturing, or operating strategies. A company must be mindful to stay true to its target audience and broadly communicate penetration strategies across the company.",
  "source": "Investopedia",
  "published_at": null
}