{
  "title": "Markets News, May 29, 2025: Stocks Rise as Investors Digest Strong Nvidia Results, Court Rulings on Tariffs",
  "url": "https://www.investopedia.com/dow-jones-today-05292025-11744203",
  "content": "Stocks closed slightly higher on Thursday as investors monitored legal wrangling over the Trump administration's tariff policy, while the technology sector rallied following a strong earnings report from AI chipmaker Nvidia.\nThe S&P 500 and tech-heavy Nasdaq Composite each gained 0.4%, finishing the day well off their highs for the session, while the Dow Jones Industrial Average added 0.3%. The major indexes had finished slightly lower on Wednesday as investors braced for the highly anticipated quarterly results from Nvidia (NVDA), which has become the poster child for the AI boom.\nShortly after the closing bell yesterday, Nvidia reported that its fiscal first-quarter revenue surged 69% from the year-ago period to $44 billion, while CEO Jensen Huang said that demand remains \"incredibly strong\" and is likely to accelerate as AI adoption becomes mainstream.\nNvidia shares rose more than 3% Thursday, after hitting their highest level in three months and briefly putting the chipmaker back to the top of the list of the world's most valuable companies. Other mega cap tech stocks finished the day mostly higher but well off their early-session highs. Microsoft (MSFT), Amazon (AMZN), Meta Platforms (META), Tesla (TSLA) and Broadcom (AVGO) gained ground while Apple (AAPL) and Alphabet (GOOG) fell slightly.\nMarket participants were closely tracking developments on the trade front after a federal court late Wednesday said that President Donald Trump had overstepped his authority by invoking the International Emergency Economic Powers Act to impose massive tariffs on leading U.S. trade partners. An appeals court this afternoon temporarily paused the trade court's ruling that had voided most of the tariffs. Uncertainty about trade policy has roiled financial markets in recent months, though the stock market has largely recovered from its early-April tariff-related swoon as Trump has appeared to soften his stance.\nHP Inc. (HPQ) tumbled more that 8% to lead S&P 500 decliners after the PC manufacturer lowered its full-year guidance, citing the impact of trade-related costs. Shares of Best Buy (BBY) dropped about 7% after the electronics retailer cut its outlook, also due to the expected impact of tariffs\nAmong other noteworthy movers, shares of Boeing (BA) rose more than 3% to pace Dow gainers after CEO Kelly Ortberg said that aircraft deliveries to China will start again next month. Salesforce (CRM) shares were down more than 3% to lead Dow decliners even as the cloud software giant reported better than expected results.\nBitcoin was at $106,300 in late-afternoon trading, down from a high this morning of just below $109,000. The digital currency hit an all-time high of $112,000 last week, its first record since just before Trump's inauguration in January.\nThe yield on the 10-year Treasury note, which affects borrowing costs on all sorts of consumer and corporate loans, fell to 4.43% from 4.48% at yesterday's close. The yield moved as high as 4.63% last week, its highest level in more than three months, amid rising concerns about the federal deficit as the GOP tax and spending bill moved through Congress.\nThe U.S. dollar index, which measures the performance of the dollar against a basket of foreign currencies, was down 0.5% at 99.35.\nGold futures were up 0.6% at $3,315 per ounce, rebounding from two straight days of declines, while West Texas Intermediate futures, the U.S. crude oil benchmark, slipped 1.5% to $60.90 per barrel, giving back the previous session's gains.\nBiggest S&P 500 Movers on Thursday\nAdvancers\n- Nordson (NDSN) shares jumped 6.8%, the most of any stock in the S&P 500, after the maker of industrial adhesives testing equipment topped sales and profit forecasts with its fiscal second-quarter results. Contributions from recent acquisitions and strength in the Advanced Technology Solutions segment, in which Nordson provides its services to electronics manufacturers, helped drive the quarter's results.\n- Shares of credit scoring firm Fair Isaac (FICO) closed 4% higher on Thursday, extending a recovery for the stock. Prior to the bounce, FICO shares had come under heavy pressure since Bill Pulte, director of the Federal Housing Finance Agency, critiqued the prices FICO charges for assessing the credit of potential mortgage borrowers.\n- Barclays boosted its price target on Estée Lauder (EL) stock, and shares of the cosmetics company advanced 3.6%. Analysts expressed confidence in CEO Stéphane de La Faverie, who took the helm of the makeup maker at the beginning of this year, highlighting his attentiveness to customer needs, but they stressed that the sustainability of Estée Lauder's premium valuation will likely depend on the company driving consistent sales growth in line with its peers.\nDecliners\n- HP (HPQ) shares suffered Thursday's steepest drop in the S&P 500, dropping 8.3% after the computer and printer manufacturer reported lower-than-expected profits for its fiscal second quarter. The company also trimmed its full-year outlook, citing tariff impacts. CEO Enrique Lores noted that HP has increased its prices as it seeks to offset cost pressure.\n- Electronic retailer Best Buy (BBY) also lowered its guidance to reflect expected tariff impacts, and its shares dropped 7.3%. The seller of flatscreen TVs and other tech gear obtains a significant amount of its products from China and Mexico, two countries that have been targeted by tariffs under the Trump administration. The reduced forecasts came alongside mixed results for Best Buy's fiscal first quarter, with adjusted earnings per share topping estimates but revenue falling short.\n- Shares of networking solutions provider Arista Networks (ANET) fell 6.9%. The losses came after Nvidia touted Google parent Alphabet (GOOGL) and Facebook parent Meta Platform (META) as new clients for Nvidia's own Ethernet network switches. Analysts noted that Meta has traditionally been one of Arista's largest customers, while Nvidia's capacity to bundle products make it a formidable competitor across different components of artificial intelligence data centers.\nS&P 500, Nasdaq on Track for Best Month Since Late 2023\nHeading into the last trading session in May, the benchmark S&P 500 index and the tech-heavy Nasdaq Composite are poised to post their biggest monthly gains since November 2023.\nThrough Thursday's close, the S&P 500 has risen 6.1% in May, while the Nasdaq is up 9.9%. In November 2023, the indexes gained 8.9% and 10.7%, respectively.\nThe Dow is up 3.8% so far this month, which would be its best monthly performance since a 4.7% increase in January.\nHP Levels to Watch as Stock Plunges After Outlook Cut\nHP (HPQ) shares tumbled Thursday after the PC maker missed analysts’ profit expectations and issued a light outlook, citing increased costs from tariffs.\nHP shares fell more than 8% Thursday, posting the biggest declines in the S&P 500. The stock has lost nearly a quarter of its value so far in 2025 as investors assess the cost of the company’s ongoing efforts to diversify its supply chain while it navigates the Trump administration’s unpredictable trade policies.\nSince bottoming out early last month, HP shares have staged a countertrend rally, forming a rising wedge pattern in the process.\nIn an ominous sign, the stock broke down below the pattern’s lower trendline on above-average volume in Wednesday’s trading session ahead of the company’s quarterly report, paving the way for a continuation move lower.\nIt’s also worth pointing out that the relative strength index has recently fallen below the 50 threshold, signaling weakening price momentum.\nInvestors should watch important support levels on HP's chart around $25, $23 and $21, while also monitoring a key overhead area near $29.\nRead the full technical analysis piece here.\nC3.ai Soars on Strong Results, Major Contract Renewal\nC3.ai (AI) shares soared 21% Thursday, a day after the AI software firm reported better-than-expected results, boosted by skyrocketing demand for generative AI products, and renewed a major contract.\nThe company posted a fiscal 2025 fourth-quarter adjusted loss of $0.16 per share on revenue that increased 26% to $108.7 million. Analysts surveyed by Visible Alpha expected an adjusted loss of $0.19 per share on revenue of $107.9 million.\nSubscription revenue rose 9% to $87.3 million, and engineering services revenue jumped 196% to $17.0 million. Together, they were 22% higher than a year ago and made up 96% of C3.ai's total revenue.\nThe company noted that revenue from its generative AI business more than doubled in the fiscal year.\nC3.ai also announced that it had renewed and expanded its strategic partnership with oilfield services provider Baker Hughes (BKR). The multi-year agreement \"focuses on deepening co-selling efforts, co-investment in AI solutions, and scaling deployments of joint solutions that are proven to improve production efficiency, reduce downtime, and increase operational visibility across assets in the world’s largest oil and gas companies.\"\nDespite today's gains, shares of C3.ai have lost about a fifth of their value so far in 2025.\nBoeing Rises as Aircraft Deliveries to China Set to Resume\nShares of Boeing (BA) jumped Thursday after CEO Kelly Ortberg said that aircraft deliveries to China will start again next month.\nAirlines in China \"have indicated they're going to take deliveries,” Ortberg said during remarks at the Bernstein Strategic Decisions Conference, according to a transcript made available by AlphaSense. “The first deliveries will be next month.” This comes after China earlier this month reportedly reversed a ruling barring its airlines from taking deliveries of Boeing planes.\nOrtberg said Boeing has been paying tariffs on parts imported from Italy and Japan to manufacture certain aircraft but that those costs can be recouped when the planes are re-exported.\nAs a major U.S. exporter, Boeing could be a long-term winner of U.S. trade negotiations with China if the current 90-day tariff reduction leads to a broader deal, airline industry analyst Visual Approach Analytics said earlier this month. The Trump administration wants its trade partners to buy more American-made goods, and China has a need for more airplane supply, making Boeing a strong candidate to help offset a trade imbalance in large chunks.\nOn that front, Ortberg said Boeing plans to increase production of its 737 Max jets to 42 per month in the near-term and 47 per month by the end of the year. That will require authorization from the Federal Aviation Administration, after the agency capped Boeing’s production at 38 Max jets per month in response to an incident in which a door plug detached from an airplane mid-flight.\nShares of Boeing, a Dow component, climbed more than 3% on Thursday. The stock is up 17% so far in 2025.\nWhy Salesforce is Sliding Today After an Earnings Beat\nSalesforce (CRM) shares sank on Thursday despite a first-quarter results that topped estimates, as analysts voiced concerns about macroeconomic headwinds and cautioned the company's AI offerings are still in the early stages of adoption.\nShares had climbed in extended trading Wednesday after the results were released, but were down nearly 4% to around $266 in recent trading. The company lifted its full-year outlook, but Oppenheimer analysts noted the increase in revenue projections is largely due to the benefit of currency exchange rates.\n\"Negatively, the growth guidance remains tepid to reflect a tough macro environment,\" the analysts wrote, while maintaining their \"outperform\" rating and $370 price target. Most analysts are bullish on Salesforce, with 17 \"buy\" ratings compared to five \"hold\" and one \"sell\" rating among brokers tracked by Visible Alpha, with an average price target of $358.\nDeutsche Bank analysts, with a \"buy\" rating and $400 price target, said management's comments around customer interest in Salesforce's AI-powered Agentforce offerings are a positive, while noting that \"management enthusiasm and customer feedback continue to outpace the financial contribution.\"\nCiti analysts said the results cleared a \"low bar,\" and that Salesforce's Agentforce remains a \"show-me story\" that is progressing, but has not yet convinced them that it's \"ready for prime-time.\"\nMorgan Stanley analysts said the \"the question of when will growth inflect higher\" due to Agentforce adoption remains, and that despite solid results, the company faces a \"building wall of worry\" from investors concerned about macroeconomic headwinds impacting Salesforce.\nSalesforce's Thursday move puts shares down more than 20% since the start of the year.\nBest Buy Tumbles Retailer Cuts Outlook Owing to Tariffs\nBest Buy (BBY) shares tumbled to lead S&P 500 decliners Thursday after the electronics retailer lowered its full-year outlook because of tariffs.\nThe retailer now sees fiscal 2026 revenue between $41.1 billion and $41.9 billion, below its prior guidance of $41.4 billion to $42.2 billion; comparable sales ranging from down 1% to up 1%, versus flat to up 2.0%; and adjusted earnings per share (EPS) of $6.15 to $6.30, down from $6.20 to $6.60. Despite the cuts, the midpoints of Best Buy's new projections all were in line with or above Visible Alpha consensus estimates.\n\"Today we are updating our full-year guidance to incorporate the impact of tariffs,\" Best Buy CFO Matt Bilunas said. \"Our underlying working assumptions are that tariffs stay at the current levels for the rest of the year, and there is no material change in consumer behavior from the trends we have seen in recent quarters.\"\nBest Buy gets a large portion of its products from China and Mexico, both of which have been hit by the tariffs imposed by President Donald Trump. China accounted for 55% and Mexico 20% of the company's sourcing in its fiscal 2025, according to its annual report.\nThe lowered full-year projections came as the retailer reported mixed first-quarter results, with adjusted EPS of $1.15 topping Visible Alpha estimates but revenue of $8.77 billion falling short. Comparable store sales fell 0.7% year-over year, far greater than the projected 0.2% decline.\nBest Buy shares were down more than 8% in mid-afternoon trading. The stock has lost nearly a quarter of its value since the start of the year.\nWhat Analysts Are Saying About Nvidia Earnings\nNvidia (NVDA) shares surged Thursday as the chipmaker’s quarterly results impressed Wall Street, even as export controls took a bite out of China sales.\nNvidia's record-high sales exceeded analysts' estimates compiled by Visible Alpha, though earnings did not, as the company said it absorbed a $4.5 billion charge in the period due to restrictions on the export of its H20 chips to China.\nHere’s what five analysts had to say about Nvidia's results:\n- Oppenheimer called Nvidia the “best house on the best block” and said it's the best-positioned company in AI. The firm reiterated its \"outperform\" rating and $175 price target.\n- Bank of America said server racks of Nvidia’s Blackwell AI chips are “in full production,” with \"every large hyperscaler\" client now ramping close to 1,000 racks every week. The bank raised its price target to $180 from $160.\n- Morningstar analysts said they were \"encouraged by Nvidia's revenue growth despite being blocked from selling H20 products.\" Blackwell supply and revenue “expanded faster than we anticipated and should support higher long-term AI revenue,\" they added, raising their target to $140 from $125.\n- UBS noted the H20 curb was largely offset by Nvidia’s gaming segment performing much better than expected, as the company’s Blackwell chips are “catalyzing an [AI PC] upgrade cycle.” UBS kept its \"buy\" rating and $175 price target.\n- Morgan Stanley analysts echoed the sentiment that Nvidia showed \"acceleration of the business other than the China headwinds,” adding, “everything should get better from here.\" Morgan Stanley. \"NVIDIA numbers show clear acceleration ex China.\" The analysts raised their target to $170 from $160.\nNvidia shares were up 3% at around $139 in mid-afternoon trading.\nNvidia Reclaims Title of World's Most Valuable Company\nNvidia stock soared on Thursday, returning the AI chip giant to the top of the list of the world’s most valuable companies.\nNvidia (NVDA) shares were up about 4% in recent trading, adding more than $100 billion to the company’s market value. Thursday’s gains put Nvidia’s market cap at about $3.44 trillion, edging out Microsoft’s (MSFT) $3.41 trillion value.\nThe shares were reacting on Thursday to a solid quarterly report on Wednesday afternoon. Nvidia reported record revenue in its fiscal first quarter as AI demand remained robust.\nNvidia, Microsoft, and Apple (AAPL) have been jostling to be the world’s most valuable company for nearly a year. The three are the only companies to have ever achieved a market value of more than $3 trillion. Nvidia reached that milestone almost exactly a year ago, while Apple first closed at $3 trillion in June 2023 and Microsoft reached $3 trillion in January 2024.\nAll three stocks have been hit to a certain degree by economic and trade uncertainty this year, but only Microsoft and Nvidia have shaken off the worst of it. Nvidia's and Microsoft's stocks are up about 5% and 9%, respectively, since the start of the year. Apple shares, meanwhile, are down about 20%, battered by President Donald Trump's aggressive tariffs on China, where the company assembles the majority of its products, and insistence that it move production to America.\nNvidia’s market cap, despite Thursday's jump, remains below its record of $3.66 trillion from earlier January when shares set their all-time high.\nHow Goldman Interprets Last Night's Ruling on Tariffs\nWednesday night’s court ruling that blocked some of the Trump administration’s tariffs may not change the endgame for the president’s trade policy, according to Goldman Sachs.\nA U.S. federal court struck down President Donald Trump's “reciprocal” tariffs and other import taxes, leaving sector-specific tariffs in place. The White House quickly appealed the decision, which ruled that the administration had overstepped its authority.\n“This ruling represents a setback for the administration's tariff plans and increases uncertainty but might not change the final outcome for most major U.S. trading partners,” Goldman Sachs analysts wrote late Wednesday.\nOther takeaways from Goldman’s note include:\n- The ruling doesn't affect tariffs on imported steel, aluminum and automobiles, or stop the administration from levying further sector-related tariffs. “If the White House finds it has less flexibility on country-focused tariffs, sectoral tariffs might receive more attention again,” wrote Goldman analysts.\n- There are multiple ways that Trump could enact similar tariffs to those that were struck down.\n- One way to potentially avoid court scrutiny moving forward is through \"Section 301 investigations.\" The U.S. Trade Representative conducts these investigations of trading partners. The analysts wrote that the investigations can take weeks or months to complete and would result in a longer timeline to implement tariffs.\n- The administration could also use authority under Section 330 of the Trade Act of 1930 to levy tariffs. Those tariffs, Goldman noted, would not require an investigation but are limited to 50%. That authority has never been used.\n- Still another form of authority could be used to set tariffs of up to 15% for up to 150 days. After that window, Congress would have to act to extend the tariffs.\nThe upshot of all this, Goldman suggests, is that even if the latest court issues aren’t resolved quickly, the administration has a range of other tools for enacting trade policy.\n“For now, we expect the Trump administration will find other ways to impose tariffs,” Goldman wrote.\nHP Posts Weaker-Than-Expected Profit, Cuts Outlook\nShares of HP Inc. (HPQ) tumbled Thursday, a day after the PC and printer manufacturer posted worse-than-anticipated profit and lowered its full-year outlook as it warned of the impact of tariffs.\nThe company reported fiscal second-quarter adjusted earnings per share of $0.71 on revenue that rose more than 3% year-over-year to $13.22 billion. Analysts surveyed by Visible Alpha expected $0.81 and $13.10 billion, respectively.\nPersonal Systems sales increased 7% to $9.0 billion. Printing sales slid 4% to $4.2 billion.\nCEO Enrique Lores said that the performance was \"impacted by a dynamic regulatory environment,\" although the company \"responded quickly to accelerate the expansion of our manufacturing footprint and further reduce our cost structure.\" According to a transcript provided by AlphaSense, Lores added during the earnings call that additional tariff costs \"could not be fully mitigated in the quarter,\" and that HP has \"implemented price increases to help offset cost pressure.\"\nCFO Karen Parkhill noted that because of \"increased macroeconomic uncertainty,\" the company adjusted its outlook \"to reflect moderated demand and the net impact of trade-related costs.\" HP now sees full-year adjusted EPS of $3.00 to $3.30, down from its earlier outlook of $3.45 to $3.75.3\nFollowing the report, JPMorgan cut its price target on the stock to $27 from $30.4\nHP shares were down 5% at around $26 in recent trading. The stock has lost about a fifth of its value so far in 2025.\nNvidia Levels to Watch as Stock Surges After Earnings\nNvidia (NVDA) shares jumped in early trading Thursda after the AI chipmaker surpassed Wall Street's quarterly revenue expectations amid booming AI-related demand.\nThe company announced after the closing bell yesterday that its fiscal first-quarter sales rose 69% from a year earlier to $44.06 billion, as major technology companies continue to ramp up spending on AI infrastructure. Profit was lower than analysts had estimated, as the company recorded a $4.5 billion charge in the quarter due to restrictions on the sale of its H20 chips to China, though the amount was less than the $5.5 billion the company said it anticipated last month.\nCEO Jensen Huang said global demand for Nvidia's AI infrastructure remains \"incredibly strong\", adding that he sees accelerating demand for AI computing with the use of AI agents becoming mainstream.\nNvidia shares slumped between January and early April amid concerns of a slowdown in AI spending and the Trump administration’s unpredictable trade policies. However, the stock has rebounded 60% from last month’s low as trade tensions eased and investor risk appetite returned.\nNvidia shares rallied sharply after breaking out from a pennant earlier this month, before consolidating again within a flag pattern above the closely watched 200-day moving average (MA). More recently, the stock has broken out above the flag pattern’s upper trendline, a move that has coincided with the 50-day moving average crossing above the 200-day MA to form a bullish golden cross.\nThe stock’s upside momentum looks set to continue, though investors should watch if trading volume confirms the move higher. During the lead-up to earnings, share turnover had declined, indicating investors remained on the sidelines ahead of the highly anticipated results.\nThe stock was up more than 5% at around $142 in recent trading. Nvidia shares haven't closed above $140 since Feb. 20.\nRead the full technical analysis piece here.\nMajor Stock Indexes Poised to Open Higher\nFutures are pointing to a higher open for major U.S. stock indexes, though the gains for futures have moderated substantially over the past few hours.\nFutures tied to the Dow Jones Industrial Average were recently up 0.3%.\nS&P 500 futures rose 0.9%.\nNasdaq 100 futures added 1.4%.",
  "source": "Investopedia",
  "published_at": null
}