{
  "title": "Nvidia insiders dump more than $1 billion in stock: report",
  "url": "https://www.foxbusiness.com/markets/nvidia-insiders-dump-more-than-1-billion-stock-report",
  "content": "Nvidia insiders dump more than $1 billion in stock: report\nNvidia insiders have sold shares as the company's stock has risen dramatically in recent years\nInsiders at tech giant Nvidia have offloaded more than $1 billion in shares in the last year amid the stock's rapid rise due to the artificial intelligence (AI) boom.\nThe Financial Times reported that over $500 million in stock sales have occurred in the last month as Nvidia shares reached record highs, bringing the total value of insider sales above $1 billion.\nNvidia's stock is up over 14% year to date and has risen about 27% over the past year, as the AI chipmaker has reaped the rewards of surging investment in AI models and tools.\nIn the past five years, Nvidia's stock price has been up over 1,543%. The company's market cap has risen above $3.8 trillion.\nNVIDIA CEO SELLS $15M WORTH OF STOCK AS PART OF PLANNED SALE\nNvidia CEO and co-founder Jensen Huang was among the company's leaders who have recently sold shares, disclosing the sale of 100,000 shares worth around $15 million in a regulatory filing last week.\nHuang's sales were part of a previously disclosed plan that was revealed in March and would allow him to sell up to 6 million shares of Nvidia's stock before the end of 2025.\nIf he were to sell all 6 million shares at current prices, Huang would earn over $900 million from the proceeds.\nNVIDIA SHARES RISE ON STRONG Q1 EARNINGS, DESPITE EXPORT CONTROL HEADWINDS\nTrading plans such as what Huang has used, known as a 105b5-1 plan, are used so that executives and investors with large stakes in a given company can disclose potential sales without surprising the market and causing the transactions to be viewed as a shock.\nOther Nvidia insiders have also sold shares, including board member Mark Stevens, who has sold $288 million in shares after disclosing a plan to sell up to 4 million shares.\nNvidia EVP of worldwide operations sold $25 million in shares, while two board members, Tench Coxe and Brooke Seawell, have sold $143 million and $43 million worth of stock this month, the FT reported.\nNVIDIA ANNOUNCES PLANS TO MAKE AI SUPERCOMPUTERS IN US FOR FIRST TIME\nThose transactions follow a rebound in Nvidia's stock following its rapid rise in recent years, which experienced a setback earlier this year when Chinese AI firm DeepSeek released a significant new model.\nNvidia has also dealt with headwinds related to export controls on its most advanced AI chips, which restrict sales to countries like China.\nThe company's AI focus and the increased demand for AI advancements have helped Nvidia sustain its momentum despite those setbacks.\nHuang said in a February interview on FOX Business Network's \"The Claman Countdown\" that adoption of AI is \"incredibly fast\" among what he described as the \"core technology builders, the model builders and the companies that are building consumer-oriented AIs.\"\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nEarlier this year, Nvidia announced plans to manufacture AI supercomputers in the U.S., with its advanced Blackwell chips to be made in Arizona and AI supercomputers at facilities in Texas.",
  "source": "Fox Business",
  "published_at": null
}