{
  "title": "These 15 Laptops are WIRED-Tested and Approved",
  "url": "https://www.wired.com/gallery/best-laptops/",
  "content": "The Best Laptops\nAll products featured on WIRED are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Learn more.\nFeatured in this article\nDeciding on the best laptop to buy can feel like a heavy task. It's not just that they're expensive devices. Your success in work, school, or even in gaming could depend on the hardware inside the laptop you choose. Most of us go years between making purchases of this magnitude, and there are countless makes, models, and chip configurations to choose from. But don't worry. I've been reviewing laptops for over a decade and have been testing a new one nearly every week. You can safely buy one of the devices below and know it was at least worth the money spent.\nIf you don’t know exactly what you need or what all the various hardware jargon means, read our How to Buy a Laptop guide. Check out our other computing guides, including the Best MacBooks, Best Cheap Laptops, Best 2-in-1 Laptops, Best Gaming Laptops, Best Linux Laptops, and Best Laptop Backpacks.\nUpdated July 2025: We've added the Lenovo Chromebook Plus 14, the Surface Pro 13-inch, and the Asus Chromebook CX15.\nHow Much Should You Spend on a Laptop?\nIf you're shopping for a laptop, you probably have an idea of how much you want to spend. But some context might help put things in perspective. The cheapest laptops cost around $200, but they can range up to $5,000. Meanwhile, the average amount people spend, according to the best data we have, is around $750. That lands decidedly in the midrange, spitting between the more expensive devices that are over $1,000 and the budget-tier machines you find below $700.\nWhen we talk about pricing, it's often the “starting” price of the laptop, meaning the lowest-priced configuration. This is really important to consider, as you want to compare devices apples-to-apples as much as possible. For example, a cheaper laptop might start at $750 with 256 GB of storage, while a more premium laptop might start at this same price but come with 512 GB or even 1 TB of storage. Increasingly, you can find some really decent laptops around this price, some of which we’ve listed below.\nIf your budget needs to be under $750, though, there are still good options. Laptops below this price tend to compromise in one area or another. Most commonly, it's the quality of the display and touchpad that suffers, as these are things you can't see from a spec sheet or reference photo. Chromebooks often give you the best bang for your buck, especially if you're trying to spend $500 or less.\nSo, why spend more? Well, there are two primary reasons. First, you might want a more premium design, perhaps one that has a more daring aesthetic or high-end components. Take the MacBook Pro, for example. It starts at $600 more than the MacBook Air but comes with a brighter Mini-LED display, significantly better speakers, and more ports. The second primary reason to spend more than $750 or so is to get more performance. Whether for gaming or for content creation, laptops with discrete GPUs are more expensive, which is why it's hard to find a worthwhile gaming laptop under $1,000. If you're buying a gaming laptop, plan to spend at least $1,500.\nWhat Are the Best Laptop Brands?\nUnlike the smartphone world, the biggest laptop brands have been around in the tech industry for over 40 years by now. Taking Apple out of the picture, there are four laptops brands that stand above the rest, following the latest trends and technology, while backing that up with reliable support and services.\nLenovo is the biggest PC brand in the world, at least in terms of global shipments. It's perhaps most well-known for its familiar sub-brands like ThinkPad and Yoga, but it also isn't afraid to take risks with more experimental designs and advanced technology. Lenovo has also made a name for itself in the gaming space too with its Legion laptops, known for balancing performance and features at the most competitive prices.\nAsus has quickly become a favorite, notable for its sheer number of laptops available in the consumer market. The company takes a similar approach to Lenovo, and that's led Asus to being able to quickly innovate on new technology and designs, while also launching premium clamshell laptops at more affordable prices than its competitors. Gaming laptops in particular are a space that Asus has come to dominate in, with the ROG Zephyrus, Strix, and TUF brands leading the way.\nDell and HP are a bit more conservative, though they aren't without their notable designs as well. Interestingly, the companies have both gone through a significant laptop rebrand in the past year. HP has introduced “Omnibook” as a replacement to the Spectre and Envy sub-brands in 2024, while Dell started 2025 by removing its well-known sub-brands entirely, including Inspiron and XPS.\nOther laptop makers in the mix include Microsoft Surface, Samsung, Acer, LG, and MSI, though none of them have as big a footprint globally as the top four.\nHow Do I Choose the Right Laptop?\nIf none of these laptops quite rings your bell, that's OK! There are far more laptops than we have time to test. To help you make smart choices, we put together a complete laptop buying guide. We also have the details about all the CPU and GPUs you need to know about for 2025. We recommend sticking to these guidelines:\nRAM: In most cases, make sure you get 16 GB of RAM. That's become the new standard, in even more affordable laptops. Upgrading to 32 GB is even better and means you never have to worry about running out of memory, especially if you're a gamer or video editor.\nCPU: In the world of Windows laptops, you have three CPU brands to choose from: Intel, AMD, or Qualcomm. Intel’s Core Ultra Series 2 launched in late 2024, providing a huge increase in battery life. It also has the best integrated graphics of the three. AMD chips are primarily reserved for gaming laptops, as they’ve struggled to take much ground from Intel. Qualcomm’s Snapdragon X chips, however, have challenged Intel in a serious way over the past year with its ARM-based chips, offering some of the best battery life we've ever seen on Windows machines.\nDiscrete graphics: Want to play AAA PC games or edit video on your laptop? You’ll likely want a standalone graphics processor, and at this point, Nvidia is the primary option. The RTX 5090 launched this year as the most powerful new GPU available, but the 40-series still remains a good option. Integrated graphics have improved significantly over the years though too, especially with Apple's M4 line.\nScreen: The display depends on the size of the laptop. A 1200-pixel resolution (HD+) screen on a 13- or 14-inch laptop looks sharp enough, but you’ll want more pixels on larger displays. While IPS screens will be good enough for most people, OLED or Mini-LED are becoming more common, which provide better color accuracy, contrast, and even decent HDR performance.\nConnectivity: Ports are important; though everyone needs something different. For most people, though, we suggest at least two USB-C ports and at least one USB-A and HDMI for those legacy devices. (Remember that nearly all laptops today use one of those USB-C ports for the power adapter.) Thankfully, most laptops still have headphone jacks, but always check, because a few daring machines have dropped it. Lastly, make sure there's Wi-Fi 6E support or newer. Even if you don't have a Wi-Fi 6E or Wi-Fi 7 router yet, it's a good bet you will in the future (see our Best Routers or Best Mesh Systems guides if you need a new one).\nBattery life: Battery life is extremely competitive these days, with Apple, Qualcomm, and Intel all making highly ambitious battery life claims. Most laptops with the latest chips (and without discrete graphics) will get you over 10 hours of battery life, or many more if your workload is lighter.\nHow We Test Laptops\nI have been reviewing laptops for a decade, and WIRED contributor Chris Null has been testing these machines for 25 years. We test each laptop we review in a variety of situations, including both synthetic benchmark tests, real-world use cases, and comparisons against similar equipment. We don’t consider hardware in a vacuum: Our reviews aim to match laptops with the users that will benefit from them the most, taking performance, usability, portability, and price all into account.\nWe put every laptop through a gauntlet of tests before writing a review and assigning them a rating.\nHands-on use: Here's we evaluate the exterior of the device. We compare how thin and light it is against other laptops. We repeatedly open and close the lid to test the quality and ease-of-use of the hinge. We push on weak points like the keyboard and lid to test build quality. We furiously type on the keyboard and swipe around on the touchpad to ensure it's comfortable and precise. These are all things you can't see just by looking at a device's landing page on Amazon. We use the laptop itself for many days (and sometimes weeks) to report on any quirks that might pop up, such as oddly placed ports, a surfeit of preloaded shovelware, or unexpected problems that make using the laptop difficult.\nSights and sounds: Once we boot up a device itself, it's all about the sights and sounds of the laptop. The screen is paramount, as its the world through which you experience the entirety of the device. There's a lot you can tell about the brightness, colors, and contrast of a display just by looking at it. Beyond just subjective testing, we also use a Spyder colorimeter to measure the brightness, contrast, color space, and color accuracy of a display. If it's an HDR-capable screen, we also test the peak brightness of the display in HDR content. We also test the webcam and speakers of a laptop to see if they are worthy of your video calls and music streaming sessions.\nPerformance testing: Finally, we test performance. There's a lot of ways to go about this, but we always evaluate a laptop's performance based on what it's intended for. We don't expect a $500 budget laptop to performance like a powerhouse gaming laptop, nor we expect a gaming laptop to get 18 hours of battery life. Our testbed includes more than 20 synthetic benchmarks, though this is constantly evolving and is dependent on the unit’s CPU and operating system, as macOS and Snapdragon-based laptops have fewer benchmarks available. Those benchmarks include various tests within the latest versions of Geekbench, PCMark, 3DMark, Procyon, GFXBench, Pugetbench, Superposition, Cinebench, and various gaming-related tests such as 3DMark and Cyberpunk 2077. Note that WIRED does not, in general, report raw benchmark scores. We don't only pay attention to the scores these benchmarks produce, but also the volume and speed of the fans, the surface temperature of the laptop, and the affect it has on battery life.\nIt's a lot, I know. But we're thorough because we want to stand by our recommendations, and ensure that the laptops we rate highly are worth the money.\nOther Good Laptops We’ve Tested\nDell 14 Plus for $700: This is the first laptop in Dell's major rebranding effort, and this one is a follow-up to the Dell Inspiron Plus 14. The Dell 14 Plus (6/10, WIRED Review) is a solidly midrange laptop, meaning it sports a clean but generic design and solid performance, without some of the bells and whistles that make laptops feel premium. The IPS screen is decent, as is the performance and battery life. The only real problem is that all available configurations come with 1 TB of storage, which is why there are no starting configurations under $1,000. Despite being new, however, I've already seen it drop in price significantly, as low as $700, which makes it an incredible value.\nMicrosoft Surface Pro 12 for $730: While it’s a tablet, the Surface Pro 12 (6/10, WIRED Review) is designed to be a true laptop replacement as well, which is why it's on this list. Its $779 price would be excellent for a fanless machine running on the Snapdragon X chip, but it doesn't come bundled with a keyboard. Once you add that in, this becomes more of a premium laptop. Still, for the right person, it's a killer travel device for taking your work on the road with you.\nAsus ROG Flow Z13 for $2,100: It's too expensive for most people to take a chance on, but I found a lot to like about the ROG Flow Z13 (7/10, WIRED Recommends). This gaming 2-in-1, a design no one asked for, works surprisingly well. The performance isn't full throttle, but the Z13's use of surprisingly powerful AMD integrated graphics makes it far more powerful than you might assume, all while keeping the heat away from your hands.\nLenovo Yoga Slim 7i Aura Edition (Copilot+ PC) for $1,300: The first Intel-based Copilot+ PC (7/10, WIRED Review) we tested is a winner on all fronts, boasting outstanding AI and graphics performance and some of the best battery life we’ve ever seen on Intel hardware. With its slightly oddball 15.3-inch screen, it hits its high points without breaking the bank, though the fan is loud and the system may weigh you down more than you’d like.\nAsus Zenbook A14 for $600: This is one of the lightest laptops we've ever tested, thanks to Asus' Ceraluminum material. The Zenbook A14 (8/10, WIRED Recommends) is also the first A-series laptop from the company, and it employs Qualcomm's new Snapdragon X chipset, which is the weakest and supposedly the most affordable of the Snapdragon X series. While this laptop excels in build quality, portability, and sports excellent battery life, the chipset is lackluster, only suitable for average web browsing tasks. Try to avoid the $1,000 MSRP.\nMicrosoft Surface Laptop (7th Edition, 2024) for $1,150: Want a Windows laptop straight from the horse's mouth? Buy the 7th Edition Surface Laptop (7/10, WIRED Review). Performance is solid, as is battery life, and you get a smooth 120-Hz display. It's just way too pricey for what you get, so try and catch it on sale. Read our Best Surface Laptops guide for more.\nLenovo Flex 5i Chromebook Plus for $500: This was one of the first “Chromebook Plus” devices we tested, and it's still among the best. While the newer Lenovo Chromebook Plus 14 is a higher-quality device, the Lenovo Flex 5i Chromebook Plus (8/10, WIRED Recommends) comes in a couple hundred dollars cheaper, which makes it attractive, especially for a Chromebook. You'll still get 8 GB of RAM and 128 GB of storage, too.\nAsus Vivobook S 14 OLED for $760: Not unlike the Zenbook 14 OLED, this 14-inch machine sports an OLED panel for a reasonable sub-$1,000 price. The Vivobook S 14 (8/10, WIRED Recommends) is powered by an Intel Core Ultra 9 Series 1 chipset with 16 GB of RAM and a 1-TB SSD. It can handle most daily tasks with no problem, though the screen could stand to get brighter. Battery life is OK, hitting up to 12 hours with average use. Unfortunately, the machine is a fingerprint magnet, so you'll constantly be wiping it down. It has plenty of ports.\nDell XPS 16 for $1,900: Dell's XPS laptop of 2024 (7/10, WIRED Recommends) is aimed at Windows users with MacBook jealousy. The design, specs, and sizes line up perfectly with Apple's offerings. The XPS 16 has a gorgeous, sleek design, a wonderfully bright and sharp OLED screen (with a 120-Hz screen refresh rate), and is plenty speedy for everyday tasks. The XPS 16 uses the more powerful RTX 4070 graphics card and fared well in our tests, but it costs more than a similarly powerful MacBook. It has since been replaced by the Dell 14 Premium and Dell 16 Premium, though we're still testing these models.\nAcer Chromebook Plus 515 for $359: This is a 15-inch Chromebook Plus model (8/10, WIRED Recommends) with the same internal components as the Lenovo we recommend above. The battery life for this one is a solid 8.5 hours of full-screen video playback time. The Acer offers an HDMI 1.4 output jack in place of the Lenovo's microSD card slot, making this one a better choice if you frequently need to give presentations or otherwise use the HDMI port. There's also the smaller Chromebook Plus 514 ($380) that's equally great.\nSamsung Galaxy Book4 Ultra for $2,500: There's much to love here (7/10, WIRED Review), but that price. Ouch. You get what you pay for, at least, with the new Intel Core Ultra 9 185H processor, the current top-of-the-line processor in Intel’s Core Ultra CPU lineup, along with an Nvidia GeForce RTX 4070 graphics card. The 16-inch AMOLED 2880 x 1800 pixels touchscreen is magnificent to work on, and performance blew everything else we've tested out of the water. But that price.\nLenovo Yoga Slim 7x Copilot+ PC for $800: Lenovo's svelte Slim 7x (7/10, WIRED Review) isn't exciting, but it offers the best price-to-performance ratio of the many Copilot+ PCs we've tested. Battery life and performance are standouts, though the fan does tend to run loud.\nLaptops to Avoid\nAmazon is filled with laptops you shouldn't buy. Just type in “best laptop” into the Amazon search box, and you'll find plenty of cheap laptops that no one should buy. That includes most of the Windows laptops under $500, which all use CPUs from three or four generations ago.\nIt gets worse when you search for “gaming laptops” on Amazon, which presents some cheap laptops that don't even have discrete graphics. Regardless of what companies or retailers try to say, you shouldn't expect a laptop without a discrete GPU to be able to play modern games. Some of these include laptops from knockoff brands you've never heard of, like this one. There's just no reason to buy something from an unknown brand.\nWhen it comes to gaming laptops in general, I wouldn't recommend buying anything RTX 30-series or older in terms of graphics. You should still be able to find some decent RTX 40-series laptops that are a better bang-for-your-buck than the new RTX 50-series laptops.\nLastly, there's the topic of refurbished laptops. Online retailers are full of older laptops that are marked as refurbished or “renewed.” These can be good options, especially if they come heavily discounted, such as this M1 MacBook Air. But there's always some risk with buying refurbished. Make sure you read the retailer's return policy. With models that are only a year or two older, however, pay careful attention to the specs, especially when it comes to RAM capacity. For example, some older M3 MacBook Air models will show up with only 8 GB of RAM, not reflecting the increased base memory in the price.\nPower up with unlimited access to WIRED. Get best-in-class reporting and exclusive subscriber content that's too important to ignore. Subscribe Today.",
  "source": "WIRED",
  "published_at": null
}