{
  "title": "The Shift East: How China’s EV Boom Powers Its Tech Rise",
  "url": "https://time.com/7288660/shift-east-china-electric-vehicles-economy-technology-trump-tariffs-ai/",
  "content": "At NIO’s design workshop in suburban Shanghai, engineers spread billets of clay onto an aluminum frame of a basic car. A robotic arm with a mechanized drill bit then carves a series of grooves into the clay corresponding to a designer’s sketch. The rough surface is then painstakingly smoothed with palette knives before aluminum foil is pasted on top. Finally, the sleek-looking metallic model is rolled into a sunlit courtyard where every curve and camber is scrutinized.\n“The artistry really happens with these guys putting color on, taking it off; putting more clay on, taking it off,” says Colin Phipps, senior director of NIO Shanghai Design, who previously worked 12 years for Cadillac. “This is a very labor-intensive process.”\nIt’s also an incongruously artisanal first step of a design methodology that is otherwise steeped in pushing technological boundaries. Since its founding in 2014, NIO has notched 9,800 global patents, most impressively popularizing battery-swapping technology that allows customers to change their drained battery for a fully charged one in just three minutes at over 3,000 swap stations across China and Europe.\nNIO also produces the world’s longest-range electric-vehicle (EV) battery, capable of over 650 miles (1,000 km) on a single charge (Tesla’s record is 402 miles). It has the world’s only dual-display windshield—projecting data at two separate perspectives directly in the driver’s line of sight—and the first homologated drive-by-wire system, which guides the wheels without a physical steering shaft. NIO’s EP9 sports car was upon launch in 2016 the world’s fastest EV, breaching 194 m.p.h. and breaking records at Germany’s famous Nürburgring Nordschleife racing circuit. “Innovation creates value,” NIO CEO William Li tells TIME. “And innovation helps us survive amid fierce competition, be it in China or worldwide.”\nNIO is just one of an alphabet soup of Chinese brands—from AION, BYD, and Clever, to Maxus, Neta, and Onvo, to Xpeng, Yangwang, and Zeekr—dominating the global EV market today.\nIt’s been a meteoric rise. In 2001, China had fewer than 10 million passenger vehicles for its 1.2 billion population. That’s just one vehicle for every 128 people, or a market penetration equivalent to America’s in 1911, three years after Henry Ford produced his first Model T. But by 2009, China was the largest car market in the world. From being a net car importer as recently as 2020, China today sends more vehicles overseas than any other nation; its passenger-car exports jumped nearly 20% in 2024 to 4.9 million. Meanwhile, imports of cars to China dropped from a peak of 1.24 million in 2017 to just 705,000 last year.\nChinese automakers are expected to account for a third of the global market by 2030, according to AlixPartners. When it comes to EVs, China already accounts for nearly two-thirds of global sales (62%). NIOs are currently sold in six European nations as well as Israel and the UAE. BYD, meanwhile, is now undisputedly the world’s top EV firm, present in over 70 countries and outselling Tesla globally for a second straight quarter. While Tesla delivered 336,681 vehicles worldwide for the January–March period, down 13% year-on-year, BYD delivered 416,388, up 38%.\nAmericans remain largely unaware of all this. Under President Biden, a tariff of 100% was slapped on Chinese EVs, and President Trump has added an additional 25% on all foreign cars. This has negative consequences for EV adoption in the self-styled spiritual home of the automobile—where half of Americans are interested in going electric, according to recent polls. It also impacts the global fight against climate change.\n“Consumers in the U.S. could drive better cars, consume less gasoline, spend less on maintenance, and that would also be good for climate change,” says Paul Gong, head of China autos research at UBS Investment Bank. “There is a certain pity that because of tariff protectionism, and geopolitics, the world is not as green and not as prosperous.”\nStill, some very real concerns lie behind import barriers. The U.S. and allies accuse China’s industrial policies of massive subsidies that cause overcapacity and crowd out competitors. Chinese government support to its EV industry cumulatively totaled $230.9 billion from 2009 to 2023, according to the Center for Strategic and International Studies (CSIS), a bipartisan D.C. think tank. Last July, the E.U. also imposed a provisional antisubsidy tariff of up to 37.6% on Chinese EVs, prompting Beijing to hike tariffs on European pork and brandy in retaliation. In August, Canada hiked its import tariff on Chinese EVs to 100%.\nHowever, to simply blame state subsidies for China’s mastery of EVs is reductive. Time and again, whether it’s smartphones, solar panels, or 5G, China is combining state support with economies of scale and a fiercely competitive domestic market to command transformative technology. Strong supply chains leverage high-quality, low-cost components to commercialize technology for market. And China’s ascendency in EVs provides a window into future tussles between the world’s top two economies over innovations set to power the Fourth Industrial Revolution.\nThe risk for the U.S. is that these advantages will soon also allow China to dominate industries such as generative AI, quantum computing, and humanoid robotics. And EVs are front and center to those goals.\n“These are much more than just battery-powered vehicles,” says Ilaria Mazzocco, a senior fellow focused on China business and economics at CSIS. “The technological shift involves a lot of data processing, more AI integrated into the system, and synergies that provide pathways to advance in other technologies.”\nChina’s rise didn’t initially make the West uncomfortable. Far from it. China’s peerless manufacturing efficiency reaped billions of dollars for U.S. firms. The fact that an ostensibly communist nation was trying its hand at capitalism was thought endearing, even quaint—not to mention proof that liberal economic theory had won the day. The country, after all, represented a giant and growing market for American industry.\nUntil China began to pull ahead. Though it welcomed McDonald’s and Starbucks and encouraged its brightest to hone their minds at Western universities, Beijing maintained a strict hold over the economy, while cannily acquiring foreign expertise. Today China accounts for 27.5% of all global auto sales, more than the next three countries—the U.S., India, and Japan—combined.\nChina’s government facilitated this rise by allowing foreign auto firms to enter the Chinese market only with a domestic partner, as well as what might be called resourceful harvesting of intellectual property. It was good old-fashioned protectionism—and for China, it worked. Chinese companies are poaching engineers and executives from storied European and American manufacturers while buying up foreign competitors wholesale. Ford sold Swedish firm Volvo to China’s Geely for $1.8 billion in 2010. In 2017, Geely also bought storied British sports-car firm Lotus.\n“Ten or 15 years ago, products in China weren’t competitive globally, to put it mildly,” says Dan Balmer, Lotus president and CEO for Europe, Asia-Pacific, Middle East, and Africa. “But you could see the energy, the enthusiasm, the investment into the industry. So they’ve learned very well, and they’re now leading in many fields.” Lotus now retains a design and production facility in the U.K., but all its Eletre and Emeya EVs are made in Wuhan, best known as the epicenter of COVID-19, where a $1.1 billion plant opened in 2022 can turn out 150,000 vehicles a year.\n“Before, people were coming to China just to have better access to the Chinese market,” says Frank Bournois, dean of the China Europe International Business School in Shanghai. “Now you come to China to improve your processes. And AI is really pushing that forward.”\nU.S. policymakers have a hard time squaring this new paradigm, as evidenced by Vice President J.D. Vance’s complaints to Fox News in early April that “we borrow money from Chinese peasants to buy the things those Chinese peasants manufacture.” But whereas the first generation of Chinese entrepreneurs grew up poor and were happy to wring a livelihood from cheap imitations, today’s tech graduates were spared the privations of their parents and yearn for something more meaningful. “Before, Chinese were happy to copy others just so they wouldn’t go hungry,” says Grace Shao, a former Alibaba manager turned IT consultant who publishes the AI Proem newsletter. “Now they seek a sense of mission.”\nWhile Washington attributes China’s recent successes to subsidies, that is only part of the story. When the Beijing central government pinpoints an industry to prioritize, city and provincial governments immediately offer incentives in the desperate race to seed a local champion. This flood of liquidity generates a bubble that artificially inflates values and encourages other big players to enter the market. But in 2020, the leading government-supported EV maker in China was Tesla, whose consumers received $325 million in tax rebates as well as $82 million in grants to construct its Shanghai Gigafactory. Meanwhile, at its peak in January 2021, NIO’s market cap was $96.57 billion, or double that of General Motors.\nCompetition between regions and manufacturers, however, is remorseless. In 2023, some 52,000 EV-related companies shut down in China. As the EV bubble burst, NIO’s worth has plunged to just $7.53 billion, despite shipping a record 221,970 cars last year. But those firms that emerged unscathed are lean and technologically agile, and infused with the necessary moxie to thrive. BYD, for one, employs more engineers than Tesla has total staff. In March, it unveiled an EV battery that can charge in just five minutes. “You cannot imagine such competition intensity in any other major market,” says Gong.\nNIO’s factory in Anhui province is a case in point. It has an annual capacity of 300,000 units and can deliver entirely bespoke cars of 3.5 million specification combinations within 10 days. Ford may have pioneered the assembly line, but NIO has an assembly matrix six floors high and five wide, where individual chassis can be plucked in any direction. Once they’re grounded, AI-powered automated guided vehicles ferry each shell among 940 welding and riveting robots. Most impressively, ground was broken at the factory in April 2021 and mass production started just 17 months later—a timeline virtually unheard of in the U.S.\nCrucially, traditional auto manufacturers and China’s new energy companies approach the production process in reverse. Instead of focusing on the panels, axles, and bearings of a car, NIO first looks at the high-voltage architecture—batteries, power train, and so on—followed by the low-voltage, like digital compute. “Then we bolt the mechanical pieces around it,” says Jonathan Rayner, NIO’s vehicle-experience manager for its ET9, who joined the firm after 14 years at Jaguar Land Rover. “With today’s modern software and capabilities, what used to be the hard thing for the old companies is relatively easy.”\nPutting software at the beating heart of production means modern EVs are unlike their gasoline-powered forebears. Even if you purchased a NIO, BYD, or Lotus a few years ago, the car’s brain is being regularly updated, much like your smartphone. This also means that the constantly honed AI-powered core technologies can be applied to many adjacent fields. “AI is a very important enabler for our vehicle products,” says Li, NIO’s CEO. “These technologies help us improve the product experience and overall competitiveness.”\nWaiting outside an office building in Shanghai’s Pudong district, a white robotaxi produced by Pony.AI, a Guangzhou-based autonomous-vehicle firm, circles slowly around the entrance foyer before coming to a stop at my feet. Once I’m aboard, the self-driving system embarks on a 20-minute tour of the rain-soaked neighborhood, dodging delivery bikes, overtaking parked vans, and bravely fighting through oncoming traffic at stoplights. “Strategically, we definitely have the ambition to go global,” says James Peng, CEO of Pony.AI. “Because mobility needs are everywhere. Using technology to have a positive societal impact should be our ambition.”\nOf course, the U.S. also has robotaxis. Alphabet-owned Waymo completed 4 million paid driverless ride-hailing trips in 2024 in Phoenix, San Francisco, and Los Angeles. But competition is scant. Amazon-backed Zoox secured the necessary permits to carry the public in Foster City, Calif., only last year. Tesla has claimed since 2016 to be about a year away from launching a robotaxi; CEO Elon Musk most recently said his Cybercab would be ready by 2027.\nMore notable are the players that have exited the space. Uber sold off its self-driving business in 2020 after a fatal collision. Ford abandoned its stake in its robotaxi developer Argo.AI two years later. In 2023, GM paused all its Cruise driverless operations, despite already plowing in $10 -billion, following collisions that led to the suspension of California licenses. (While a recent spate of self-driving crashes in China hasn’t diminished official support, the government on April 17 did ban the word autonomous from car ads.) By comparison, Pony.AI faces a crowded field. China also has Apollo Go, DiDi, AutoX, and WeRide—the latter already operates in 30 cities across nine countries—all clamoring for market share with express government backing. As of August 2024, Chinese public-security authorities had issued 16,000 test licenses for autonomous vehicles and 20,000 miles of roads nationwide had been opened for testing.\nFor Peng, the difference is that while licenses in China are harder to obtain at the outset, once permission is granted, the government will be fully supportive. “In the U.S., it’s easy to get a license,” he says. “But if you’re ever in an accident and it’s your fault, they will heavily penalize you.”\nRather than fostering its own domestic champions, the U.S. national strategy aims to slow down its key rival via stricter export controls. However, China is catching up. In semiconductors—a crucial industry in which the U.S. currently leads—Huawei’s Ascend 910C AI chip reportedly achieves up to 60% of performance in inference tasks compared with Nvidia’s latest H100. Whereas NIO’s earlier models contained four Nvidia chips, its latest ET9 instead has two designed in-house. “It’s precisely the shortage of semiconductors that is leading China to develop their own faster,” says Bournois.\nThe rush is also on to translate EV supremacy to other industries. Humanoid robots produced by Hangzhou-based Unitree caused a stir in households across China when they appeared, twirling decorative fans and dancing with other performers, at state broadcaster CCTV’s prestigious Lunar New Year Gala in January.\nIt was a stunning display of China’s booming robotics industry. Over 190,000 robotics-related companies were registered in China last year, with 44,000 more registered since the start of 2025, according to data company Qichacha. As with EVs and AI, Beijing has prioritized humanoid robots as “disruptive products.” In 2023, China’s Ministry of Industry and Information Technology (MIIT) issued industrial-development guidance that outlined its goal of mass-producing humanoid robots by 2025 to build a globally competitive industrial ecosystem expected to reach $43 billion by 2035.\nEVs are key. Roughly 70% of their components are interchangeable, which is why Chinese automakers including BYD, Xiaomi, Chery, GAC Motor, Huawei, SAIC, and Xpeng Motors are all entering the robotics market. At March’s National People’s Congress, China’s annual rubber-stamp parliament, XPeng chairman He Xiaopeng proposed supportive policies for humanoid robots to mirror those EVs enjoyed, arguing the industry has similar growth potential over the next five to 20 years.\nChina is also gaining ground in the so-called low-altitude economy—autonomous air taxis, drone delivery, and so on. Last March, China’s MIIT and civil-aviation and transport regulators released a six-year plan for the sector, exploring regulations for aerial tolls, pilot licenses, and establishing trial areas where early-stage eVTOL (electric vertical takeoff and landing vehicles) can fly around actual city environments. The 2025 NPC’s Government Work Report named the future industry among the state’s priorities. Once again, China’s EV industry provides the backbone. Early eVTOL pioneers include Ehang, Autoflight, XPeng, and AeroFugia, a subsidiary of Geely. “We have the basic infrastructure already ready for the low-altitude industry,” says Burt Gao, Aerofugia’s CEO and chief scientist. “Also, our supply chain is the same as for EVs.”\nIt is not all positive for China, of course. The nation faces myriad economic challenges, including deflation, local governments drowning in debt, poor consumer spending, plummeting real estate values, record youth unemployment, and a demographic time bomb. China’s regulatory framework and especially its draconian rules regarding data transfers are anathema to foreign partners. In September, the European Chamber of Commerce in China released a position paper that made over 1,000 recommendations for how to improve the business environment. Then there’s the as-yet-unknown effect of a trade war with the U.S., where China last year sent 14.7% of exports, worth $438.9 billion.\nBut as America walls itself off, China also has a golden opportunity to reset trade relations with the rest of the world. In mid-April, after Trump’s global tariff onslaught, President Xi Jinping embarked on a charm offensive in Southeast Asia, declaring that a trade war has “no winners” and that protectionism “leads nowhere.” Just as export controls have spurred domestic innovation, a U.S.-waged trade war only puts Chinese firms in a more favorable light. “The bar is low in terms of looking like a more reliable and constructive partner than the United States these days,” says Mazzocco of CSIS.\nWe have been here before. The U.K. became the world’s biggest economic superpower in the 18th and 19th centuries through its first-mover advantage in industrialization. But the U.S. adopted these technologies and, via its larger market and manufacturing capabilities, soon became the global leader in both innovations and their commercialization. The question is whether the U.S. can survive a trade war that threatens to drastically diminish its markets, while simultaneously undermining the development of core technologies by defunding universities and research institutions. China already produces twice as many highly cited AI-research publications as the U.S. According to a recent report from the D.C.-based Information Technology and Industry Foundation, China is near the lead of innovation or better in 6 out of 10 industries of the future. If EVs are any augury, America’s days at technology’s vanguard might be numbered.\n“We believe the Chinese market has the best talent,” says Li. “Every year there are several million new science and technology graduates.” And they, like their government, are determined to seize the day.",
  "source": "Time Magazine",
  "published_at": null
}