{
  "title": "EV Market Forecast: Top Trends for EVs in 2025",
  "url": "https://investingnews.com/electric-vehicle-forecast/",
  "content": "EV Market Forecast: Top Trends for EVs in 2025\nElectric vehicles are a key part of the green transition, but the industry is new and still facing bumps in the road when it comes to adoption. Find out what trends moved the market in 2024 and what's ahead in 2025.\nElectric vehicles (EVs) are an essential part of the transition to a cleaner, greener economy.\nEVs are also a key driver of demand for battery metals, such as lithium, cobalt, graphite, nickel and copper. Investors interested in these metals are keeping a close eye on the growth outlook for the global EV market.\nSo what are the key EV sector trends to follow? Here the Investing News Network (INN) takes a look at what moved the market in 2024, as well as what’s on the horizon for the EV sector in 2025.\nHow did the EV market perform in 2024?\nGlobal EV sales hit 13.3 million units in the first 10 months of 2024, according to EV market research firm Rho Motion, up 24 percent year-on-year. However, this rise didn't play out equally across the three major regional markets.\nChina continues to lead global EV sales\nOnce again China led the way, amassing nearly two-thirds of total global sales during the period.\nPurchases of EVs in this region were up 38 percent in the first 10 months of the year to 8.4 million units. That's compared to 9 percent growth in the US and Canada, and a 3 percent decline in Europe.\nChina’s dominance in the global EV market is beginning to bleed into other markets.\nEarlier this year, China’s BYD (OTC Pink:BYDDF,HKEX:1211), the world’s largest EV manufacturer, launched an affordable EV model priced below US$10,000. With North American and European EV manufacturers already struggling to gain market share in their own domestic spheres, these cheaper Chinese EV models pose a significant problem.\nIn response to this threat, the Biden administration increased tariffs on Chinese EVs to 100 percent in 2024, and disqualified imported EVs from a US$7,500 federal tax credit. The European Union also imposed its own tariffs on Chinese EVs, ranging from 17.4 percent for BYD to 38.1 percent for SAIC Motor Company (SHA:600104).\nGlobal EV sales, 2017 to 2024.\nChart via BloombergNEF, MarkLines and Jato Dynamics.\nUS EV industry facing challenges\nAs the top seller of EVs in the US, Tesla’s (NASDAQ:TSLA) performance has an outsized impact on the region’s EV industry. Lagging sales of Tesla models in 2024 have dragged down the overall performance of the North American EV market.\nAccording to data released by the Electric Vehicle Council in early December, the Elon Musk-led company's total sales for 2024 are down by 20.88 percent compared to the previous year.\nAnother red flag for the US EV industry is Ford’s (NYSE:F) decision in June to suspend the release of new battery electric vehicle (BEV) models — the company said at the time that there wasn't a strong enough business case for such an investment. The news came despite the fact that the auto giant was the second best-selling EV brand in the country in the first half of 2024, before it was overtaken by rival General Motors (NYSE:GM). In November, Ford announced it would pause production of its F-150 Lighting truck for the remainder of the year.\nMeanwhile, General Motors has cut its planned 2024 EV production range to 200,000 to 250,000 units, a decrease of 50,000 units. The US auto manufacturer is also delaying the launch of the first Buick EV model.\nDespite these challenges, the US EV market landscape has several bright spots.\nThird quarter EV sales grew by 11 percent year-on-year, according to Cox Automotive. Even Tesla's sales returned to growth, rising 6.6 percent, while General Motors posted a 60 percent sales gain for the same period.\n“The growth is being fueled in part by incentives and discounts; but as more affordable EVs enter the market and infrastructure improves, we can expect even greater adoption in the coming years,” said Stephanie Valdez Streaty, director of industry insights at Cox Automotive.\nEuropean EV market sluggish\nThe European market also struggled in 2024, especially in Germany, the largest producer of EVs in this region. The German government cut subsidies for EVs at the end of 2023, which has disincentivized buyers in 2024.\nThe German EV industry is the second largest in the world after China. A significant drop in demand in Germany has understandably had a dramatic impact on European EV production.\nIn October, Volkswagen (OTC Pink:VLKAF,FWB:VOW), the region’s largest automaker, announced its intention to close three German plants to cut costs as it tries to stave off competition from cheaper Chinese EVs.\nBattery car registrations declined after incentives were removed last year.\nChart via Bloomberg and the European Automobile Manufacturers' Association.\nEurope’s auto makers are facing growing challenges ahead of the approaching 2035 ban on the production of any new internal combustion engine vehicles. New EV registrations fell in the second half of the year, including in France and Italy, while the UK has seen some positive gains, as per Bloomberg.\nWhat's slowing down EV demand?\nOne of the biggest challenges currently facing the EV industry is the problem of appealing to mainstream consumers, many of whom are dealing with high interest rates amid a cost-of-living crisis.\nDepending on the geographic location and the vehicle type, BEVs are 10 percent to 75 percent more expensive than conventional internal combustion engine vehicles. This is making for less-than-appealing pitches on the sales floor.\nThrow in the higher cost for tires, one-off repairs and the possibility of having to replace an exorbitantly priced battery, and it becomes clear why the hesitancy is palpable. Range anxiety, especially in colder climates, long charging times and a lack of reliable charging infrastructure are also significant barriers to EV adoption. But nothing trumps cost.\nPwC recently polled over 17,000 consumers across 27 countries, and found that even in places like the Netherlands, which has advanced charging infrastructure, high costs are still deterring would-be buyers from going electric.\nOverall, PwC found that 75 percent of respondents in Europe, the Middle East and Africa cited the cost of EV ownership as the biggest factor swaying their decision to purchase. On top of that, one-third of EV owners surveyed said they would consider going back to gas-powered vehicles to avoid high maintenance costs and limited range.\nSubsidies and tax breaks have helped to ease the price burden, but pullbacks on these rebates have hit the market hard in some European countries where high interest rates and costs continue to put EV purchases out of reach.\nAnother factor stunting sales in the European Union, reported Euronews, has been higher tariffs imposed on low-cost Chinese EVs to limit their ability to displace domestic automakers from the market.\nDespite the slowdown in adoption, 2024 is still expected to be another record year for the global EV industry.\nThat was the main takeaway from a presentation at the BloombergNEF Summit in November. Aleksandra O’Donovan, the research organization’s head of EVs, said the firm is forecasting that EV sales worldwide will reach 16.7 million units in 2024, up from 13.9 million the previous year, representing 20 percent of total global vehicle sales this year.\nHybrid EVs gaining market share\nOne of 2024's important EV market trends that is likely to carry on into 2025 is the popularity of hybrid models over wholly electric vehicles. This trend is very much in line with the affordability and range anxiety factors influencing sales.\nTo meet customers where they are at right now, auto makers are switching gears to bring more hybrid models to market, including plug-in hybrid electric vehicles (PHEVs).\n“Companies are turning to hybrid models to appeal to a more practical and frugal shopper, as wealthy early EV adopters who fueled years of growth have recently fled the market,” notes Business Insider.\nIn this environment, hybrid-focused auto makers such as Toyota (NYSE:TM,TSE:7203) and Ford are expected to outperform. General Motors is also planning to launch more hybrid EV models in 2027.\nEven in China, the world’s top EV market, plug-in hybrids are driving a large part of EV sales growth. BloombergNEF states that while BEV sales in China were up 18 percent in the first 10 months of the year, plug-in sales were up 37 percent.\nMexico emerging as an EV production hub\nOutside of China, the US and Europe, EV sales are growing in emerging markets.\nJD Power’s Autovista Group reported that in 2024, “Volumes grew by more than 100% in markets including Australia, Thailand, Brazil, Turkey, Malaysia, and Mexico in 2023 and more than 50% in India and Japan”.\nMexico, for example, is on its way to becoming a major EV production hub.\n“We're already seeing EV production take off in Mexico over the past 12 to 18 months,” said Rho Motion research analyst George Whitcomb during a Benchmark-hosted webinar that INN attended in late November.\nThe growth in Mexico’s EV industry can be attributed to a number of factors, explained Whitcomb.\nThose include its established transport production chains, geographic location, strong position in the traditional global auto industry and trade agreements. “But from an EV standpoint in particular, the US Inflation Reduction Act (IRA) has been central to stimulating EV production in Mexico,” he added.\nWhat’s the EV market outlook for 2025?\nEV Volumes is forecasting that the total EV share of light-vehicle sales worldwide will reach 22.6 percent in 2025. Further out, the firm sees the market share for EVs surging to 44.6 percent in 2030 and 69.5 percent in 2035.\nLooking at the broader market (which includes buses, vans and heavy trucks), tech research firm Gartner predicts that by the end of 2025, 85 million EVs will be on the road, a year-on-year increase of 33 percent.\nChina to continue dominating the EV market\n“The growth in 2025 will be driven primarily by higher EV sales in China (58%) and Europe (24%), which together are projected to represent 82% of total EVs in use worldwide,” states Jonathan Davenport, senior director analyst at Gartner.\nIn 2025, the firm estimates that 49 million EVs will be on Chinese roadways, compared to 20.6 million in Europe and 10.4 million in North America.\nGartner sees China continuing its domination of the global EV landscape for at least another decade. For its part, EV Volumes expects BEVs to “gain ground in the BEV-PHEV mix from 2025 onwards” in China as the government offers further financial supports to motivate consumers.\nEurope’s EV market will cool before heating back up\nEurope’s light-vehicle EV market will see a growth rate of 22.8 percent in 2025, according to EV Volumes, followed by a further 20.1 percent increase in 2026 and a 21.1 percent rise in 2027.\nBy 2030, the firm sees EVs accounting for 61 percent of the overall light-vehicle market in the region.\nGovernment subsidies will continue to be a key factor shaping Europe’s EV industry for 2025, says Rho Motion. For example, the agency notes that France is set to follow Germany’s lead and make a 50 percent cut to its EV subsidies for 2025 as the government works to address fiscal challenges. Spain is also considering reducing subsidies.\nHowever, Forbes reported that professional services firm Accenture has called the slower growth in Europe’s EV market “a temporary blip” as a recent consumer survey shows that “every other consumer in Europe plans to buy an EV in the next 10 years and every fifth consumer in the next 5 years.”\nUS EV market in the Trump era\nEVs are projected to hit 13.5 percent market share for overall US light-vehicle sales in 2025, as per EV Volumes, up from an estimated 10.3 percent in 2024. That figure is expected to rise to 39.7 percent by 2030 and 71.8 percent in 2035.\nWithin the EV market itself, BEVs are still dominating over hybrid models and are expected to account for 82.4 percent of total US EV sales for 2025, up from 78.6 percent in 2024.\nThe IRA, brought forward by the Biden administration in mid-2022, introduced significant tax credits for EV buyers, helping to take the edge off the cost burden of buying into the clean technology. While the IRA is slated to run through 2032, there are concerns that President-elect Donald Trump may reverse those benefits once he takes office in 2025.\n“The US market remains buoyant in part thanks to IRA funding for consumers switching to electric which may be at risk with the start of the Trump presidency,” said Rho Motion Data Manager Charles Lester.\nDon’t forget to follow us @INN_Technology for real-time news updates!\nSecurities Disclosure: I, Melissa Pistilli, hold no direct investment interest in any company mentioned in this article.\n- Adam Rozencwajg: Will EVs Succeed? Efficiency, Emissions and a Potential Catalyst ›\n- Electric Vehicle Stocks: 10 Biggest Companies in 2023 ›\n- Electric Vehicles Need Battery Metals Mining, Investing Opportunities Ahead ›",
  "source": "Investing News Network",
  "published_at": null
}