{
  "title": "Electric Vehicle Outlook 2025",
  "url": "https://about.bnef.com/insights/clean-transport/electric-vehicle-outlook/",
  "content": "The picture in 2025\nGlobal sales of electric vehicles continue to rise and are set to represent one in four cars sold this year. But some markets are experiencing a significant slowdown, and many automakers have pushed back their EV targets. Electrification is spreading quickly in other areas of road transport, with buses and two- and three-wheelers already reaching very high levels of adoption.\nNote: All figures are BloombergNEF’s outlook for 2025. Percentages are the share of new sales in each segment. Includes battery electrics and plug-in hybrids.\nChina dominates the global EV market, with over half of vehicles sold there now electric. Sales in the US are slowing and face uncertainty due to policy changes, while some emerging economies are experiencing record sales as more low-cost electric models arrive targeting local buyers.\nGlobal passenger EV sales by market\nGlobal passenger EV sales by drivetrain\nEV charging infrastructure\nMore and more charging points are being built, but prices are rising in many markets. Each country will have its own optimal mix of home, workplace and public chargers.\nCumulative global public charging connectors\nLithium-ion battery demand\nDespite rising demand, there is significant overcapacity among battery manufacturers, which has helped drive prices down. Battery demand for stationary storage is also growing rapidly as vendors look for new markets.\nAnnual lithium-ion battery demand by application\nNew features in this year’s outlook\n- More countries covered: this year’s outlook includes 14 major auto markets as well as a detailed breakdown for additional EU countries\n- Additional analysis on the growing role of range-extended EVs (eREVs)\n- A new lithium-ion battery cathode, anode and electrolyte forecast for different vehicle segments and markets\n- New analysis on battery manufacturing overcapacity\n- Additional coverage on the impacts of tariffs and trade\nThematic highlights\nThis year’s EV Outlook also includes three thematic highlights, each of which explores a different part of the transition in vehicle markets around the world:\nKey numbers\nExpected growth in global passenger EV sales in 2025\nRisk-adjusted lithium-ion cell manufacturing capacity by the end of 2025 – double expected demand\nRoad transport oil demand peak\nPassenger EV sales in 2030, up from 17.6 million in 2024\nEV electricity demand growth from 2025 to 2030\nTotal announced, under construction, and fully commissioned solid state battery manufacturing capacity in China\nGet the free Executive Summary\nEnter your details to download the executive summary and find out more on the implications of EV adoption for energy markets, raw materials, emissions, charging infrastructure and more.\nBNEF clients can access the full report, including the breakdown by segment, technology and region, as well as the underlying Excel data and previous editions.\nAuthors\nColin McKerracher\nLead author\nAleksandra O’Donovan\nPassenger vehicles\nDr. Nikolas Soulopoulos\nCommercial vehicles and freight\nAndrew Grant\nLead modeler\nJinghong Lyu\nModeling and shared mobility\nSiyi Mi\nTwo and three wheelers, China\nKomal Kareer\nTwo and three wheelers, India and Southeast Asia\nMaynie Yang\nCommercial vehicles and buses\nDavid Doherty\nOil\nClaudio Lubis\nOil\nHuiling Zou\nVehicle economics\nShananthan Kalaichelvan\nElectric vehicles\nRyan Fisher\nCharging infrastructure and electricity demand\nMadeleine Brolly\nCharging infrastructure\nAsh Wang\nCharging infrastructure\nSiong-Hu Wong\nModeling and autonomous vehicles\nEvelina Stoikou\nBatteries\nDr. Andy Leach\nBatteries\nJiayan Shi\nBatteries\nYayoi Sekine\nBatteries\nDr. Kwasi Ampofo\nMetals and mining\nPeng Xu\nMetals and mining\nVinicius Nunes\nBrazil\nJade Patterson\nRenewable fuels",
  "source": "BloombergNEF",
  "published_at": null
}