{
  "title": "Investors Expect Nvidia’s Earnings to Move the S&P More Than Powell’s Speech",
  "url": "https://www.nytimes.com/2025/08/21/business/stocks-nvidia-federal-reserve.html",
  "content": "Supported by\nWhat Matters More to the Stock Market? The Fed or Nvidia?\nWhen Nvidia, the chip producer, reports earnings next week, investors expect the S&P 500 to have a bigger reaction than when the Fed chair delivers a big speech on Friday.\nThere are plenty of data points arriving over the coming weeks that could trip up the runaway stock market.\nOn Friday, the Federal Reserve chair delivers a hotly anticipated speech at Jackson Hole in Wyoming. Not long after that, the Labor Department will release the latest update on hiring, and then there’s an important reading on inflation.\nWhen stock investors look through the end of September, however, they are most focused on the news coming from just one company.\nA financial report released next Wednesday by Nvidia, the chip producer, is expected to produce the S&P’s biggest one-day reaction over the next month.\nThe forecast for that market move is reflected in recent options activity — derivatives that give an investor the right to buy or sell a stock, or an index of stocks, at a future date for a preset price. Investors use options to make bets on the direction of the market and to protect against the potential for the market to move against them.\nAccording to S&P 500 options data from Citi Global Markets, investors are positioned for a 0.8-percentage-point move — in either direction — on Friday, depending on what the Fed chair, Jerome H. Powell, says in his speech at the central bank’s annual conference at Jackson Hole.\nPrices for next Thursday — the first chance investors have to react to Nvidia’s earnings released the night before — imply a move in the index of 0.9 percentage points in either direction.\nThe Fed still looms large over financial markets, with policy decisions that can move markets around the world. But the fact that quarterly results from one technology company focused on artificial intelligence can match, in the view of equity investors, the impact of some of the most widely tracked economic data and central bank activity reflects the significant influence that a handful of behemoth tech companies have on today’s stock market.\n“On a relative basis, Nvidia’s earnings is the largest event for the S&P 500 for the next month,” said Stuart Kaiser, an equity strategist at Citi.\n“For equity investors,” he added, “particularly in the S&P 500, the A.I. theme, and the impact of that on returns, is on par with the Fed now.”\nAs Nvidia has grown, swelling to a $4 trillion valuation last month, so has its weighting in the S&P 500. It now makes up almost 8 percent of the index.\nThe last time Nvidia reported earnings, in May, its stock rose 3.25 percent and the S&P 500 rose 0.4 percent. After reporting earnings in February, Nvidia sank over 8 percent and the S&P 500 dropped 1.6 percent.\nNvidia has led rivals in the race to dominate the high-powered chips used to power A.I., and next week investors are looking for signs that the relentless demand for Nvidia’s products will continue. The company’s earnings could help answer another big question looming over the stock market: whether there is a bubble in A.I., as some have speculated this week.\nOther large companies in the index, like Apple and Microsoft, are also tied to the A.I. theme, so Nvidia’s financial results are likely to affect these other big stocks as well.\n“It’s always a big deal,” said Stacy Rasgon, an Nvidia analyst at Morningstar, joking that he had perhaps become “jaded” by the frequency of big moves in Nvidia’s stock price.\nFor comparison, when Mr. Powell spoke at Jackson Hole last year, the S&P 500 rose a little over 1 percent. The year before, his remarks were followed by a 0.7 percent increase in the index.\nMr. Powell’s address this week could shift investors’ expectations for monetary policy and cuts to interest rate, both of which are crucial inputs for modeling the path ahead for the economy and stock market.\nThe Trump administration has repeatedly complained about the Federal Reserve’s keeping rates elevated, calling on the central bank to lower them rapidly, which would probably make borrowing cheaper and accelerate the economy. It would also help President Trump fulfill a campaign promise to bring interest rates down.\nSo far, the Fed has resisted, warning that rapidly lowering interest rates risks heating up the economy at the wrong time, potentially stoking inflation and raising prices for consumers.\nJoe Rennison writes about financial markets, a beat that ranges from chronicling the vagaries of the stock market to explaining the often-inscrutable trading decisions of Wall Street insiders.\nRelated Content\nAdvertisement",
  "source": "The New York Times",
  "published_at": null
}