{
  "title": "Top Nvidia Shareholders",
  "url": "https://www.investopedia.com/articles/insights/120816/top-3-shareholders-nvidia-corporation-nvda.asp",
  "content": "Nvidia Corp. (NVDA) was founded in California in 1993 and was originally a silicon chip company that specialized in graphics processing units (GPUs). Nvidia has grown dramatically on a global scale as it positioned itself as a leader in visual computing, gaming, visualization, data centers, cryptocurrency mining, and artificial intelligence.\nThe top individual shareholders of Nvidia are Jen-Hsun (“Jensen”) Huang, Mark A. Stevens, and Tench Coxe. The top institutional shareholders are Vanguard Group Inc., BlackRock Inc. (BLK), and FMR LLC.\nNvidia posted a 12-month trailing net income of $76.77 billion as of April 2025 and a 12-month trailing revenue of $148.52 billion for the same period. This represents a net profit margin of 51.69%.\nThe company had a market capitalization of $4.40 trillion as of Aug. 17, 2025, and has become one of the world’s most valuable companies.\nKey Takeaways\n- Nvidia is a leading manufacturer of graphics processing units (GPUs).\n- The biggest Nvidia shareholders are institutional investors that include BlackRock and Vanguard.\n- Founder Jen-Hsun (“Jensen”) Huang is the largest individual shareholder, with approximately 4% of outstanding shares.\n- Nvidia has become one of the most valuable tech companies in the world with the growth of generative artificial intelligence (AI).\nTop 3 Individual Insider Shareholders\nThis list reflects direct ownership. It doesn’t include indirect ownership of shares or shares accessible through stock options.\nImportant\nThe term “insider” refers to people in senior management positions and members of the board of directors, as well as people or entities that own more than 10% of the company’s stock. It has nothing to do with insider trading in this context.\nJen-Hsun (‘Jensen’) Huang\nJen-Hsun Huang, who goes by Jensen Huang, owned 922,922,938 shares of Nvidia as of March 2025, representing 3.77% of all outstanding shares.\nHuang founded the company in 1993 and serves as president and CEO. He’s also a director of Nvidia. Huang worked for chip manufacturer LSI Logic Corp. and semiconductor company Advanced Micro Devices Inc. (AMD) before establishing Nvidia. Huang is listed No. 7 on the Forbes billionaires list with a net worth of about $157 billion as of Aug. 17, 2025.\nMark A. Stevens\nMark A. Stevens owned 37,886,641 shares of Nvidia as of March 2025, representing about 0.15% of all outstanding shares.\nStevens served on Nvidia’s board from 1993 to 2006 and has again served since 2008. Stevens has been managing partner of S-Cubed Capital, a private family office investment firm, since 2012. He was managing partner of venture capital firm Sequoia Capital from 1993 to 2011 and has also held positions at Intel Corp. (INTC) and Hughes Aircraft Co. He has a net worth of $10.7 billion as of Aug. 17, 2025, placing him at No. 261 on the Forbes billionaires list.\nTench Coxe\nTench Coxe owned 32,555,240 shares of Nvidia as of March 2025, representing less than 0.13% of all outstanding shares.\nCoxe has been a Nvidia board member since 1993 and has accumulated enough shares to become a billionaire. He came to Nvidia from the world of venture capital. He served as a managing director for Sutter Hill Ventures from 1989 to 2020 and on the boards of Mattersight Corp. and Artisan Partners Asset Management. His net worth is $7.5 billion as of Aug. 17, 2025, putting him at No. 460 on the Forbes billionaires list.\nTop 3 Institutional Shareholders\nMore than 5,800 institutions filing 13Fs hold Nvidia stock as of Q1 2025. Of these, over 150 hold 10% or more of their portfolio in Nvidia. Roughly 68.72% of all outstanding Nvidia shares are held by institutional shareholders.\nVanguard Group Inc.\nVanguard Group owned 2.23 billion shares of Nvidia as of June 30, 2025, representing 9.15% of total shares outstanding.\nThe company is primarily a mutual fund and exchange-traded fund (ETF) management company with about $10.1 trillion in global assets under management (AUM) as of year-end 2024. The Vanguard Information Technology ETF (VGT) has $115 billion in AUM. As of August 2025, Nvidia is the largest holding in the fund’s portfolio at 18.16% of fund assets.\nBlackRock Inc.\nBlackRock owned 1.91 billion shares of Nvidia as of June 30, 2025, representing 7.83% of total shares outstanding.\nBlackRock is primarily a mutual fund and ETF management company with $12.5 trillion in AUM as of June 2025. The iShares Semiconductor ETF (SOXX) has about $13.7 billion in AUM. As of August 2025, Nvidia is the second-largest holding in the fund’s portfolio at about 8.64% of fund assets.\nFMR LLC\nFMR LLC is the official name of Fidelity Management & Research, also known as Fidelity Investments. The company owned 997.98 million shares of Nvidia as of June 30, 2025, representing 4.09% of total shares outstanding.\nFidelity is one of the nation’s largest financial services companies. It offers investment management, retirement options, brokerage, financial planning, and wealth management services.\nFidelity has a total discretionary AUM of approximately $6.4 trillion. The firm manages a range of ETFs and mutual funds. The Fidelity Blue Chip Growth Fund (FBGRX) has about $79.8 billion in AUM. Nvidia was the largest holding in the fund’s portfolio as of July 31, 2025, at about 16.38% of fund assets.\nWho Are the Owners of Nvidia?\nAsset managers such as BlackRock and Vanguard are the largest owners of Nvidia stock. These companies hold Nvidia stock in mutual funds and ETFs on behalf of their clients. The largest shareholders among individual investors are company insiders and board members like founder Jensen Huang.\nIs Nvidia an American Company?\nYes. Nvidia was founded in 1993 by American computer scientists Jensen Huang, Chris Malachowsky, and Curtis Priem. It’s headquartered in Santa Clara, California, and it covers about 92% of the world’s GPU market.\nWho Are Nvidia’s Main Competitors?\nNvidia’s main competitors have historically been other chipmakers such as Advanced Micro Devices (AMD) and Intel (INTC). Other tech companies like Google and Amazon are also investing in chip architecture, however, with the explosive growth of generative AI. Many startups are also securing funding.\nThe Bottom Line\nChipmaker Nvidia has become one of the most valuable companies in the world with the growth of generative AI. Institutions like Vanguard and BlackRock are the largest shareholders, but company insiders and directors also have significant stakes.",
  "source": "Investopedia",
  "published_at": null
}