{
  "title": "Nvidia's latest tech will let companies turn data centers into one massive GPU",
  "url": "https://finance.yahoo.com/news/nvidias-latest-tech-will-let-companies-turn-data-centers-into-one-massive-gpu-150512505.html",
  "content": "Tech companies are building massive data centers around the world as they race to meet booming AI demand. But some data centers, especially older ones, can only pump in so much power to keep those GPUs and servers humming. Nvidia’s (NVDA) solution: combine the performance of multiple data centers to create one massive GPU.\nThat’s the gist of the plan behind the company’s new Spectrum-XGS network switches. The “GS” stands for gigascale.\nNvidia’s existing Spectrum-X switches allow data center operators to combine multiple server nodes, collections of GPU servers, across a single data center to form one networked GPU that can run especially demanding AI tasks.\nSpectrum-XGS goes beyond that, connecting several data centers. Nvidia says Spectrum-XGS isn’t a new piece of hardware but rather uses existing hardware and new algorithms to allow data to be moved across greater distances.\n“Many data centers are actually power-capped … which means you can get a fair amount of [computing power] into that one data center, but you are probably going to hit a limit … in terms of the amount of power you can get in,” explained Dave Salvator, director of accelerated computing products at Nvidia.\n“So one of the solutions for that is multi-site data center scale,” Salvator added. “These switches are basically purpose-built to enable multi-site scale with different data centers able to communicate with each other and essentially act as one gigantic GPU.”\nAccording to the company, these massive data centers will, over time, allow developers to train and deploy more ambitious agentic AI applications.\nIt’s not that companies would have to build fewer data centers, but rather that, as they build them, they’ll be able to combine them with other data centers to get even more performance out of them.\nNvidia’s announcement comes just a few short days before the company is expected to report its second quarter earnings. That will provide Wall Street with a better sense of the company’s continued sales growth and the health of the broader AI trade.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on X/Twitter at @DanielHowley.\nRead the latest financial and business news from Yahoo Finance",
  "source": "Yahoo Finance",
  "published_at": null
}