{
  "title": "Stock market today: Dow, S&P 500, Nasdaq rally stalls as Nvidia soars to record",
  "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rally-stalls-as-nvidia-soars-to-record-200119699.html",
  "content": "US stocks wavered on Wednesday as President Trump said the Israel-Iran conflict was effectively \"over\" for now, while Fed Chair Jerome Powell stressed the central bank is still studying the effects of Trump's tariffs before deciding on rate cuts.\nThe Nasdaq Composite climbed about 0.3%, boosted by Nvidia’s (NVDA) 4% rise that helped the chipmaker secure a record closing price. The S&P 500 (^GSPC) flirted with its own all-time highs but ended the trading day nearly flat, just below its record level. Meanwhile, the Dow Jones (^DJI) slipped about 0.3%, falling just over 100 points.\nStocks lost steam as Powell testified before the Senate Banking Committee in his second day of congressional testimony. He tangled with Republican senators amid pressure from the GOP side, most prominently from Trump himself, to cut rates.\nFed Chair Jerome Powell emphasized that inflation from tariffs is still an open question, noting the central bank is closely watching upcoming economic data to assess the impact on monetary policy.\n\"There will be some inflation from tariffs coming, not yet, but over the course of the coming months,\" Powell said.\nMarkets responded positively to Powell's prior day testimony, where he hinted that rate cuts could come \"sooner rather than later.\"\nHis remarks set the stage for Friday’s closely watched release of the Fed’s preferred inflation measure, the Personal Consumption Expenditures (PCE) report, which investors will scrutinize for clues on the future path of monetary policy.\nEconomists expect annual \"core\" PCE — which strips out volatile food and energy costs — to have ticked up in May, compared with April. But scrutiny will also fall on any signs that Trump's tariffs pushed prices higher.\nInvestors are also keeping a close eye on the US-brokered Middle East truce, which appears to be holding. There have been no reported strikes between Israel and Iran since Trump lambasted both for breaching an agreement to pause hostilities to give room for diplomacy. Oil prices edged higher on Wednesday as tensions cooled.\nLIVE COVERAGE IS OVER 27 updatesTesla slides more than 5% as EU sales slump\nTesla (TSLA) stock fell more than 5% on Wednesday as its sales in the European Union fell for a fifth-straight month.\nIn May, Tesla's new EU car registrations, a proxy for vehicle sales, tumbled 41% compared to the prior year.\nThis pushed shares of the EV maker lower despite a broader tech rally that included rises in each of the other \"Magnificent Seven\" tech stocks. More broadly, Tesla was one of the few large cap stocks in the red within the Nasdaq 100 (^NDX) which added about 0.4%",
  "source": "Yahoo Finance",
  "published_at": null
}