{
  "title": "Watch These Tesla Price Levels as Stock Slides Ahead of Earnings Report",
  "url": "https://www.investopedia.com/watch-these-tesla-price-levels-as-stock-slides-ahead-of-earnings-report-11718662",
  "content": "Key Takeaways\n- Tesla shares skidded on Monday as investors await the EV maker’s highly anticipated quarterly results, due after Tuesday’s closing bell.\n- Since finding a local bottom in early March, Tesla shares have consolidated within a descending triangle, a bearish chart pattern that signals a continuation of the stock’s recent downtrend.\n- Investors should watch important support levels on Tesla's chart around $170 and $139, while also tracking overhead areas near $289 and $360.\nTesla (TSLA) shares skidded on Monday as investors await the EV maker’s highly anticipated quarterly results, due after Tuesday’s closing bell.\nThe company released weaker-than-expected first-quarter delivery numbers earlier this month, and analysts have expressed concern about the impact that the Trump administration’s tariffs will have on the auto maker the remainder of the year. Market watchers will be looking for updates from CEO Elon Musk about how Washington’s trade war with China stands to affect Tesla.\nTesla shares have reversed gear in 2025, slumping 44% since the start of the year amid concerns that Musk’s active involvement in the Trump administration has dented the automaker’s brand, hurting sales, and distracted him from leading the company. The stock fell nearly 6% to $227.50 on Monday.\nBelow, we break down the technicals on Tesla’s chart and identify important levels worth watching.\nDescending Triangle Takes Shape\nSince finding a local bottom in early March, Tesla shares have consolidated within a descending triangle, a bearish chart pattern that signals a continuation of the stock’s recent downtrend. Moreover, the 50-day moving average (MA) crossed below the 200-day MA last week to form an ominous death cross, a technical event that forecasts lower prices.\nMeanwhile, the relative strength index (RSI) points to lackluster price momentum, with the stock’s recent upswing barely bumping the indicator back above the 50 threshold.\nLet’s identify two key support levels on Tesla’s chart where the shares could attract buying interest amid further selling and also locate important overhead areas worth tracking during potential recovery efforts.\nKey Support Levels to Watch\nA breakdown below the descending channel’s lower trendline could see selling accelerate toward $170. Investors may look to place buy limit orders in this location near the lower range of a consolidation period that formed on the chart throughout May and June last year.\nA more significant drop opens the door for a move down to $139, a location on the chart that could attract strong support near last year’s prominent April swing low. This area also sits just below a projected bars pattern downside target that takes the stock’s downtrend following an earlier descending triangle on the chart and repositions it from the current pattern’s top trendline, with the analysis assuming a downward continuation move may play out.\nImportant Overhead Areas Worth Tracking\nAmid potential recovery efforts in the stock, investors should keep a close eye on the $289 level. This region on the chart could provide considerable selling pressure near the 200-day MA, last month’s swing high, and the stock’s post-election breakaway gap closing price.\nFurther buying in Tesla shares could drive a move up to $360. Investors who have bought the stock at lower levels may look for exit points in this location near a trendline that connects February’s countertrend high with a range of corresponding trading activity stretching back to last November.\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info.\nAs of the date this article was written, the author does not own any of the above securities.",
  "source": "Investopedia",
  "published_at": null
}