{
  "title": "Markets News, June 5, 2025: Stocks Fall as Investors Digest News on Trade Talks, Brace for Jobs Report; Tesla Tumbles 14% Amid Musk-Trump Fracas",
  "url": "https://www.investopedia.com/dow-jones-today-06052025-11748703",
  "content": "Stocks fell Thursday as investors digested the latest developments on the trade front and key economic reports, while an increasingly bitter spat between President Donald Trump and Tesla CEO Elon Musk sent shares of the EV maker reeling.\nThe Dow Jones Industrial Average declined 0.3%, while the S&P 500 and tech-heavy Nasdaq Composite dropped 0.5% and 0.8%, respectively. The S&P 500 and Nasdaq entered the day on three-day winning streaks, though the gains had been modest, while the Dow fell for the second straight day.\nStocks have rebounded from their early-April lows—the S&P 500 and Nasdaq in May recorded their biggest monthly gains since November 2023—as concerns have subsided about Trump's tariff strategy, while corporate earnings and economic data have remained strong in the face of ongoing uncertainty about where trade policy is headed. Market participants are looking for signs of progress on the trade deals the White House has said it is negotiating, ahead of deadlines for hefty tariffs to be reimposed.\nTrump spoke with his Chinese counterpart, Xi Jinping, this morning, a 90-minute discussion that the U.S. president said focused on trade and was \"very positive\", with both sides agreeing to schedule more talks soon. Over the past week, the U.S. and China had accused each other of violating the terms of an agreement struck last month, under which the two countries agreed to slash the massive tariffs they'd imposed on one another while a broader deal was negotiated.\nOn the economic calendar today, trade data showed that the U.S. trade deficit narrowed more than economists had expected as imports have plunged in response to tariffs, while weekly jobless claims numbers were slightly higher than expected. The big economic event of the week comes Friday morning, when the May jobs report is scheduled for release.\nTesla (TSLA) shares were in the spotlight Thursday amid the very public spat between Trump and Musk, who in recent days had criticized a sprawling tax and spending bill currently before Congress. The stock closed 14% lower, adding to yesterday's steep declines, after Trump expressed disappointment in Musk, who then fired back with a series of social media posts. Musk recently left his position as head of the government's Department of Government Efficiency, and the dispute with Trump raises concerns about how the government will deal with issues that affect the company.\nOther mega-cap technology stocks, which have led the recent rally, were mixed. Nvidia (NVDA) and Apple (AAPL) each dropped about 1%, while Meta Platforms (META) and Broadcom (AVGO), which reported results after the closing bell, fell slightly. Microsoft (MSFT), Amazon (AMZN) and Alphabet (GOOG) inched higher.\nA handful of companies made big moves after reporting earnings. Brown-Forman (BF.B) dropped 18%, leading S&P 500 decliners, after the maker of Jack Daniel's whiskey warned about a \"challenging\" economic outlook this year. Shares of PVH (PVH) also tumbled 18% after the parent of the Calvin Klein and Tommy Hilfiger brands warned that tariffs will weigh on profits. MongoDB (MDB) shares soared 13% after the database software company reported better-than-expected results and a rosy outlook amid booming AI-related demand.\nThe yield on the 10-year Treasury note, which affects borrowing costs on all sorts of consumer and business loans, rose to 4.40% from 4.37% at yesterday's close. The U.S. dollar index, which measures the performance of the dollar against a basket of foreign currencies, slipped 0.1% to 98.72.\nBitcoin was at $101,200 in late-afternoon trading, down from an earlier high of near $106,000. The digital currency is trading at its lowest level since early May and is down from a record high of around $112,000 set two weeks ago.\nGold futures fell 0.7% to $3,375 an ounce, after rising as high as $3,430 earlier, a one-month high. West Texas Intermediate futures, the U.S. crude oil benchmark, rose 0.6% to $63.25, rebounding from a decline of more than 1% yesterday.\nBiggest S&P 500 Movers on Thursday\nDecliners\n- Shares of alcoholic beverage maker Brown-Forman (BF.B) plummeted 17.9%, falling the most of any S&P 500 stock and sinking to their lowest level in more than 11 years. The downturn came after the company behind Jack Daniel's whiskey said it faces a challenging operating environment this year, citing geopolitical volatility, consumer headwinds, and uncertain tariff impacts.\n- Tesla (TSLA) shares plunged 14.3% as tensions mounted between CEO Elon Musk and President Donald Trump. Since departing his role with the Trump administration last week, Musk has repeatedly criticized the Trump-backed budget reconciliation bill, prompting Trump to question his relationship with the SpaceX chief and former government efficiency official. In addition, a report earlier this week showed Tesla's sales last month in Germany, Italy, and the U.K. fell compared with a year ago.\n- Palantir Technologies (PLTR) shares dropped 7.8% on Thursday, extending a pullback that began in Wednesday's session. Investor optimism about the big data analytics firm's expanding business with the federal government helped the stock hit an all-time closing high on Tuesday. Still, the integration of Palantir's Foundry platform into numerous government systems has stirred controversy. Speaking with CNBC on Thursday, Palantir CEO Alex Karp rejected a New York Times report indicating the company may have been involved in compiling a surveillance database on U.S. citizens.\nAdvancers\n- After posting the steepest drop in the S&P 500 on Wednesday, Dollar Tree (DLTR) shares roared back, jumping 9.1% to secure Thursday's best performance in the benchmark index. The recovery came after JPMorgan upgraded Dollar Tree stock to \"overweight\" from \"neutral.\" Analysts highlighted growth potential driven by the retailer's expansion of its multi-price-point \"MPP 3.0\" strategy as Dollar Tree updates store formats to offer a broader range of products.\n- Shares of Cooper Companies (COO) gained 5.6% after the medical device maker outlined its strategic initiatives at an investor conference. The company is targeting faster growth in the contact lens market by expanding several key product lines and offering free lenses to encourage trials.\n- Norwegian Cruise Line Holdings (NCLH) shares gained 5.2% after Citigroup boosted its price target on the stock. Analysts cited improving trends from their research into web traffic and pricing in the cruise industry, with improvements in May after some softness in April.\nTesla Loses Spot in the $1 Trillion Club\nTesla CEO Elon Musk’s long-distance spat with the president cost the EV maker a spot in the $1 trillion club on Thursday.\nShares of Tesla (TSLA) fell more than 14% on Thursday as Musk and President Donald Trump exchanged jabs across social media platforms. Thursday’s decline cut more than $150 billion from Tesla’s market capitalization, dropping its market value to about $913 billion.\nMusk has been criticizing President Trump’s One Big, Beautiful Bill Act for days. He called it a “disgusting abomination” on Tuesday, and on Wednesday urged his followers on X, the social media platform he owns, to tell their senators to kill the bill. Musk officially left his role in the Trump administration’s cost-cutting Department of Government Efficiency last week.\nTrump responded on Thursday, telling reporters from the White House that he was “very disappointed” by Musk’s criticism. Trump went on to insist he would have won November’s election without the hundreds of millions of dollars Musk to support him and other Republicans. Trump later took to Truth Social to call Musk “CRAZY” and threaten to cancel Musk’s government contracts.\nTesla's stock has been on a rollercoaster ride this year. Shares shed as much as 40% of their value in the first quarter as sales slumped, tariffs hit the stock market, and controversy swirled around Musk. They staged a comeback in April and May after Musk said he would step back from Washington.\nThursday's decline erased much of that rally and put shares down about 30% since the start of the year.\nWhat to Expect From the Jobs Report Friday\nThe Bureau of Labor Statistics is scheduled to release its monthly jobs report on Friday morning, and investors will watch closely.\nThe May employment report is the government's official measure of the labor market. If other measures from the private sector are any indication, Friday's report could be a harbinger of tariffs' effects on the broader economy.\nAccording to a survey by Dow Jones Newswires and The Wall Street Journal, economists expect the report to show 125,000 jobs were added in May.\nThat would be a slowdown from the unexpectedly high 177,000 in April.\n\"While trade policy uncertainty declined after the U.S.-China trade deal, it remained very high across the payroll month,\" wrote analysts at Goldman Sachs on Thursday. \"Elevated uncertainty is likely to disproportionately weigh on employment growth in months when gross hiring is particularly elevated, such as May.\"\nEconomists also expect the unemployment rate to remain at 4.2%, the same as last month. Over the last twenty years, it has averaged 5.8%.\nOfficial government reports on the labor market have shown it has been surprisingly resilient to tariff pressures. Still, economists and private sector reports indicate a rough road ahead.\nRead the full article here.\nBrown-Forman Plunges as Spirits Maker Warns on Outlook\nBrown-Forman (BF.B) was the worst-performing stock in the S&P 500 Thursday after the maker of Jack Daniel's whiskey warned about a \"challenging\" economic outlook this year.\nThe company that also has brands such as Woodford Reserve, Chambord, and Korbel predicted the operating environment in fiscal 2026 will have \"low visibility due to macroeconomic and geopolitical volatility as we face headwinds from consumer uncertainty, the potential impact from currently unknown tariffs, and lower non-branded sales of used barrels.\"\nBrown-Forman sees both full-year organic sales and organic operating income to drop by a low-single-digit percent.\nCEO Lawson Whiting said Brown-Forman faced \"softening consumer demand\" as well as \"an exceptionally challenging macroeconomic environment,\" and that it expects \"continued headwinds.\"\nThe company reported fiscal 2025 fourth-quarter earnings per share of $0.31, with revenue falling 7% year-over-year to $894 million. Both were short of Visible Alpha forecasts.\nShares of Brown-Forman sank more than 15% in recent trading to their lowest level since September 2013.\nTesla Sinks as Musk-Trump Fracas Intensifies\nTesla (TSLA) shares dropped Thursday, falling for a second straight day, amid a public spat between CEO Elon Musk and President Donald Trump.\nThe stock was down nearly 9% in recent trading, extending Wednesday's decline. It has lost about one-quarter of its value since the start of the year.\nMusk left his role in the Trump administration last week. He has since attacked the Trump-backed budget reconciliation bill currently working its way through Congress, calling it a \"disgusting abomination,\" and urging the Senate to \"kill the bill.\" Trump at an event with the Chancellor of Germany on Thursday said he is \"very disappointed\" in Musk's recent attacks.\nTrump said that Musk \"knew everything\" about the bill, and claimed that the Tesla CEO only turned against the bill because of the cuts it would make to electric vehicle mandates and programs. \"Elon and I had a great relationship,\" Trump said. \"I don't know if we will anymore.\"\n\"Whatever,\" Musk said in a post responding to a video of Trump's comments. \"Keep the EV/solar incentive cuts in the bill, even though no oil & gas subsidies are touched (very unfair!!), but ditch the MOUNTAIN of DISGUSTING PORK in the bill.\"\nIn a separate post, Musk called Trump's assertion that he knew details about the bill \"false,\" and said that members of Congress did not read it before voting on it.\n\"Without me, Trump would have lost the election,\" Musk posted minutes later.\nTesla has also gotten more disappointing sales news in recent days: Auto industry groups in several European countries reported sales data for May showing declines in Tesla sales as overall EV sales rose. Despite the weak sales, some analysts have pointed to the planned launch of fully autonomous Tesla rides in Austin, Texas this month as a coming positive catalyst for the stock.\nThe stock's recent declines have rolled back some of Tesla's gains after Musk in April said he would spend more time at his companies, and left the Trump administration in May.\nWhat Analysts Think of Broadcom Ahead of Earnings Thursday\nBroadcom (AVGO) is scheduled to report fiscal second-quarter results after the closing bell Thursday, with Wall Street expecting growing revenue and profits fueled by demand for AI chips.\nAnalysts on average expect Broadcom to report revenue of $15.02 billion, up 20% year-over-year, and adjusted net income of $7.8 billion, up from $5.39 billion a year ago. AI revenue is expected to climb 42% year-over-year and 7% sequentially to $4.42 billion.\nOppenheimer analysts called Broadcom the “No. 2 AI franchise after NVDA,” in a note to clients last week, raising their price target to $265 from $225. Broadcom’s “core franchises in networking, wireless, broadband, server/storage, and software support sustainable growth,” the analysts said. “We remain long-term buyers.”\nOf the 14 analysts tracked by Visible Alpha, 13 have a “buy” or equivalent rating for Broadcom stock, with one “hold.” However, their consensus price target near $252 would suggest a decline from the stock's current level. The stock was up 1% at $264 in recent trading, nearing an all-time high.\nAfter Nvidia's (NVDA) strong sales report last week, Morgan Stanley analysts said they “also are positive on [Broadcom] in the AI space, but we are hard pressed to generate additional enthusiasm.\"\nStablecoin Issuer Circle Prices IPO Above Expected Range\nFintech firm Circle Internet Group, which issues the USDC stablecoin, on Wednesday priced its upsized initial public offering above its expected range.\nThe offering now totals 34 million shares at $31 each, up from 32 million shares at an expected range of $27 to $28 announced Monday. The company is offering 14.8 million shares and selling stockholders 19.2 million shares, Circle said, adding underwriters have a 30-day option to purchase up to an additional 5.1 million shares.\nShares are expected to begin trading Thursday on the New York Stock Exchange under the ticker \"CRCL.\"\nUSDC is the seventh-largest cryptocurrency, per CoinMarketCap, with a market cap of about $61.5 billion.\nFive Below Soars on Strong Results, Boosted Outlook\nFive Below (FIVE) shares jumped Thursday, a day after the discount retailer posted better-than-expected results and boosted its full-year outlook on an increase in transactions and sales at new locations.\nThe company that advertises it sells merchandise at $5 or less reported first-quarter adjusted earnings per share (EPS) of $0.86 on revenue that soared nearly 20% year-over-year to $970.5 million, as well as same-store sales that grew 7%. All topped Visible Alpha consensus estimates.\nCEO Winnie Park said Five Below saw \"broad-based strength across the majority of our merchandising worlds.\" Park noted the same-store sales increase was \"transaction-driven,\" and new stores put in a \"strong performance.\" The company added 55 outlets in the period, and plans to open 30 more in the current quarter.\nFive Below expects full-year adjusted EPS of $4.25 to $4.72 compared with its previous outlook of $4.10 to $4.72, and sales of $4.33 billion to $4.42 billion, up from its earlier projection of $4.21 billion to $4.33 billion.\nShares of Five Below were up 8% recently, trading at their highest level in about a year.\nPVH Sinks as Calvin Klein Owner Says Tariffs Will Hurt Profits\nShares of PVH (PVH) plunged in early trading Thursday, a day after the apparel maker warned full-year profit will be dragged down by new U.S. tariffs.\nThe company behind the Calvin Klein and Tommy Hilfiger brands reported it now sees 2025 adjusted earnings per share (EPS) of $10.75 to $11.00, down from its earlier outlook of $12.40 to $12.75. It explained that the guidance \"reflects an estimated net negative impact related to the tariffs currently in place for goods coming into the U.S., including an approximately $65 million unmitigated impact to full year 2025 EBIT, or approximately $1.05 per share.\" It added the effects would be partially offset by \"planned mitigation actions\" in the second half of the year.\nCFO Zac Coughlin said PVH was \"decreasing our outlook for profitability and earnings per share to reflect that backdrop and the current performance of our business.\"\nThe news offset better-than-expected first-quarter results, boosted by demand in the Americas and Europe, Middle East, and Africa (EMEA). The company posted adjusted EPS of $2.30, with revenue rising 2% year-over-year to $1.98 billion. Both exceeded Visible Alpha forecasts.\nSales in the Americas were up 7% to $608.4 million, and 5% to $927.7 million in EMEA. However, sales tumbled 13% to $351.7 million in the Asia-Pacific region, and licensing revenue dropped 1.5% to $95.8 million.\nTommy Hilfiger sales grew 3.4% to $1.05 billion, while Calvin Klein sales were basically flat at $886.1 million. Sales of its Heritage brand fell 5% to $49.4 million.\nPVH shares were down 19% in recent trading. The stock has lost nearly half its value since the start of the year.\nWatch These MongoDB Levels as Stock Pops After Earnings\nMongoDB (MDB) lifted its full-year outlook and boosted its stock buyback program, sending shares of the AI-powered software sharply higher on Thursday.\nThe company said its flagship Atlas multi-cloud database subscription offering, which accounts for the lion’s share of net sales, recorded revenue growth of 26% in its latest quarter, adding that the firm also registered the highest total net customer additions in six years as enterprises and startups seek to modernize existing software and build new AI applications.\nHeading into MongoDB’s earnings, the stock was 14% lower over the past 12 months but had recovered 42% from its early-April low amid a strong rebound in AI software stocks. The stock was up 15% at around $229 in early trading Thursday.\nMongoDB shares have carved out an inverse head and shoulders-like pattern between March and June, paving the way for a bullish upside reversal.\nMore recently, the pattern’s right shoulder found support just above the 50-day moving average (MA), with the relative strength index (RSI) confirming strengthening price momentum. That momentum could accelerate in Thursday's trading session following the company’s better-than-expected quarterly results.\nInvestors should watch crucial overhead areas on MongoDB's chart around $253, $298, and $355, while also monitoring a key support level near $212.\nMajor Index Futures Holding Steady This Morning\nFutures tied to major U.S. stock indexes were each up less than 0.1% in recent trading.\nDow Jones Industrial Average\nS&P 500\nNasdaq 100",
  "source": "Investopedia",
  "published_at": null
}