{
  "title": "I review over 200 laptops each year, and these are the best laptops of 2025",
  "url": "https://www.tomsguide.com/best-picks/best-laptops",
  "content": "I review over 200 laptops each year, and these are the best laptops of 2025\nHere are the best laptops my team and I recommend based on testing dozens of models from Apple, Dell, HP, Lenovo, Microsoft and more.\n- My top picks\n- Best overall\n- Best value\n- Best for Windows\n- Best Copilot laptop\n- Best Chromebook\n- Most repairable\n- Best for gaming\n- Best battery life\n- Best MacBook Air alternative\n- Best 2-in-1\n- Best MacBook Pro\n- Best MacBook Pro alternative\n- Also tested\n- Battery life results\n- How to choose\n- Frequently asked questions\n- How we test\nIf you'd told me when I was a kid that one day I'd have the chance to review all the latest laptops before they're released, I'd never have believed you.\nBut lo and behold here I am, and every year I get to review dozens of the latest laptops from the likes of Apple, Dell, Lenovo, Microsoft and more. Together, my team and I review hundreds of laptops every year, and I pull the best of the best for this list.\nThat's why I typically recommend Apple's MacBook Air M4 as the best laptop for most people: it's lighter, faster and longer-lasting than most other laptops on the market, and now that Apple's cut the price it's cheaper than ever.\nFor those who prefer Windows over macOS I recommend the Dell XPS 13 with Snapdragon chips instead because it's just as thin and fast as the MacBook Air, plus it lasted nearly 20 hours in our battery tests, dethroning MacBooks as the de facto battery life champs.\nOf course, Qualcomm's Snapdragon chips aren't great for gaming, so if you want a great gaming laptop I recommend the Asus ROG Zephyrus G14 because its svelte, powerful and looks great on a desk.\nIf those laptops are too pricey for your needs, I think the Acer Aspire Go 15 is the ideal pick for tight budgets because it's a capable Windows laptop that costs a couple hundred bucks—so it's a smart choice for children, students and anyone who needs a cheap Windows laptop for work.\nIf those aren't what you're after, I have lots more suggestions to offer based on my team's combined 40+ years of experience using and reviewing laptops. Let's dive in!\nMy top picks\nBest overall\nI like the M4 MacBook Air because it's $100 cheaper than its predecessors yet delivers impressive power, a great webcam and long battery life in a sleek chassis. If you want a laptop to work on the go and don't mind macOS, this is the one to buy.\nBest Windows\nIf you prefer Windows 11, the Snapdragon X Elite Dell XPS 13 is my top recommendation for a great laptop for on-the-go work because it offers speedy performance and incredibly long battery life, all packed in a svelte easy-to-carry design.\nBest value\nJust need a good laptop for not much money? I recommend the Acer Aspire Go 15, a reliable Windows 11 laptop that's fully featured yet costs under $300. The webcam sucks and the screen and speakers aren't amazing, but it's plenty good enough for work or school.\nTo help you on your way, here are some key questions you need to ask yourself before picking.\nWhat is the best laptop for me?\nTo find the best laptop for your needs, I need to know what you're going to do with it and where you plan to use it most often.\nWork & Productivity: If your #1 priority is having a portable PC you can use to answer email, prepare documents and get work done on the go, you want a modern ultraportable that's light, comfy to use and offers great battery life. I generally recommend the MacBook Air M4 (macOS) or the Dell XPS 13 (Windows 11) for this, and you can upgrade to models with bigger screens if you want more room to work. If you're technical and like the idea of upgrading and repairing your own laptop, I wholeheartedly recommend you check out the Framework Laptop instead since you can modify and upgrade it for as long as you own it, in a way that no other laptop can match.\nGaming: If you plan to spend a lot of time gaming, you want a laptop with a speedy CPU, a discrete laptop graphics card and plenty of RAM. If you plan to play at higher than 60 frames per second, a screen with a high refresh rate is also great. Personally, I recommend the Asus ROG Zephyrus G14 since it satisfies all these requirements.\nCreative work: If you plan to do a lot of 3D work, video editing or demanding content creation you will want a laptop that's very similar to a gaming laptop, with a powerful CPU, a discrete GPU and plenty of RAM to handle demanding workloads. But you also want a sharp, color-accurate screen, which is why I generally recommend the MacBook Pro (14-inch M4) or the Asus ProArt P16.\nCasual use: If you just need a laptop for basic writing, browsing the web and binge-watching your favorite shows, you can save yourself a lot of money with a budget-friendly laptop. I recommend the Acer Aspire Go 15 if you prefer Windows, or the Lenovo Flex 5i Chromebook Plus if you're okay with a Chromebook and have reliable access to Wi-Fi (because Chromebooks can't do much without an Internet connection).\nShould I buy a MacBook, Windows laptop or a Chromebook?\nBuy a MacBook if you are comfortable using Macs or are already embedded into the Apple ecosystem. While macOS is not as robust as Windows when it comes to gaming, many people find it easy to use and it's tightly integrated with Apple's other products, so your iPhone, iPad and AirPods will seamlessly work with your Mac.\nBuy a Windows 11 laptop if you need access to the widest selection of apps, are not tied down to any particular ecosystem, want the best gaming experience and are looking for the broadest selection of laptop designs. Only Windows laptops come with features like touchscreens, high-speed displays or the option to transform into a tablet. However, they typically have worse battery life than the best MacBooks.\nBuy a Chromebook if your work and entertainment needs revolve entirely around a browser. If everything you do is within a Chrome browser, then a Chromebook is the most direct (and cheap) way to get there. Just be aware you'll be limited to that browser window—ChromeOS is a robust operating system, but without Internet access it can't do much.\nThe best laptops you can buy right now\nWhy you can trust Tom's Guide\nThe best laptop overall\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe MacBook Air M4 is once again another fantastic all-rounder — definitely the best MacBook and the best laptop for most folks reading this list. And not only that, but the starting price is $100 less than it was for the M3 Air!\nStarting at $999, it may look the same from the outside. But with the speedy new M4 chip giving it performance potential that far exceeds Intel, AMD and Qualcomm's similarly-priced efforts, a long battery life, and an impressive new 12MP camera, there's a lot to love for everyone.\nBuy it if\n✅ You want a small, fast MacBook: The M4 chip inside this MacBook Air delivers exceptional multitasking power, seamlessly balancing performance with impressive battery life and an ultra-light design.\n✅ You need a long-lasting laptop: While the M4 Air doesn't last as long as M3, and some Windows laptops have caught up, with just under 15 hours clocked in my battery life testing, it's got great stamina.\nDon't buy it if\n❌ If gaming is important to you: Yes, Apple Silicon-optimized games run well here. But the vast majority of titles struggle. Intel and AMD have made big graphical gains in their\n❌ You own a MacBook Air 13-inch M3 or M2: Yes, there are impressive performance gains and that new webcam on the table here. But if you have the M3 or M2 MacBook Air, you've got a few more years of software support yet!\nThe bottom line\n💻 The MacBook Air M4 understood the brief — give us more of the same, but better and cheaper. And at $999 for this lightweight monster of a system, I know you'll love it just as much as I do.\nThe review diary\nRead the deep dive ▼\nAfter one week\nMy first week with the M4 MacBook Air was a little different to my time with the M3 Air. Three generations into this design, I'm no longer trying to figure out how Apple is able to cram that performance and power efficiency into its uber-slim chassis. But what did jump out at me was one number: $999.\nFor the impressive versatility of what you can do with the Air and the upgrades made to the all-round experience, to chop $100 off is significant. What started as a great time with this machine just became even greater with the value for money in mind.\nFor the varied workload I have across 20+ Chrome tabs, Spotify blaring in the background and some Photoshop editing, I experienced zero slowdown.\nTo put our lab testing to this, the Air hit 3,751 on the single-core CPU test and 14,947 on multi-core in Geekbench 6. That assures a zippy fluid macOS experience while being able to handle parallel tasks quickly in the background. Plus, it does it all while keeping impressively cool without the need for a fan.\nAs for the many meetings I find myself in, the 12MP Center Stage webcam delivers a nice picture quality upgrade over the 1080p shooter on the M3, with a strong built-in microphone for me to sound loud and clear to my colleagues.\nWhat about when you clock off? You've got the same sharp, bright and colorful display as you'd find in previous models — clocking in a 470 nits of brightness with an 82.5% DCI-P3 color gamut in our testing. This made it a great window for binge-watching to my heart's content.\nHowever, that's where I turn to gaming. I had a great time spending hours playing Lies of P, which is a game optimized for Apple silicon. The library of games using MetalFX are building nicely, with Cyberpunk 2077 coming soon.\nBut for the vast majority of games, you won't get an experience as smooth as what you see from the vastly upgraded integrated graphics you see in Intel and AMD chips. And speaking of Windows laptops, Qualcomm systems have closed the gap and even beaten the M4 Air in battery life.\nThese are points I need to highlight, but for most of you reading this, they are non-factors. This is a great laptop with powerful internals and a long battery life (along with all those sleek Apple Intelligence features) — all packed into a gorgeous design that now comes in Sky Blue.\nSince I've just had this laptop for a week, check back in a few weeks for my longer-term impressions after a month!\nRead the full review: MacBook Air 13-inch M4\nThe best value laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe Acer Aspire Go 15 is easily one of the best budget laptops you can buy, for better and for worse. At $299, you get a thick-set 15-inch ultraportable with a spacious keyboard, plenty of ports and 10+ hours of tested battery life.\nOf course, you have to make some trade-offs when you buy this laptop. The speakers aren't very good, the low-res webcam makes you look washed-out and performance in anything but writing and browsing the web is pretty disappointing.\nBut if you can live with those compromises you get a pretty useful laptop for not very much money. It's the kind of thing I'd recommend a parent give a child as their first laptop, as it's great for surfing the web and doing homework. Remote learning, office work and research are all easy to do on this affordable 15-incher, but don't expect to play games or run apps more complicated than Minecraft.\nBuy it if\n✅You need a Windows 11 laptop under $500: The Acer Aspire Go 15 is one of the best laptops under $500 you can get, in my opinion, because it delivers all the utility of a Windows ultraportable for $299. If you need a cheap laptop for school or getting basic work done, this is a great choice.\n✅ You need a versatile productivity machine: Acer's Aspire Go 15 can feel sluggish and can't run demanding games or apps, but what it can do is handle web surfing, writing, schoolwork and emails. The keyboard is surprisingly spacious and comfy and you get a versatile array of ports to boot, making this cheap laptop surprisingly good for school and office work.\nDon't buy it if\n❌ You can't stand sluggish PCs: The Acer Aspire Go 15 can help you get work done, but it won't do it quickly. The weak Intel Core i3-N305 CPU in our review unit chugged if I opened too many Chrome tabs or apps at once, and forget about playing any but the simplest of PC games.\n❌You want to look good on video calls: The cheap 720p webcam built into the Acer Aspire Go 15 is just not very good. It's serviceable if you need to have a chat with colleagues or family, but you won't look your best.\nThe bottom line\n💻 The Acer Aspire Go 15 is a cheap Windows laptop, in both good and bad ways. Luckily, the parts of it which feel cheap in a bad way aren't dealbreakers unless you really can't stand a slow laptop. But if you can make peace with its underpowered performance, the Go 15 will reward you with a sturdy, versatile Windows experience that can last 10+ hours on a full battery, according to our testing.\nThe review diary\nRead the deep dive ▼\nAfter one week\nWhen it comes to buying a cheap laptop, the first thing you notice is the build quality. There's simply no escaping the fact that it is a hunk of plastic — chunkier and heavier than your average 15-inch laptop at 0.74-inches thick and weighing 3.86 pounds.\nBut once I got off my high horse about that, you realize that Acer has focused its efforts on what matters here. The plain silver gives off a utilitarian aesthetic that doesn't look cheap if you're pulling this out in a cafe or meeting room. It's the design equivalent of shopping at Shein.\nThat doesn't mean the fundamentals have gone forgotten here, though, as the keyboard has a shockingly good tactile feel to it for a $300 machine, and there's a decent port array with two USB-A ports, a USB-C, HDMI and a 3.5mm headphone jack — everything you need to get stuff done.\nHowever, the first real obstacle you run into is that Intel Core i3 chipset. You've really got to keep an eye on how many apps you keep open, as anything above two programs or 10+ Chrome tabs really starts to slow this machine down.\nIt was quite the pain when trying to watch a tech live stream and report on it at the same time.\nAfter one month\nWhile I kept running into the walls of the laptop's performance capabilities, one thing I ended up appreciating during the next few weeks was the battery life.\nCheap laptops usually have the stamina equivalent of me daring to get on a running machine (I'll leave the fitness to the fitness team, as I'm more concerned with fit'ness burger in my mouth).\nBut with over 10 hours of longevity in our own testing, this can keep up with a whole working day away from the charger.\nAnd finally, let's talk about the display here. If you're going for a budget laptop, you've got to understand that this is usually the area where the most compromise happens. With that in mind, the 15.6-inch LCD panel on here does show its cheapness in being dim and a little washed-out color-wise.\nHowever, that 1080p resolution is crispy, the 60Hz refresh rate is smooth enough to not feel slow and the general tuning of the display is good enough for diving down a YouTube wormhole when you're supposed to be working.\nRead the full review: Acer Aspire Go 15\nThe best Windows laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe Dell XPS 13 hits a sweet spot between portability, price and performance in a Windows laptop.\nWe've long loved the excellent compromise between portability and screen size that is the XPS 13, and the 2024 model maintains that killer look while upgrading to a killer Snapdragon X CPU that delivers outstanding battery life.\nWhile the row of capacitive touch function keys and the invisible touchpad are controversial design choices that take some getting used to, those that do will be rewarded with one of the best Windows laptops you can buy. The 2024 Dell XPS 13 may only have a pair of USB-C ports and little else in the port department, but if you just need a fast, lightweight Windows 11 machine for getting things done on the go, this is a great choice.\nBuy it if\n✅ You want a great Windows laptop: There are many great Windows laptops out there, but the Dell XPS 13 shines with its winning combo of svelte design, performance and portability.\n✅You want great battery life: The Snapdragon X chip helped our review unit last nearly 20 hours (19:41) in our battery test, which is incredible for a Windows laptop. If you want all-day battery life, get an XPS with Snapdragon inside.\n✅ You don't use a lot of peripherals: The XPS 13 only offers two USB-C ports, one of which you need to use when charging the laptop, so it's not great for folks who like to plug in a lot of devices.\nDon't buy it if\n❌ You like physical keys: The Dell XPS 13 has no physical function keys, instead sporting a touch-sensitive bar with light-up capacitive touch keys in its place. So if you hate capacitive touch keys, don't buy this laptop.\n❌ Ports are important: The XPS 13 sports 2 USB-C ports, and that's it. You don't even get a headphone jack (though it does come with an adapter that lets you plug some into a USB port), so if you value ports don't buy this laptop.\nThe bottom line\n💻 The Dell XPS 13 is an excellent Windows laptop that's perfect for work thanks to its light weight, speedy performance and incredible battery life.\nThe review diary\nRead the deep dive ▼\nAfter one week\nLook, Dell. I know you've made a great laptop here in the XPS 13 — it's actually one of my favorites. But removing the 3.5mm headphone jack is a daft decision.\nBut rant aside, my first week was spent just falling in love with those alluring lines and futuristic utilitarian aesthetic of that edge-to-edge keyboard. Plus, it's all crammed into a seriously slim shell (0.6 inches) that is super lightweight 2.6 pounds.\nPlus that aluminum build paired with Gorilla Glass 3 gave me confidence in the durability to throw it straight in my backpack to travel to the office.\nBut then, I unleashed the real superpower here, and its name is Snapdragon X Elite (specifically the top of the range chip that's catchily named X1E-80-100). For the past 30 years, Windows PCs have used x86 chips from Intel and AMD, which are great for crushing tasks but not so great on battery life.\nQualcomm has waded in and changed the whole game with its Arm-based Snapdragon chips — giving laptops peak performance and power efficiency. With over 30 Chrome tabs, a YouTube video running in the background and some Photoshop editing going on, this more than held its own.\nTop that off with a bright, sharp and colorful display, and this is great all-rounder for your work by day and watching whatever shows you love by night (my fiancée is showing me Temptation Island...it's quite something).\nAfter one month\nIn our battery life testing, we found the XPS 13 lasted a whopping 19 hours and 41 minutes. That takes it well into worry-free territory, and I took full advantage of this while out and about — working from cafes, bars and even getting some nods of approval from the other customers are my rather sexy laptop.\nBut two of these design decisions take a little bit of getting used to. First, the keyboard took me a couple weeks to acclimatize to the lack of space between keys. I normally feel for those edges to touch type, and since every key is squished together, it's easy to get lost on the board!\nAnd second, there is no outline around the touchpad. It's not that it's bad — the tactile feel and smooth surface make it a great clicker. But it's camouflaged almost too well into the deck.\nAfter a month, I felt confident that I just saw the future of laptop design. There are definitely some elements that I'd vote against in this future, like the touch-sensitive function row over actual keys and the lack of a headphone jack. But these frustrations melt away.\nRead the full review: Dell XPS 13 (2024) review\nThe best Copilot laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe Lenovo Yoga Slim 7x is a Windows 11 laptop built for portability and efficiency.\nThanks to its Snapdragon X Elite chip, you'll get more than all-day battery life and enough performance to power through your regular workload. The OLED panel is a marvel to behold, and its ultraportable design makes it easy to travel with. For $1,199, it offers an excellent value all around.\nBuy it if\n✅ You want a great Copilot+ laptop: Copilot+ PCs with Snapdragon X Elite chips are great, but the Lenovo Yoga Slim 7x delivers a great combination of portability, performance and battery life.\n✅You want an OLED display: The Lenovo Yoga Slim 7x's OLED display is one of its strongest attributes. It delivers vibrant colors and deep contrasts at a sharp 2,944 x 1,840 resolution.\n✅ You want dependable battery life: The Yoga Slim 7x lasted for 14 hours on our battery life test, which is well more than you'll need for a full workday — with enough left over to stream some videos.\nDon't buy it if\n❌ You expect useful AI features: This is an issue with all Copilot+ PCs at the moment, but the advertised AI features this laptop supports aren't fully realized yet. As such, don't expect this laptop to deliver in that regard.\n❌ You want a headphone jack: If you want to listen to music or videos without bothering your neighbors then you'll need to use a pair of wireless headphones since this laptop doesn't have a headphone jack.\nThe bottom line\n💻 The Lenovo Yoga Slim 7x is arguably the best Copilot+ PC thanks to its ultraportable design, fast performance, gorgeous OLED panel and phenomenal battery life. Best of all, it won't break the bank.\nThe review diary\nRead the deep dive ▼\nAfter one week\nIt's rare that a company thinks about everything when building an ultraportable laptop, which is what made the Lenovo Yoga Slim 7x so special to me for the first week.\nAt 12.8 x 8.8 x 0.5 inches and weighing 2.8 pounds, this sturdy aluminum laptop is supremely small, thin and light. And that Cosmic Blue finish looks so damn sexy...is it weird I call a laptop sexy? Probably, but I'm sticking with it.\nBut then, I opened it up and I was greeted by the 14.5-inch 3K OLED display. These pictures simply do not do it justice — a whopping 901 nits for any HDR content and a pure flash flood of color with a 155% DCI-P3 color gamut. Put simply, this is a true feast for the eyes to savor.\nThen, you realize just how zippy this thing is too with Snapdragon X Elite inside. Rendering video in CapCut, editing in Photoshop, running Apple Music and 10 Chrome tabs at the same time did absolutely nothing to slow it down!\nAnd all of that comes with battery life that gave me no hesitation in taking this machine out and about with me for long periods away from plugs. Putting data to that, the Slim 7x lasted over 14 hours on one charge in our testing.\nBut once again, no headphone jack. Is it too far fetched for me to just want something to connect my cans to?!\nAfter one month\nA few weeks later, I got to appreciate a lot more of the finer details of this laptop's supreme capabilities — along with more of its smaller frustrations too.\nLenovo's always been well known for having the best keyboards in the business, and the Yoga Slim 7x is no different. Every key press feels gorgeously tactile and the subtle dish is perfect for touch typing.\nAlso, while I'm bummed about the lack of a headphone jack, those speakers are a lot better than I imagined them to be. With strong bass production for a warm sound, these even give the MacBook Pro a run for its money.\nBut then, I started running into one key obstacle — app compatibility. Given this is a new kind of chip compared to what Windows 11 has usually ran on, there is a translation layer that should emulate x86 apps for it. And with this you'll get three different results: it'll work but performance is hampered, it'll load up then bug/crash out, or it just won't open.\nPlus, with the big strides made in integrated graphics in Intel and AMD chips, the poor performance in casual games here is a bit of a setback.\nRead the full review: Lenovo Yoga Slim 7x\nThe best Chromebook\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nNot only is the Lenovo Chromebook Plus 14 the best Chromebook you can buy right now, it’s a mighty laptop overall that shows Chrome OS is on a whole new level. That premium finish with stellar ergonomics and a mesmerizing OLED display puts Chrome on full glorious display.\nPair that with a new Arm chip that guarantees peak performance and power efficiency, and a truly AI-infused OS that feels legitimately helpful rather than intruding with a chatbot every opportunity it gets (looking at you, Windows 11), this is a capable coworker through anything you’re doing.\nBuy it if\n✅ Your work/life revolves around Chrome: There’s a lot of us out there. Google Chrome is the center of pretty much everything you do in the day-to-day. If that’s you, the Chromebook Plus 14 is a top pick with an operating system built entirely around this browser — paired with a ton of next-gen AI smarts to boot.\n✅You don’t want the Chromebook compromises: A lot of Chromebooks come with serious cutbacks to keep costs low. Lenovo has ditched all of that with the Chromebook Plus 14. That design is impressively premium and utilitarian, the keyboard and touchpad feel amazing, the Kompanio chip inside is fast and packs good stamina (13+ hours on one charge), and the OLED screen is beautiful.\nDon't buy it if\n❌ You want a budget Chromebook: If you’re OK with those Chromebooks, you can get that Chromebook Plus experience for cheaper. You are definitely getting what you pay for at $649 with that aluminum shell, OLED display and powerful internals, but that is a slightly higher price for a Google laptop.\nThe bottom line\n💻 The Lenovo Chromebook Plus 14 is a standout laptop, offering a well-built design, a stunning OLED display, and a sharp webcam.\nThanks to significant improvements in Chrome OS, this AI-powered system is a powerful tool for productivity. If you're looking for an all-day productivity device for under $650, this is an excellent choice.\nThe review diary\nRead the deep dive ▼\nAfter one week\nI’ll be honest. The Lenovo Chromebook Plus 14 started at a disadvantage. I’ve never been a fan of Chromebooks — they’re usually very cheap-feeling laptops and Chrome OS is always at a disadvantage software-wise. Well, over the first seven days of daily-driving Lenovo’s new notebook, I’ve had my mind blow.\nIt all starts with that premium, utilitarian design — a blend of aluminum and premium ridged plastic along the bottom that makes this feel super durable and allows for great thermal management to keep it cool without a fan.\nNext comes that OLED display that is a real stunner to the eyes, oh and the speakers are almost as good as a MacBook with impressive clarity at 100% volume and deep bass. Then the ergonomics with a really impactful tactile keyboard and silky smooth touchpad.\nAnd finally, that performance and what it can do. The MediaTek Kompanio Ultra 910 chipset brings real horsepower to the Chromebook experience unlike anything I’ve felt before. No matter how many tabs I had open, there was no hint of slowdown. Plus, with it being an Arm CPU, you’re getting stamina guaranteed — over 13 hours on one charge.\nThrow in all the AI smarts like the amazing NotebookLM and Gemini 2.5 Pro, and you’ve got not just a great Chromebook, but a genuinely great laptop that I cannot put down.\nRead the full review: Lenovo Chromebook Plus 14\nThe best laptop to repair and upgrade\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nWhen it came out we called the Framework Laptop the Anti-MacBook because it's everything Apple doesn't do in laptops: Repairable, upgradable and respectful of your rights as an owner.\nI was initially excited about those promises but dubious the company could deliver on them without some glaring sacrifices. But now that I’ve used one myself, I’m happy to report the Framework Laptop is as good as advertised. With its intentionally easy-to-repair design (you can pop pieces off this laptop and get at the innards in minutes, with no tools besides the spudger it comes with) and super cool swappable Expansion Card ports, the Framework Laptop 13 is a versatile ultraportable that's one of the best laptops you can buy if you care about your right to repair and tinker with your devices.\nBuy it if\n✅ You care about your right to repair: I've never seen a laptop that's easier to open up, fiddle around with and put back together. No other laptop on the market can match the Framework in this regard, so if you care about being able to repair and upgrade your laptop, this is the one for you.\n✅ You're plagued by port envy: On most laptops, the ports it comes with are all you get. The Framework is different: you can change what ports it sports by buying hot-swappable Expansion Cards that you plug into 4 slots on the bottom of the laptop, and each can have one port on it. So you can swap out 2 USB-C and 2 USB-A ports for 1 USB-C, 1 USB-A, a DisplayPort out and an Ethernet jack, for example.\n✅ You like a tall screen: The 3:2 display ratio of the Framework's screen feels a bit taller than the displays found on most laptops, and it's great for working with \"tall\" things like long documents, emails, coding projects and more.\nDon't buy it if\n❌ You're scared by pieces of your laptop coming off: The Framework is well-designed and sturdy, but because it's designed to be taken apart you may occasionally find yourself accidentally doing something like popping the bezel off the screen. This is a feature, not a problem, but it can unnerve new owners.\n❌ You don't want to pay extra for ports: The Framework offers unrivaled port versatility thanks to its Expansion Card system, but it does require buying a handful of Cards for all the ports and other options you want, some of which could be easily lost or misplaced.\nThe bottom line\n💻 The Framework Laptop is a remarkable piece of tech. It's a great laptop for getting work done, but more than that it's a statement of purpose, a clear example that every other laptop maker could be building and selling us more repairable, sustainable laptops if they cared to as much as Framework does. Its a fantastic investment if you care about your right to repair and upgrade your own laptop.\nThe review diary\nRead the deep dive ▼\nAfter one week\nI've always been a tinkerer, and not being able to get into my laptop and upgrade it has been one of my biggest frustrations of these portable computers. The Framework Laptop 13 changes all of that by bringing unparalleled repairability and upgradability.\nFancy a different configuration of ports? No problem, those expansion cards can give you more USB-C sockets, HDMI, an SD Card slot and much more.\nYou can also get into the internals too, which means you can switch the battery when the current one dies out, upgrade the RAM or even switch out the motherboard if you want the new generation chip. It took me right back to all those DIY projects of my past (yes the shelves were crooked, but I looked cool, OK!?).\nAnd even better? None of that focus takes away from the functionality of actually using a laptop. The Intel CPU in our test model kept things smooth and responsive with over 30 Chrome tabs (definitely helped by the 32GB of RAM). The keyboard feels surprisingly solid to type on, and comes with a smooth backlighting to help you work by night, and the display is bright and colorful (465 nits to be exact from our testing).\nWhat this essentially means is you're not losing that tight integration of parts that you'd get from a laptop you can't open up. Plus, it's even a little lighter than the MacBook Air at 2.6 pounds.\nAfter one month\nOne month in, I was still loving my time with the Framework Laptop 13, but two things started to irk me a little.\nFirst of all, I'm not sure whether this was a result of needing to be able to open it up, but the cooling works overtime here. The fans can kick up quite a storm when you're doing mid-to-intensive work or casual gaming.\nSecond, using this as my daily driver made me aware of the key depth being a little shallow on the keyboard. It's a small thing, but without that cushioned landing and depth, it can start to get a little tiring to type over long periods of time.\nAnd finally, I started thinking about the decent experience I had with the Framework 13 and comparing it to the price. For the specs you get, you're paying a lot for the privilege of repairability and upgradeability.\nI get it's a long-term investment, but I'd think carefully about whether that ability to get all in there makes sense for you at prices going up to (and over) $2,000 for mid-range specs.\nRead the full review: Framework Laptop 13\nThe best gaming laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe Asus ROG Zephyrus G14 is my personal favorite gaming laptop you can buy — primarily because it doesn’t forget about the “laptop” part like a lot of gaming systems do.\nThis refreshed model packs a ton of power into that sleek MacBook Pro-esque aluminum shell in the form of the latest AMD CPU and Nvidia RTX 50-series GPU combo. But the more things change, the more they (fortunately) stay the same, thanks to that gorgeous CNC-milled utilitarian aesthetic and a mesmerizing OLED display.\nIf you need more raw horsepower dedicated to gaming, there are more performant options, and I recommend you check out our best gaming laptops list. But for a better balance of all elements that still delivers big on power, the Zephyrus G14 is a near-perfect pick.\nBuy it if\n✅ You want a beasty gaming machine: AMD Ryzen AI 9 HX 370 + Nvidia GeForce RTX 5080 makes for a monstrous pairing of power. Combine that with improved cooling and DLSS 4, and you can run the latest AAA games at over 140 FPS in max settings.\n✅ You don’t want other people to know you have a gaming laptop: The standard gaming laptop design is pretty cringe. I always feel uncomfortable pulling one out. But the Zephyrus G14’s tastefully utilitarian CNC-milled aluminum construction looks fantastically subtle from every angle.\n✅ You care about a good screen: That 3K OLED panel is a real marvel to look at — presenting all your favorite games with a real HDR quality that pushes impressive color and a deep contrast ratio.\nDon't buy it if\n❌ Battery life is a chief concern: This is more a problem I’ve found with gaming laptops as a whole rather than this specific model. But it’s worth noting, as the stamina levels of such highly demanding internals does drop the battery life in day-to-day use to below 7 hours of casual use.\n❌ Webcam quality matters: The 1080p webcam remains unchanged from the Zephyrus G14 last year, which means you’re getting quite the grainy picture that struggles with low lighting.\nThe bottom line\n💻 The Asus ROG Zephyrus G14 is a fantastic gaming laptop that kept me entertained across 5,000 miles of travel, balancing performance and portability perfectly. The OLED display makes all your gaming look incredibly colorful and immersive, the speakers have been improved, and it’s impressively thin and lightweight.\nThe review diary\nRead the deep dive ▼\nAfter one week\nThe MacBook Pro vibes are strong with the Zephyrus G14, and while it’s identical to last year’s design, I can’t fault Asus for sticking with it. I mean, why mess with something great, right?\nThe all aluminum shell looks great and feels even better in the hand with a premium nature that is only accented by a single slash of lighting on the lid. None of that cringeworthy RGB, no over the top vents that make this look like you’re putting a whole muscle car on your desk. In my day-to-day, nobody batted an eyelid when taking this out. For the sake of zero social embarrassment, this is easily the best-looking gaming laptop I’ve ever used.\nBut let’s get to what matters here. The gaming performance is, frankly, mindbending when you take into account this is a 14-inch laptop that weighs 3.5 pounds. Wherever you are, firing up Cyberpunk 2077 is a true joy with silky smooth OLED gaming – running at 146 FPS at full resolution, with DLSS 4 turned on and settings at ray tracing: Ultra.\nOne thing I did quickly have to get used to on my travels, though, is that being near a plug outlet is a requirement. This is something gaming laptop owners have gotten used to, but with gaming stamina at just under two hours, you’ll be getting that battery anxiety if you’re in a remote location (like the countryside surrounding Lisbon like I was).\nAfter one month\nBut after a month, those battery life concerns all faded into the background – probably leading back to the fact that (like many of you) most of my life is lived in places near outlets!\nI digress. After a month of usage, I really had to take a step back and appreciate just how this has blended into my life as the daily drive I’ve always been looking for. Not only are those internals great for gaming performance, they can be fantastic for an intense creative workload.\nPremiere Pro renders flashed by, multi-track Pro Tools timelines loaded rapidly, and no matter how many Chrome tabs I threw at this thing, I never saw a hint of slowdown. And getting to work feels good too with a tactile keyboard and a glass-topped touchpad that’s oh-so-smooth.\nAnd as more developers have turned on DLSS 4 functions in their games, I’ve been making the most of that OLED display’s 120Hz refresh rate and playing some buttery smooth games – really taking advantage of the vivid color palette of that panel and it’s inky HDR depth.\nRead the full review: Asus ROG Zephyrus G14\nThe longest-lasting laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe new MacBook Pro 16-inch (M4 Pro, 2024) occupies the middle spot between the more affordable 14-inch MacBook Pro M4 and the more powerful (and expensive) MacBook Pro 16-inch M4 Max. It’s a laptop for those who want a 16-inch MacBook Pro but don’t want to spend an extra $1,000 for an M4 Max model.\nThis laptop sports the same practical design as modern MacBooks, alongside fast M4 Pro-driven performance and nearly 21 hours of battery life. That makes it the best laptop for battery life, and as before, you also get a gorgeous Liquid Retina XDR display, full-height function keys, amazing speakers and plenty of ports.\nBuy it if\n✅ You want a fast MacBook: While you shouldn’t expect this to match the video-crunching power of the beefier M4 Max Max MacBook Pro, the M4 Pro-equipped 16-inch MacBook Pro is one of the fastest laptops on the block.\n✅ Battery life is key: The 16-inch MacBook Pro with M4 Pro set a new high-water mark for battery life when we tested it, lasting for nearly 21 hours in our battery endurance tests. That's one of the longest-lived laptops we've ever tested.\n✅ You don’t want to pay for an M4 Max model: If you want a 16-inch MacBook Pro but don’t want to spend an extra $1,000 for an M4 Max model, this M4 Pro-driven laptop is the best bet as it still offers fantastic performance and epic battery life.\nDon't buy it if\n❌ You’re on a budget: While this laptop is cheaper than an M4 Max MacBook Pro, it’s still an expensive device. If you’re on a budget and mainly want a notebook for work or watching videos, the $1,299 15-inch MacBook Air M2 is a better choice.\n❌ You need more power: Conversely, if you’re a professional content creator or gamer who needs as much processing power as possible, you’re better off with an M4 Max MacBook Pro.\n❌ Notches bug you: There's a little notch in the center of the top bezel where the camera housing sits, and while most of us get used to it some folks really hate the way it looks. If that's you, consider another laptop.\nThe bottom line\n💻 The 16-inch MacBook Pro with M4 Pro delivers some of the best battery life of any laptop we've tested to date, along with great performance, a beautiful display and a refined design.\nThe review diary\nRead the deep dive ▼\nAfter one week\nIf you’ve seen one MacBook Pro, you’ve seen them all. Apple hasn’t budged from the design it introduced four years ago, and why should it? It’s a super upmarket, super durable and ruthlessly utilitarian-looking laptop — sporting a Space Black color that makes it look like the kind of laptop Batman whips out to work on his sigma TikTok compilations (yea, he seems like that kind of guy).\nAnd with that, you’re getting the same deliciously tactile keyboard and gigantic trackpad for peak ergonomics, the same port array that is a little restricted in quantity but decent in variety, and the same display notch that takes a week or so to get used to. Just keep an eye on how many taskbar icons you have up top, as they can disappear behind it!\nBut the real superpowers here come in two forms. First, if you’re sick of seeing your face in the display glass, Apple offers a nano-textured option that is a night and day difference. Working in my local sunlit park is usually a no-go, but with this, I could see everything clearly without a single reflection.\nSecond, and most importantly, that M4 Pro chip is an absolute monster. We could tell you all about our benchmarking (Geekbench 6 scores peaking at 3,910 for single-core and 22,822 for multicore by the way), but let’s talk more practically.\nWith over 30 Chrome Tabs, Apple Music blaring and Photoshop rendering some deep RAW photo edits, I was able to export a complex 4K edit of a 10 minute video in Final Cut Pro in a little over a minute. This is ludicrous power for pro workers and content creators.\nAfter one month\nLook, we all already know that Apple Silicon has been a minor miracle when it comes to battery life and heat dissipation. But after a month of powering through intensive workloads on long haul flights, train journeys that seem to last forever and in the local cafe without my plug, you really start to appreciate that epic stamina.\nAnd at just under 21 hours on one charge when we tested it, it’s no surprise that this is pure worry-free battery life. Even better is that the M4 Pro does all of this without chucking out a lot of heat with the fans or getting warm. This is an impressively efficient and powerful chip.\nBut then, you come across Apple Intelligence. Don’t get me wrong, the ability to rewrite what you type in different tones is kind of helpful, but the rest of the suite, such as the sometimes rather funny notification summaries, doesn’t really contribute much. One mild heart attack at messages from my Fiancée saying she saw a break up on Love Island and asking if I was OK being summarized as “Break-up. Hopes you are OK,” I swiftly turned it off.\nRead the full review: MacBook Pro 14-inch (M4 Pro, 2024)\nThe best MacBook Air alternative\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe MSI Prestige 13 AI+ Evo (from $1,399) isn’t just a fantastic MacBook alternative due to its incredibly lightweight design and compact size, but it also packs nearly as much power as Apple’s excellent offering. That says a lot for this excellent 13-inch laptop, especially if you prefer Windows over macOS.\nWeighing just 2.13 pounds (under 1kg), this laptop makes for a great travel companion for on-the-move professionals or remote workers. With great performance from its Intel Lunar Lake chip and a gorgeous 2.8K OLED display to watch all your favorite shows on, it’s hard to go wrong with this featherweight machine.\nBuy it if\n✅ You need power and portability: The MSI Prestige 13 AI+ Evo’s Intel Core Ultra 7 258V chip and 32GB of DDR5 RAM as standard can handle multi-tasking, creative apps and more — all in a delightfully small package.\n✅ You enjoy a gorgeous display: With a 13.2-inch 2.8K (2880 x 1600) OLED screen, this laptop is great for binging your favorite shows on, and it even offers greater colors than a MacBook Air.\nDon't buy it if\n❌ You need a sturdy laptop: Despite its welcome light weight, the MSI Prestige 13 AI+ Evo can feel cheap and a tad fragile, with plenty of flex on the lid and keyboard. For its premium price, it should feel a lot more durable.\n❌ You’re looking for next-gen AI: Aside from some usual Copilot+ features and effects in video calls, this isn't the AI machine that will change the way you’ll use a laptop — regardless of being “AI+.”\nThe bottom line\n💻 The MSI Prestige 13 AI+ Evo may be a pricey notebook, but it delivers on its promise of delivering excellent performance in a lightweight design, making for a fitting MacBook alternative for Windows fans.\nThe review diary\nRead the deep dive ▼\nAfter one week\nSeeing as MSI has come a long way with its Prestige lineup of laptops, now bringing “AI+ Evo” into the fold, I had high hopes for the Prestige 13 AI+ Evo. Fortunately, it exceeded my expectations right off the bat, and that all came down to its light weight and portability.\nI know it’s extremely light, but I didn’t realize just how light it was until I picked up my M3 MacBook Air and compared the two laptops. There’s a noticeable difference, and made me realize that no, the MacBook Air isn’t the lightest laptop around. At just 2.13 pounds (that’s just under 1kg), I barely felt the Prestige 13 AI+ Evo in my backpack while traveling to and from the office. As far as portable laptops go, it’s already a winner.\nIt isn’t just about design, as this 13-inch laptop also gets brownie points for its performance. It can’t quite keep up with the MacBook Air’s M3 chip or the Dell XPS 13’s Snapdragon X Elite processor, but the latest Intel Lunar Lake CPU it holds is more than enough to help me juggle dozens of Chrome tabs without breaking a sweat. Plus, it’s even up for some light gaming, but not nearly on the level of Cyberpunk 2077.\nI also found that I didn’t need to charge the Prestige 13 AI+ Evo as much as I thought. In our battery tests, it lasted over 14 hours, and in real-world usage, I could get through a day without needing a charge. For my daily tasks, from working on Google Docs to streaming shows, that’s wonderful.\nSpeaking of watching shows, that 13.2-inch 2.8K (2880 x 1600) OLED display is quite the eye-catcher. I adored the punchy colors and clear details in shows like “American Primeval,” and as someone who consistently binges TV series and movies, this was a huge perk to have.\nAs for all the AI features in this “AI+” laptop? Aside from checking out what’s available, I haven’t put them to much use. Well, that’s because I don’t believe they’re particularly essential.\nAfter one month\nWith a month under my belt, the MSI Prestige 13 AI+ Evo still excels as a go-to laptop for travel. The Intel Core Ultra 7 258V chip and 32GB of RAM under its hood have let me get on with tasks without any hiccups, stutters or shutdowns, and its battery continues to get me through the majority of the day. It’s a treat not having to lug around an oversized or overweight laptop, especially if you’re constantly on the move.\nI’ve also frequently used the laptop purely for its display, watching movies in great detail as I whip up a meal in the kitchen. That’s another strength I realized, as the laptop is light and compact enough to take around with me anywhere, almost acting like a tablet.\nI have been worried about the flex in its keyboard and lid though. While it pays to be careful with laptops, the Prestige 13 AI+ Evo needs more care, as its lid and keyboard have too much flex. Aside from still barely using its AI features, I can see this laptop being a favorite for fans of portable notebooks.\nRead the full review: MSI Prestige 13 AI+ Evo\nThe best 2-in-1 laptop\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nA new king of 2-in-1 laptops has taken the throne. Asus has refined the new Zenbook Duo it launched last year with a speed increase to make this a multitasking marvel unlike anything else on this list.\nThat comes down to three reasons. First, the gorgeous dual OLED displays give you a much bigger canvas to work across. Second, the detachable keyboard and touchpad is the best I’ve used in a 2-in-1. And finally, starting at $1,599, this is good value for money for what you get.\nBuy it if\n✅ You’re a multi-screen multitasking machine: If you’re working in front of multiple monitors on your day-to-day, going back to a single laptop screen can be constricting. Well, expand to two gorgeous 3K OLED touchscreen panels and in the words of ‘Step Brothers,’ there’s so much more room for activities!\n✅ You need some strong performance under the hood: The Intel Core Ultra 9 285H makes impressive gains in performance and graphics, to the point that it beats Snapdragon X Elite. This ensures smooth multitasking across every app window you snap on both displays.\n✅ Ergonomics matter: In a lot of 2-in-1 laptops, the keyboard gets compromised. Asus’ detachable board here is amongst the best I’ve typed on with a nice tactile feel to every key press and mouse click. Plus, the latency free multi-touch makes zipping across Windows a breeze.\nDon't buy it if\n❌ You need long battery life: That chip upgrade has compromised the battery life a bit, to the point where you’re looking at just over 6 hours on one charge with both screens running at 120Hz.\n❌ You need a lot of ports: It’s not the stingiest laptop I’ve seen in terms of ports, but with only a couple of Thunderbolt 4 Ports, a USB-A, HDMI and headphone socket, it’s a little limited.\nThe bottom line\n💻 The Asus Zenbook Duo formed a paradigm shift in dual-screen multitasking last year — bringing dual-screen laptops to the masses at a more affordable price. For 2025, the speed increases under the hood make it all the more mighty. Pair this with mesmerizing OLED displays and fantastic ergonomics, and this is a top machine for both work and play. Just watch out for that battery life.\nThe review diary\nRead the deep dive ▼\nAfter one week\nLast year, Asus made one of its best decisions as a company — ditching the weird letterbox second screen and making the Zenbook Duo a full dual-screen laptop. It was one of my favorite systems of 2024, and now it’s back with a refresh in 2025 — firmly planting it on top of the throne of 2-in-1s.\nWhy? Well I’ve tried other foldables and two-screen systems, and the problems are always the same: durability is a problem, the keyboard sucks, and they’re always underpowered because of the limited amount of space in the chassis.\nAfter a week, I quickly realized that Asus said “hold my beer” and overcame each and every single one of this. It all begins with a great utilitarian look that doesn’t look like the weird sandwiches you get from other foldable, which is military-grade tested for durability. Throwing this in your backpack is no problem for it!\nFollowing that is easily the best detachable keyboard and touchpad in the business. Typing and clicking is a pure tactile joy in whatever orientation you use the Duo. And finally, the jump to Intel Core Ultra 200 series brings a big speed boost to performance, SSD loading speeds and graphics — perfect for a varied workload jumping between creative apps, office apps and browsers.\nAnd I can’t let this moment pass without talking about the real main event here in those gorgeous OLED panels! The color is simply *chef’s kiss* and while I’m supposed to say they’re great for multitasking between more admin-based work and content creation, they’re also great to watch Netflix on one panel while you’re supposed to be working on the other.\nAfter one month\nAt roughly the 3-week mark is when I ran into one unexpected obstacle, and that’s the weird looks when you pull this out in public. Not to say it happens everywhere — if I went to my local cafe that is usually full of techies, nobody batted an eyelid. But in the bar, I got a lot of “who’s that weirdo” double takes with this tower of screen in front of me.\nIf you can handle those onlookers, don’t let them get in the way of a good time! But I did feel like the equivalent of being one of those prats who walk around in public wearing a VR headset.\nThat being said, though, when the quick second-takes stopped, having this multitasking marvel on-the-go was significant for split-screen working — having Apple Music, my to do list app and Photoshop ready in a snap on the bottom screen and all the Chrome tabs up top. And with all this, the Intel chipset in here didn’t break a sweat.\nBut it did reveal one issue to me. With the additional horsepower under the hood, battery life has taken a dip. It’s now just over 6 hours in our testing, and in real world use, I recommend keeping a charger with you as it does drain pretty quickly under intense pressure\nRead the full review: Asus Zenbook Duo (2025) review\nThe best MacBook Pro\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe 14-inch MacBook Pro with the M4 chip is one of the most powerful laptops we’ve yet tested, which is all the more impressive when you consider its svelte 3.4-pound chassis slips into a backpack with ease.\nOf course, that's no surprise given that the company has been iterating on this design for years. The addition of an M4 chip under the hood takes the 14-inch MacBook Pro to new heights, making it the best MacBook Pro for most folks thanks to its unbeatable combo of size, performance and price.\nBuy it if\n✅ You need to edit videos on the go: And I'm not talking iMovie clips, either - I'm talking about working with Final Cut and Adobe Premiere to edit videos while you're away from desk. The M4 chip is built for this kind of work, and it will serve you well.\n✅ You plan to work outside often: The M4 MacBook Pro is the first to come with the optional nano-texture glass coating, which costs $150 extra but helps stop glare from bright light-which is great when you work outdoors a lot.\n✅ You want a MacBook that'll last for years: M4 MacBooks are still (barely) viable, so it stands to reason that M4-driven notebooks could potentially last you 5-10 years. This could help justify the admittedly high initial price.\nDon't buy it if\n❌ Gaming is important: The M4 MacBook Pro runs Mac-compatible games pretty well, but it's not the best gaming laptop for the money. If you care about gaming performance, go with one of the best gaming laptops instead.\n❌ You own a MacBook Pro M3: The M4 MacBook Pro is more capable than its predecessor, but not by much. If you already own a recent MacBook Pro and you're not craving the nano-texture coating, there's no reason to rush out and upgrade.\nThe bottom line\n💻 The MacBook Pro 14-inch M4 retains the same fetching design and gorgeous mini-LED display as its predecessors while delivering unprecedented speed and power efficiency. If you want a portable Mac more powerful than a MacBook Air but can't afford the extra expense or weight of a 16-inch MacBook Pro M4, this is the best MacBook Pro for you.\nThe review diary\nRead the deep dive ▼\nAfter one week\nThe 14-inch MacBook Pro is a lot more of the same but with updated internals, which is absolutely not a bad thing. The utilitarian shell may be getting a little old in its 4th generation, but it's still an ultimately damn good-looking laptop with an impressive durability and utilitarian aesthetic — making it look like something that is ready to work hard.\nAnd that much is obvious with the M4 chip inside offering serious horsepower to smash through tasks. Of course, it's not the fastest Apple offers (I'd go for the M4 Pro MacBook Pro if you need that).\nBut for the vast majority of content creators, M4 is more than enough, which when paired with that gorgeous color-accurate 14.2-inch Liquid Retina Display made for a great system to whip up some 4K TikToks on in Final Cut Pro.\nOh, and shout-out to that battery life, which we found was 18 hours and 31 minutes in our own testing. In the clutch moments I found myself in, from a long haul flight to sitting in a cafe with no available power outlets, I had no care in the world for my MacBook's stamina.\nAfter one month\nOne month in, and my love affair (mostly) continued... What do I mean mostly? Well there were some rocky moments. First comes back to why I always love a gaming laptop — having the horsepower to get intensive workloads done and the GPU to handle AAA gaming.\nThe M4 MacBook Pro absolutely nails the first part of this formula, but the second part? Not so much. That isn't to say the situation's getting better, as more developers including CD Projekt Red are rewriting their games for macOS (can't wait to fire up Cyberpunk on a MacBook)!\nBut with that in mind, the M4 chip in here isn't the best at gaming with frame rates hovering around 20-30 FPS in the likes of Tomb Raider and Borderlands 3. You can get better gaming performance in general by spending the same amount of money.\nAlso, with a lot of working with high-capacity files (such as 200GB of 4K video files), a fast SSD is critical, and this MacBook Pro is surprisingly a little on the slower side. In fact, it's a touch slower than the M3 MacBook Pro. This means that you'll be waiting for a little longer than usual when it comes to transporting files (30 seconds extra in my example above).\nRead the full review: MacBook Pro 14-inch M4\nThe best MacBook Pro alternative\nSpecifications\nReasons to buy\nReasons to avoid\nWhat you need to know\nThe Asus ProArt P16 takes the familiar aluminum unibody enclosure of the ROG Zephyrus G16, classes it up a little and repurposes it for creators. It sounds like a small change, but the big updates on display here make it a true masterpiece of a portable creation station.\nThat 4K OLED display is super crispy and color accurate for crucial edits, the combination of AMD Ryzen AI 9 and RTX 4070 power through any and all tasks you throw at it, and the super responsive touch screen + DialPad control give you the options to make the most finite of changes to your creations.\nBuy it if\n✅You’re looking for a Windows 11 laptop for creativity: Whether you’re workload heavily involves Photoshop or Premiere Pro, or if you have a passion for music creation in Pro Tools, the sheer performance potential of this machine will keep up with any demands.\n✅ You want confidence in the color of your work: Not every OLED display is the same. They can look amazing, but not be calibrated for accuracy. Every ProArt P16 is color calibrated so you can be sure that what you’re working on is true to what it will look like in real-life. Plus that display is simply gorgeous.\n✅ You want a laptop you’re proud to whip out in public: A lot of laptops with dedicated GPUs can look a bit garish. The ProArt P16 is very demure and very mindful with its sleek aluminum shell, stellar keyboard and responsive touchpad with DialPad to dial into your creativity.\nDon't buy it if\n❌ You value battery life highly: For the general day-to-day, the stamina is OK. But any additional pressure like RAW Photoshop editing will drain it fast.\n❌ You need lightning fast loading speeds: The SSD loading times in here aren’t overtly bad, but there are far faster options out there for transferring dense files — like the MacBook Pro.\nThe bottom line\n💻 The Asus ProArt P16 is easily one of the best creator laptops you can buy — packing stellar performance, a fantastic display, great ergonomics and AI smarts into a carefully considered and sexy chassis.\nThe review diary\nRead the deep dive ▼\nAfter one week\nI’ve used MacBook Pros for a while now, so you already know it’d take something mesmerizing to drag me away from the Apple ecosystem. Well, Asus went ahead and did it with the ProArt P16. Lean and mean in matte black aluminum, my first week showed me this is essentially a near-perfect laptop for creators.\nIt all begins with the window into your content — a mind-blowing 16-inch 4K OLED touchscreen display, which has been Pantone color calibrated for a super accurate representation of whatever creation you’re working on.\nAt 60Hz, you’re not getting anything zippy that could use those powerful internals for gaming, but that’s not the purpose here. However, that super zippy touch response and included stylus makes this a spectacular canvas for your artistic endeavors.\nOf course, for this to be something for prosumers, you need prosumer-grade specs. And the team has absolutely delivered by choosing the AMD Ryzen AI 9 HX 370 CPU and RTX 4070 GPU pairing. There was no single 4K video render, 3D animation, photo edit or complex sketch that slowed this system down one iota. This is a mean machine that can handle the entire spectrum of professional on-the-go work.\nAnd it does it all with a great keyboard and touchpad, all stashed in a sleek shell (just 0.7 inches thin) that has no sign of a display notch — take that, Apple!\nAfter one month\nA few weeks in, I really figured out a great work/play flow to make the absolute most of the ProArt P16. Because hey — even professionals need to blow off some steam, so being able to play Cyberpunk 2077 at 4K 50 FPS with DLSS turned to performance mode made for a gameplay experience that would make my PS5 very nervous in-between all the advanced rendering work.\nAnd I found that the battery life is a bit of a mixed bag… Let me explain. Over the month, I was seeing that if my workload was a rather simple one of Chrome tabs and Apple Music, I saw my longevity going impressively long for a beast of this spec. In our testing it achieved 9 hours and 32 minutes, after all.\nBut if you are to do 4K edits and renders, and really start to pump out some power (fair warning — those fans are loud if you do), that stamina is hella leaky. Just be aware of what’s on your to-do list and keep that charger nearby.\nPlus, the jury is out on that DialPad. Personally, I loved using it as a mini macro controller to quickly access brush tools in Photoshop, but for every one of me, there’s another person that sees it as a pure gimmick to keep turned off.\nRead the full review: Asus ProArt P16\nAlso tested\nWe test and review hundreds of laptops every year, and just because they don't all make this list doesn't mean they aren't good machines.\nNo, there are loads of great laptops that don't quite achieve the level of excellence needed to lead the pack. But they're still great machines, and they're worth considering if you're looking for a specific feature or another laptop you want isn't available.\nBelow, I've gathered all the great laptops we've tested which don't quite make this list, but are still good alternatives well worth considering if they meet your unique needs, or if you can't find your first choice on sale.\nAcer Chromebook Plus 515 (★★★★☆)\nThis solid, sturdy and reliable Chromebook gives you good performance and speakers (for a Chromebook), plenty of ports and access to Google's AI features for $399. It's a strong contender for the Best Chromebook, but I slightly prefer the Lenovo Flex 5i.\nRead the full Acer Chromebook Plus 515 review.\nAsus ROG Flow Z13 (★★★★☆)\nAsus' ROG Flow Z13 is a marvel of engineering that delivers decent PC gaming power on a lovely 2.5K mini-LED display in an ultra-thin 2-in-1 design. That means you can use it as a gaming laptop or tablet, and the AMD Ryzen AI Max 390 chip inside delivers gaming performance roughly equivalent to a dedicated Nvidia GeForce RTX 4060 laptop GPU. However, the fact that it's more expensive than the ROG Zephyrus G14 and delivers slightly worse gaming performance keeps it from claiming the best gaming laptop honors.\nRead our full Asus ROG flow Z13 review.\nAsus ROG Strix Scar 18 (★★★★☆)\nThe Asus ROG Strix Scar 18 is a big-ass gaming laptop with some muscle thanks to the fact you can get it with up to an Nvidia GeForce RTX 5090 laptop GPU, which makes games run beautifully on the laptop's gorgeous 18-inch 240Hz mini-LED display.\nThe reason it's not higher on this list is that since it's an 18-inch gaming laptop, it's massively heavy and expensive. So if you want a desktop replacement gaming laptop that you don't plan to move much, consider an 18-inch beast like the Scar 18. But for most folks, I think the Asus ROG Zephyrus G14 is still a better option because its smaller and lighter.\nRead our full Asus ROG Strix Scar 18 review.\nDell 14 Plus (★★★★☆)\nThe Dell 14 Plus isn't a bad laptop, but it just doesn't excel beyond any of our picks to dethrone them on this list. That said, this affordable 14-incher is workhorse that gives you solid performance, a comfy keyboard and touchpad, good (13+ hours) tested battery life for under $1,000.\nRead our full Dell 14 Plus review.\nLenovo Legion Pro 7i (★★★★☆)\nI'm a big fan of the Lenovo Legion Pro 7i because it's a capable gaming laptop that sports a sleek design, plenty of ports and a gorgeous 16-inch 1600p 240Hz OLED display. And now that it comes with RTX 50-series laptop GPUs, it can basically plug into your TV and function as a gaming PC you can take with you on the go.\nHowever, I don't recommend it over the Asus ROG Zephyrus G14 because the G14 is smaller and lighter, making it a lot easier to manipulate. And since the G14 also comes with RTX 50-series GPUs now, the Legion Pro 7i's amazing power is not unique to it.\nRead my full Lenovo Legion Pro 7i review.\nLenovo Yoga Pro 9i (★★★★☆)\nI really love the Lenovo Yoga Pro 9i because it's a capable creator laptop with a great design, plenty of ports and a luscious 3.2K touchscreen for under $2,000. If you're willing to pay a bit more, I highly recommend upgrading to a model with a discrete Nvidia GeForce RTX 4050 or 4060 GPU because it makes this laptop better at playing games and handling beefy AI/photo/video workloads.\nRead my full Lenovo Yoga Pro 9i review.\nMSI Prestige 16 AI Evo (★★★★☆)\nThis is a big, speedy Windows 11 laptop with a good (if glossy) 16-inch screen, good performance and 15+ hours of tested battery life thanks to its Intel Core Ultra 2 CPUs. It's not great for gaming, but it is nice for getting work done on the go thanks to its surprising portability.\nRead the full MSI Prestige 16 AI Evo review.\nMicrosoft Surface Laptop 7 (★★★★☆)\nThe Microsoft Surface Laptop 7 ($999 to start) is the first Surface Laptop to ship with a Snapdragon CPU inside, and the extra power and battery life it affords make this the best Surface Laptop yet. Good battery life and performance, along with a comfy keyboard and Wi-Fi 7 support, make this a great ultraportable for getting work done.\nRead the full Microsoft Surface Laptop 7 review.\nBattery benchmarks: comparison\nMy team and I run every laptop through a series of battery tests to see how long it actually lasts on a full charge, which is one of the key deciding factors for most people when buying a laptop. You want to know about how long a laptop will actually last on a full charge so you know when to carry a charger with you, and when you're safe to leave it at home.\nNote that these tests do not reflect real-world use patterns since we have to set every laptop to the same settings in order to do fair comparisons. Thus, while the times listed here are accurate and useful as a comparison point, your own experience with a laptop's battery life will likely vary quite a bit.\nThis is because when we run our battery test we set the laptop's display to 150 nits of brightness and have it endlessly browse the web via Wi-Fi until it dies. However, when you use your laptop you're likely adjusting brightness on the fly, doing all sorts of different tasks while perhaps listening to music or watching a video at the same time, and generally putting the machine through more of a workout than it gets in our test.\nSo while I stand by our testing and the battery life results, I want to be clear that your own experience will vary!\nHow to choose the best laptop for you\nWhat kind of power do you want?\nIf you only need something basic for surfing the web, consider a Chromebook or a cheap Windows laptop with an Intel Core i3 processor and 8GB of RAM, because that's the minimum you should expect from a modern laptop.\nIf you want something that feels speedy and can handle more than basic writing and web browsing, look for beefier laptops with at least an Intel Core i5 CPU from the past few years, 16GB of RAM and a 256GB to 512GB SSD for storage.\nWhat kind of games (if any) do you want to play?\nMost laptops feature integrated graphics chipsets that are built into their CPU, which usually struggle to run demanding modern games but can often handle old or less graphically-demanding games.\nBut if want to play the latest and greatest games on your portable PC you'll want a dedicated gaming laptop, because they come with more powerful discrete laptop graphics cards, more RAM, better cooling systems and other advancements designed to make them decent gaming machines.\nOf course, you have to make compromises when buying a gaming laptop that you don't have to make when buying a gaming PC, since your laptop needs to fit a beefy battery and enough room to be able to discharge heat effectively without cooking its innards.\nThat's why I generally recommend the Asus ROG Zephyrus G14 as the best gaming laptop for most people: it hits a nice sweet spot between price, performance and portability, plus you can get it with the latest Nvidia GeForce RTX 50-series graphics cards and a lovely OLED display.\nBut there are lots of other gaming laptops on the market and we review most of them, so if the 14-inch Zephyrus G14 isn't right for your needs I recommend perusing our regularly-updated list of the best gaming laptops to find more options with bigger screens, better battery life, lower prices and more.\nHow big of a laptop do you want?\nThink about how often you might carry this laptop around. Machines such as the Dell XPS 13 and MacBook Air are remarkably light and slim, but their 13-inch screens are on the small side.\nYou can get a larger 15-inch display on a premium ultraportable like the XPS 15 and still not have to worry about weight too much, but once you start getting up into the realm of 16-inch to 18-inch screens, expect your laptop to weigh at least 3-5 pounds.\nAs mentioned above gaming laptops are almost always several pounds heavier than thin-and-light ultraportables because they need more room for beefier components, but they offer big power in exchange. At under 4 pounds the ROG Zephyrus G14 is actually fairly portable compared to most gaming laptops, which typically range from 5-7 pounds heavy.\nFrequently asked questions\nHow do I find the best laptop deals?\nTom's Guide's crack deals team has scoured the internet and given you the best laptop deals on our favorite laptops just above. But we know they're not going to be the best options for everyone! If you're shopping around for something more suited to your tastes, here's how our team go about finding stellar savings.\nFirst things first, establish what you're looking to buy and set a budget. It's easy to watch costs spiral and before you know it, you've dropped thousands of dollars on additional power and features you may not need. Figuring out what you want to do with your laptop and how much money you're comfortable spending is the best option. For example, saying \"I want a good gaming laptop for under $1,000\" will net you a whole host of great budget-to-mid-range choices.\nSecond, retailers are going to work really hard to make its deals look super attractive with huge percentage discounts, but don't fall for it. I've already spotted numerous deals that have actually been cheaper in the past.\nAs a good sense check for this, take a look at downloading the Camelizer — a Chrome extension that can run an extensive historical price check on any Amazon product. With that line graph, you can see whether that laptop deal is actually a deal.\nAnd finally, within your choice, have a think about what particular features of a laptop matter to you. If you're someone who cares about screen real estate, the choice is obvious. But if you can really stretch the graphical capabilities of that silicon with your workload, think again.\nOr maybe you want the vastly increased amount of app support and customization opportunities of Windows 11, which will also net you better value for money than the MacBooks, but also lacks the simplicity of macOS. Just take a breather, think about what things matter — the software, the keyboard being good to type on, etc — and make the best judgement for you.\nHow much RAM do I need?\nGiven the current demands of apps like Google Chrome being heavily reliant on RAM and the ever increasing move to more AI processes running in the background, I'd aim for at least 16GB of RAM.\nThis is also more than enough for a solid amount of multitasking across intense apps, and even some AAA gaming too. If you're the pro-est of pros, 32GB is a minimum — 3D animation tasks and running the most intensive games alongside an OBS window for Twitch streaming will need that headroom.\nWhat accessories deliver the most bang for my buck?\nLaptops are great for staying productive, informed and entertained on the go, but they can be a little uncomfortable and unwieldy to use for long periods of time.\nThat's why I recommend you invest in a few key accessories if you plan to use a laptop for more than an hour or two a day. These accessories will not only help you feel more comfortable and productive, they can help you work in a healthier and happier way.\nNotably, I seriously recommend you invest in a decent laptop stand because looking down at your laptop for more than a few minutes at a time can do real harm to your back and neck. We have a detailed guide to choosing the best laptop stand for your needs, and you don't to spend a lot to see real results. After all, this $45 laptop stand revolutionized how I work and seriously cut down on my fatigue while working.\nI also recommend you invest a good mouse you like, because relying on the trackpad is less than ergonomic and can lead to real pain and hand issues over time. Check out our guide to the best mouse for all sorts of use cases and budgets for some ideas and advice on how to choose the perfect mouse for your needs.\nFinally, if your laptop doesn't have many ports you might consider getting a good USB hub so you can plug in more accessories when you need them. This is really key to getting the most out of slim ultraportables like the MacBook Air and Dell XPS 13, since they typically have a pair of USB-C ports and that's it.\nHow we tested these laptops\nHow we test the best laptops\nIn our never-ending quest to find the best laptops, I put every computer we test through a barrage of synthetic and real-world tests to benchmark how well it performs compared to the manufacturer's claims, and compare how good it is relative to the competition.\nThese tests include, but are not limited to: measuring the average brightness and color quality of each laptop's display using our in-house colorimeter, using a heat gun to measure the heat generated by the laptop after 15 minutes of strenuous work, and using a mix of real-world and synthetic benchmarks to test how well a laptop performs at various day-to-day tasks.\nI put all laptops through the Geekbench CPU performance benchmark tests as well as various 3DMark tests to measure graphics capabilities. I also run a file transfer test to measure how fast a machine's hard drive is, a video transcoding test to gauge how well a laptop can cut video and a custom battery test that has the machine browse the internet over Wi-Fi until it runs out of juice.\nThere's also gaming benchmarks that I use — testing a basic game like Sid Meier's Civilization VI: Gathering Storm to gauge how good it is at running games compared to other laptops. I use this old game because it runs on a wide variety of laptops across different prices, sizes and operating systems, so it's great for comparing performance.\nOf course when testing dedicated gaming laptops, I run benchmarks for many more demanding and popular games, including Assassin's Creed Valhalla, Cyberpunk 2077 and Red Dead Redemption 2. For more information on our testing process, check out our guide to how we test.\nAlex Wawro is a lifelong journalist who's spent over a decade covering tech, games and entertainment. He helps oversee the computing department at Tom's Guide, which includes managing laptop coverage and reviewing dozens of laptops himself every year.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nAlex Wawro is a lifelong tech and games enthusiast with more than a decade of experience covering both for outlets like Game Developer, Black Hat, and PC World magazine. A lifelong PC builder, he currently serves as a senior editor at Tom's Guide covering all things computing, from laptops and desktops to keyboards and mice.\n- Jason EnglandManaging Editor — Computing",
  "source": "Tom's Guide",
  "published_at": null
}