{
  "title": "Mahindra, MG Challenge Tata Motors' EV Lead as India’s Electric Car Market Grows 52% in May",
  "url": "https://www.autocarpro.in/analysis/mahindra-mg-challenge-tata-motors-ev-lead-as-indias-electric-car-market-grows-52-in-may-126737",
  "content": "Mahindra, MG Challenge Tata Motors' EV Lead as India’s Electric Car Market Grows 52% in May\nBE.06 and XEV 9E push Mahindra’s EV sales up 338% as MG narrows gap with Tata; E-PV market surges 60% in FY26 so far.\nIndia’s electric passenger vehicle (E-PV) segment is witnessing a fierce three-way battle for supremacy as Mahindra & Mahindra and MG Motor India aggressively close the gap with Tata Motors, the long-time market leader.\nIn May 2025, the top three players—Tata Motors, MG Motor, and Mahindra—accounted for a commanding 87.3% share of the electric PV market, according to vehicle registration data. But the leadership dynamics are shifting rapidly, with Mahindra emerging as the fastest-growing player and MG Motor narrowing Tata’s lead to just 606 units, challenging the established order in a market that grew 52% year-on-year last month.\nIn May, electric car sales grew by over 50% to 12197 units, where the market has already crossed 25000 units for both April and May in FY-26 with a growth of 60%\nMahindra Roars Ahead, Grows 338%\nMahindra & Mahindra posted a 338% YoY jump in May 2025, registering 2,604 units, up from 594 units a year ago, according to the Vahan portal. Its market share has now climbed to 21.3%, up 1,394 basis points, making it the third-largest electric vehicle (EV) player in the country.\nMahindra’s rise is driven by growing traction for its all-new Born Electric BE.06 SUV and its first XEV 9E architecture-based models, which are gaining strong retail visibility and customer acceptance. In just two months of FY26, Mahindra has clocked 5,818 units, a 360% YoY rise, reflecting the sharpest momentum shift among all major OEMs.\nMG Motor India Doubles Volumes, Inches Closer to Tata\nMG Motor, meanwhile, delivered 3,732 EVs in May—a 147% increase over the same month last year—boosting its market share to 30.6%, up 1,178 basis points. Its compact Comet EV and updated ZS EV continue to attract both personal and fleet buyers, but its most significant driving force Windsor continues to gain momentum.\nIt is now Tata’s most immediate rival, coming within striking distance of the top position for the first time since the EV market took off in India.\nTata Motors Faces Share Erosion as Growth Plateaus\nTata Motors, which once commanded two-thirds of India’s electric PV market, saw its share fall to 35.4% in May 2025, down 3,078 basis points from the same month last year. It registered 4,319 units, a 19% YoY decline, and dropped 8% month-on-month.\nIn the first two months of FY26, Tata has sold 9,038 electric vehicles (EVs), down 14% year-over-year (YoY) from 10,477 units in the same period last year. Its core models, Nexon EV, Tiago EV, and Tigor EV, remain popular, but they are facing increasing pressure from newer, fresher alternatives. Punch EV brings in critical volumes, but the upcoming launches of Harrier and Seirra EV will be critical for the current financial year.\nThe market’s rapid expansion and evolving buyer preferences mean Tata’s early-mover advantage is no longer sufficient. Competitors are now matching or exceeding its performance in key metrics such as value, tech appeal, and brand perception.\nTop 3 Players – May 2025 (Electric PV Market)\nFY26 So Far: Market Up 60%, Leadership in Flux\nBetween April and May 2025, the total electric PV market grew 60% to 25,317 units, up from 15,794 units in the same period last year.\n- Tata Motors leads with 9,038 units (–14% YoY)\n- MG Motor is second with 7,436 units (+168% YoY)\n- Mahindra holds third with 5,818 units (+360% YoY)\nThese three OEMs control nearly nine out of every ten electric cars sold in India so far in FY26; however, their relative positions are shifting rapidly.\nHyundai, BYD, BMW Continue to Build Niche Presence\nOutside the top three, Hyundai Motor India sold 509 units in May, up 103% YoY, and its FY26 sales stand at 1,335 units. BYD India clocked 491 units last month (+177%), growing its base steadily in both B2C and B2B verticals.\nBMW India doubled its EV volumes to 172 units, as premium EV adoption gains traction, albeit on a small scale: Mercedes-Benz, Volvo Cars, and Audi round out the luxury segment with single or low double-digit contributions.\nOutlook: Segment Maturing, Brand Play Becoming Central\nThe electric PV segment is maturing—no longer led by a single dominant player. Consumer decision-making is expanding beyond range and cost to include brand trust, tech features, resale value, and after-sales service.\nWith Tata Motors under pressure, MG and Mahindra are now rewriting the competitive script. The upcoming quarters will be critical as all players ramp up their retail efforts, expand their portfolios, and prepare for increased product activity in the second half of FY26.\nIf current growth holds, India’s electric passenger vehicle segment is on track to cross 150,000 units this fiscal—marking its best-ever annual performance yet.\nSource: VAHAN (excluding Telangana) / Autocar Professional Analysis\nNote: Figures are registration-based. Dispatches reported by companies may vary.\nRELATED ARTICLES\nExclusive: Top Six e-2W OEMs Command 76% Share of 3.65 Million Units Sold Since 2018\nOf the over 200 players in India’s electric two-wheeler market, Ola Electric, TVS Motor Co, Bajaj Auto, Ather Energy, Gr...\nMotorcycle Sales Down 6% to 3.7 Million Units in April-July, Dragged by Entry-Level Segment\nOverall motorcycle market is impacted by the 8% YoY decline in sales of the fuel-sipping, volume-generating 100cc and 12...\nReview: Tata Motors powers up Harrier appeal with new electric variant\nWith both single- and dual-motor options, the Harrier EV is uniquely positioned as a rugged all-wheel drive, all-electri...",
  "source": "Autocar Professional",
  "published_at": null
}