{
  "title": "META_TITLE_QUOTE",
  "url": "https://finance.yahoo.com/quote/META/",
  "content": "Meta Platforms, Inc. (META)\n- Previous Close\n739.10 - Open\n739.23 - Bid 716.84 x 100\n- Ask 755.19 x 100\n- Day's Range\n734.59 - 756.80 - 52 Week Range\n479.80 - 796.25 - Volume\n10,556,176 - Avg. Volume\n12,170,077 - Market Cap (intraday)\n1.896T - Beta (5Y Monthly) 1.27\n- PE Ratio (TTM)\n27.38 - EPS (TTM)\n27.57 - Earnings Date Oct 29, 2025\n- Forward Dividend & Yield 2.10 (0.28%)\n- Ex-Dividend Date Jun 16, 2025\n- 1y Target Est\n861.90\nMeta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality and mixed reality headsets, augmented reality, and wearables worldwide. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; Instagram that brings people closer through instagram feed, stories, reels, live, and messaging; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; Threads, an application for text-based updates and public conversations; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact in a private way. The RL segment provides virtual, augmented, and mixed reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California.\ninvestor.atmeta.com75,945\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nInternet Content & Information\nIndustry\nRecent News: META\nView MoreRelated Videos: META\nPerformance Overview: META\nTrailing total returns as of 8/22/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: META\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: META\nView MoreValuation Measures\nMarket Cap\n1.86T\nEnterprise Value\n1.86T\nTrailing P/E\n26.82\nForward P/E\n27.93\nPEG Ratio (5yr expected)\n2.33\nPrice/Sales (ttm)\n10.72\nPrice/Book (mrq)\n9.52\nEnterprise Value/Revenue\n10.40\nEnterprise Value/EBITDA\n18.98\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n39.99%\nReturn on Assets (ttm)\n18.47%\nReturn on Equity (ttm)\n40.65%\nRevenue (ttm)\n178.8B\nNet Income Avi to Common (ttm)\n71.51B\nDiluted EPS (ttm)\n27.57\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n47.07B\nTotal Debt/Equity (mrq)\n25.41%\nLevered Free Cash Flow (ttm)\n31.99B\nResearch Analysis: META\nView MoreResearch Reports: META\nView MoreThe bears had a chance to turn at least the short-term trend to the downside, but the bulls fought back and the uptrend off the April bottom appears to be on track.\nThe bears had a chance to turn at least the short-term trend to the downside, but the bulls fought back and the uptrend off the April bottom appears to be on track. We saw some minor sell signals on August 1, but they have been erased. The major indices rallied last week, albeit in choppy fashion, with up days on Monday, Wednesday, and Friday, and down days on Tuesday and Thursday. The sell signals and warnings that we had on August 1 included a bearish crossover of the five-day- and 13-day exponential moving averages (EMAs), a break of the 21-day EMA, and the cycling of the Vortex indicator into negative territory. In addition, price volatility picked up following the July 31 bearish reversal, and that can be a bad sign after a big advance. The 21-day rate of change (ROC) got very close to cycling into negative territory before popping last week. We still have two bearish divergences on the daily moving-average convergence/divergence (MACD) after cycling into extreme overbought territory -- a warning, but not a sell signal. For now, it looks like the major indices could be at the start of another leg higher, with the S&P 500 (SPX) just missing a closing all-time high on Friday and the Nasdaq and Nasdaq 100 reaching closing highs. The Commitment of Traders (COT) data for the SPX remains bullish, but is bearish for the Nasdaq 100. The data for the volatility index (VIX) is bullish, suggesting we could see another move higher and then an eventual pullback in the stock market. Over the weekend, Ethereum broke out of a base going back to March 2024 and is close to all-time highs, while Bitcoin broke out of a flag on Sunday and also is near to all-time highs. (Mark Arbeter, CMT)\nRaising target price to $850\nMeta Platforms operates the world's largest family of social networking websites, including the flagship Facebook site, Instagram, Facebook Messenger, WhatsApp, Reels, and Threads. The sites enable users to communicate with friends and family by posting to the site; to comment on others' posts; to share photographs, website links, and videos; to message; and to play games. The company also partners with application developers to add functionality to the sites, and allows users to pay for virtual goods and services through its Payments function. Meta derives about 55% of its revenue from outside the U.S. and Canada.\nRatingPrice TargetStocks are higher at Monday midday. The dot plot thickens (pun intended).\nStocks are higher at Monday midday. The dot plot thickens (pun intended). The odds of a Fed rate cut in September are now 85%, a big reversal from Friday morning before the release of the Jobs report. That data has economists rethinking the strength of the labor market. The yield on the 10-year Treasury note is 4.22%, a big drop from last week. Crude oil is at $66 per barrel.\nMeta Earnings: Ad Engine Firing on All Cylinders Even as AI Costs Mount; FVE up to $850 From $770\nMeta is the largest social media company in the world, boasting close to 4 billion monthly active users worldwide. The firm's \"Family of Apps,\" its core business, consists of Facebook, Instagram, Messenger, and WhatsApp. End users can leverage these applications for a variety of different purposes, from keeping in touch with friends to following celebrities and running digital businesses for free. Meta packages customer data, gleaned from its application ecosystem and sells ads to digital advertisers. While the firm has been investing heavily in its Reality Labs business, it remains a very small part of Meta’s overall sales.\nRatingPrice Target\nTop Analysts: META\nView MoreOverall Score\nDiscover which analysts rank highest for META overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of META.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of META.\nLearn More",
  "source": "Yahoo Finance",
  "published_at": null
}